<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：在博与专之间取得平衡 平衡最合适 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2664 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x201C;&amp;#x535A;&amp;#x201D;&amp;#x4E0E;&amp;#x201C;&amp;#x4E13;&amp;#x201D;&amp;#x4E0A;&amp;#x7684;&amp;#x8FF7;&amp;#x5931;
&amp;#x5047;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：在博与专之间取得平衡 平衡最合适">
<meta property="og:url" content="http://snowyying.github.io/2016/g-programming-guide-5-balance/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2664 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x201C;&amp;#x535A;&amp;#x201D;&amp;#x4E0E;&amp;#x201C;&amp;#x4E13;&amp;#x201D;&amp;#x4E0A;&amp;#x7684;&amp;#x8FF7;&amp;#x5931;
&amp;#x5047;&amp;#">
<meta property="og:updated_time" content="2017-01-12T02:31:14.081Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：在博与专之间取得平衡 平衡最合适">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2664 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x201C;&amp;#x535A;&amp;#x201D;&amp;#x4E0E;&amp;#x201C;&amp;#x4E13;&amp;#x201D;&amp;#x4E0A;&amp;#x7684;&amp;#x8FF7;&amp;#x5931;
&amp;#x5047;&amp;#">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Learn and live.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-g-programming-guide-5-balance" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：在博与专之间取得平衡 平衡最合适
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/g-programming-guide-5-balance/" class="article-date">
  <time datetime="2016-08-05T05:22:00.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA; http://www.nowamagic.net/librarys/veda/detail/2664 2014&#x5E74;01&#x6708;20&#x65E5;</code></p>
<p>&#x201C;&#x535A;&#x201D;&#x4E0E;&#x201C;&#x4E13;&#x201D;&#x4E0A;&#x7684;&#x8FF7;&#x5931;</p>
<p>&#x5047;&#x8BBE;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x805A;&#x7126;&#xFF0C;&#x5E76;&#x4E14;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x81EA;&#x5DF1;&#x5B9E;&#x9645;&#x53C2;&#x4E0E;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x76F8;&#x543B;&#x5408;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x5C31;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x4E86;&#xFF1F;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x7B54;&#x6848;&#x4ECD;&#x7136;&#x662F;&#x5426;&#x5B9A;&#x7684;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B50;&#x9886;&#x57DF;&#x91CC;&#xFF0C;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x53BB;&#x8003;&#x8651;&#x201C;&#x535A;&#x201D;&#x4E0E;&#x201C;&#x4E13;&#x201D;&#x7684;&#x5747;&#x8861;&#x3002;</p>
<a id="more"></a>
<p>&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x800C;&#x8A00;&#xFF0C;&#x8BBE;&#x8BA1;&#x662F;&#x518D;&#x5E38;&#x89C1;&#x4E0D;&#x8FC7;&#xFF0C;&#x518D;&#x7B80;&#x5355;&#x4E0D;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x8BCD;&#x4E86;&#x3002;&#x53EF;&#x5982;&#x679C;&#x628A;&#x89C6;&#x89D2;&#x62D4;&#x9AD8;&#x4E00;&#x70B9;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5355;&#x4EE5;&#x8BBE;&#x8BA1;&#x800C;&#x8BBA;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x7A77;&#x5C3D;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x626B;&#x63CF;&#x4E00;&#x4E0B;&#x548C;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x90E8;&#x5206;&#x6982;&#x5FF5;&#xFF1A;</p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x4E0E;&#x8BBE;&#x8BA1;<br>&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x4E0E;&#x8BBE;&#x8BA1;<br>&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x5F00;&#x53D1;<br>&#x5951;&#x7EA6;&#x5F0F;&#x7F16;&#x7A0B;<br>&#x9762;&#x5411;&#x65B9;&#x9762;&#x7684;&#x5F00;&#x53D1;<br>&#x57FA;&#x4E8E;&#x7EC4;&#x4EF6;&#x7684;&#x5F00;&#x53D1;<br>&#x5143;&#x7F16;&#x7A0B;<br>&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x65B9;&#x6CD5;&#x8BBA;&#x4E5F;&#x4F1A;&#x548C;&#x8BBE;&#x8BA1;&#x7275;&#x626F;&#x5230;&#x4E00;&#x8D77;&#xFF1A;</p>
<p>&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x5F00;&#x53D1;<br>&#x654F;&#x6377;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;<br>&#x5982;&#x679C;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x8FD8;&#x4E0D;&#x591F;&#x591A;&#xFF0C;&#x90A3;&#x53EF;&#x4EE5;&#x53BB;Wiki&#x4E0A;&#x67E5;&#x7F16;&#x7A0B;&#x7684;&#x8303;&#x5F0F;(paradigms)&#x8FD9;&#x4E2A;&#x6761;&#x76EE;&#xFF0C;&#x90A3;&#x91CC;&#x5217;&#x4E86;47&#x79CD;&#x8303;&#x5F0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x548C;&#x8BBE;&#x8BA1;&#x591A;&#x5C11;&#x6709;&#x70B9;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x8FD9;&#x4E9B;&#x8FD8;&#x53EA;&#x662F;&#x8BF4;&#x4E86;&#x8BBE;&#x8BA1;&#xFF0C;&#x5982;&#x679C;&#x6A2A;&#x5411;&#x5C55;&#x5F00;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x4E2D;&#x5FC5;&#x7136;&#x8FD8;&#x4F1A;&#x7275;&#x6D89;&#x5230;&#x6846;&#x67B6;&#x7684;&#x9009;&#x7528;&#x3001;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4ECE;&#x535A;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x8BBE;&#x8BA1;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x770B;&#x4F3C;&#x72ED;&#x5C0F;&#x7684;&#x9886;&#x57DF;&#x4E2D;&#x4ECD;&#x7136;&#x662F;&#x6CA1;&#x8FB9;&#x754C;&#x7684;&#x3002;</p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;API&#x7814;&#x7A76;&#x7684;&#x518D;&#x900F;&#xFF0C;&#x4E5F;&#x662F;&#x4F4E;&#x503C;&#x4EBA;&#x7FA4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x548C;&#x5355;&#x7EAF;&#x4F1A;&#x7528;&#x67D0;&#x4E2A;API&#x76F8;&#x6BD4;&#xFF0C;&#x4ECE;&#x521B;&#x9020;&#x4EF7;&#x503C;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x8981;&#x53BB;&#x5BFB;&#x627E;&#x5E7F;&#x535A;&#x4E0E;&#x7CBE;&#x4E13;&#x95F4;&#x7684;&#x5747;&#x8861;&#x70B9;&#xFF1A;&#x65E2;&#x4E0D;&#x80FD;&#x95ED;&#x4E0A;&#x773C;&#x775B;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5C31;&#x7528;&#x663E;&#x5FAE;&#x955C;&#x6765;&#x770B;&#x4E16;&#x754C;&#x3002;&#x800C;&#x8FD9;&#x4E00;&#x5747;&#x8861;&#x70B9;&#x7684;&#x4EF7;&#x503C;&#x5219;&#x53EF;&#x7528;&#x53CD;&#x6728;&#x6876;&#x539F;&#x7406;&#x6765;&#x8BF4;&#x660E;&#xFF1A;&#x6728;&#x6876;&#x539F;&#x7406;&#x8BF4;&#x7684;&#x662F;&#x6876;&#x91CC;&#x7684;&#x6C34;&#x662F;&#x7531;&#x6700;&#x77ED;&#x7684;&#x4E00;&#x5757;&#x677F;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x4F46;&#x8003;&#x91CF;&#x4EBA;&#x7684;&#x4EF7;&#x503C;&#x65F6;&#x5374;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x53CD;&#x6728;&#x6876;&#x539F;&#x7406;&#xFF0C;&#x5373;&#x4EBA;&#x7684;&#x4EF7;&#x503C;&#x5F80;&#x5F80;&#x7531;&#x6700;&#x957F;&#x7684;&#x4E00;&#x5757;&#x677F;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x8003;&#x8651;&#x535A;&#x548C;&#x4E13;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x80FD;&#x79BB;&#x5F00;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x8FDB;&#x884C;&#x8003;&#x8651;&#xFF0C;&#x524D;&#x9762;&#x66FE;&#x7ECF;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x5F80;&#x5F80;&#x548C;&#x516C;&#x53F8;&#x7684;&#x73B0;&#x91D1;&#x6D41;&#x7ED1;&#x5B9A;&#x7684;&#x66F4;&#x7D27;&#xFF0C;&#x80FD;&#x4E3A;&#x73B0;&#x91D1;&#x6D41;&#x8D21;&#x732E;&#x529B;&#x91CF;&#x7684;&#x6280;&#x672F;&#x624D;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6280;&#x672F;&#x3002;&#x800C;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x672C;&#x8EAB;&#x4E8B;&#x5B9E;&#x4E0A;&#x5BF9;&#x535A;&#x548C;&#x4E13;&#x7684;&#x7A0B;&#x5EA6;&#x63D0;&#x51FA;&#x4E86;&#x6700;&#x57FA;&#x672C;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x8FD9;&#x79CD;&#x8981;&#x6C42;&#x5F80;&#x5F80;&#x5177;&#x6709;&#x8FED;&#x4EE3;&#x7684;&#x7279;&#x8D28;&#x3002;&#x4E3A;&#x4E86;&#x5F62;&#x8C61;&#x7684;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x91CC;&#x4E3E;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8FDB;&#x884C;&#x4E00;&#x70B9;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x8DCC;&#x4EE3;&#x91CC;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x8FBE;&#x5230;&#x4E24;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x76EE;&#x6807;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x53EF;&#x4EE5;&#x4E3A;&#x4EA7;&#x54C1;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x529B;&#x91CF;&#xFF0C;&#x4F46;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x666E;&#x901A;&#x3002;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x5982;&#x679C;&#x8FBE;&#x4E0D;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x4F1A;&#x5931;&#x53BB;&#x81EA;&#x5DF1;&#x7684;&#x5B58;&#x5728;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#x6700;&#x5C11;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;C++)&#x3001;&#x67D0;&#x4E2A;&#x5E73;&#x53F0;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;Windows)&#x3001;&#x67D0;&#x4E2A;IDE&#xFF08;&#x6BD4;&#x5982;:Visual Studio)&#x548C;&#x67D0;&#x4E9B;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x6253;&#x5370;&#x4F53;&#x7CFB;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x53EF;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x5708;&#x7684;&#x5C0F;&#x70B9;&#xFF0C;&#x4F46;&#x7528;&#x5230;&#x7684;&#x5219;&#x8981;&#x5B66;&#x900F;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4E0D;&#x7BA1;&#x63A5;&#x89E6;&#x5230;&#x90A3;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x90FD;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x673A;&#x5236;&#x3001;&#x7EBF;&#x7A0B;&#x673A;&#x5236;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x548C;&#x56FD;&#x9645;&#x5316;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x5168;&#x5C40;&#x6027;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E86;&#x89E3;&#x67D0;&#x4E2A;&#x63A5;&#x53E3;&#x600E;&#x4E48;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x5E76;&#x975E;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x201C;&#x9760;&#x8FD0;&#x6C14;&#x7F16;&#x7A0B;&#x201D;&#xFF0C;&#x5199;&#x5B8C;&#x7A0B;&#x5E8F;&#x540E;&#x8FD8;&#x8981;&#x7948;&#x7977;&#x4ED6;&#x80FD;&#x8DD1;&#x8D77;&#x6765;&#x3002;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x8D1F;&#x62C5;&#x8D77;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x53EA;&#x80FD;&#x505A;&#x65C1;&#x89C2;&#x8005;&#xFF0C;&#x6CA1;&#x6CD5;&#x53C2;&#x4E0E;&#x5230;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x6765;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5E76;&#x80FD;&#x8D1F;&#x62C5;&#x4E9B;&#x5C42;&#x6B21;&#x66F4;&#x9AD8;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x8981;&#x6BD4;&#x8F83;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3001;&#x7ED3;&#x6784;&#x5316;&#x65B9;&#x6CD5;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x7406;&#x89E3;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5E76;&#x80FD;&#x628A;&#x5B83;&#x4EEC;&#x7528;&#x597D;&#x3002;&#x81F3;&#x5C11;&#x8981;&#x80FD;&#x5224;&#x5B9A;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5199;&#x7684;&#x597D;&#xFF0C;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x5199;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x540C;&#x65F6;&#x9762;&#x5BF9;&#x9700;&#x6C42;&#x80FD;&#x628A;&#x5DE5;&#x4F5C;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x524D;&#x4E24;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x57FA;&#x7840;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#x5B66;&#x6821;&#x4E2D;&#x57FA;&#x7840;&#x6253;&#x7684;&#x8D8A;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x8D8A;&#x77ED;&#x3002;&#x8FBE;&#x6210;&#x8FD9;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x76EE;&#x6807;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x60C5;&#x5883;&#x6765;&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x535A;&#x4E0E;&#x4E13;&#x9009;&#x62E9;&#x4E0A;&#x7684;&#x7B2C;&#x4E8C;&#x6B21;&#x8FED;&#x4EE3;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x65F6;&#x5019;&#x4E5F;&#x8981;&#x8C28;&#x8BB0;&#x4E0D;&#x8981;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x5F00;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x5C42;&#x6B21;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x3002;</p>
<ol>
<li>&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x8003;&#x8651;&#x4E13;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x91CC;&#x628A;&#x77E5;&#x8BC6;&#x6DF1;&#x5316;&#x4E0B;&#x53BB;&#x3002;&#x505A;&#x9A71;&#x52A8;&#x5C31;&#x8981;&#x7406;&#x89E3;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;&#x673A;&#x5236;&#xFF0C;&#x505A;&#x6253;&#x5370;&#x7684;&#x5C31;&#x8981;&#x4E86;&#x89E3;&#x9875;&#x9762;&#x63CF;&#x8FF0;&#x8BED;&#x8A00;&#x7B49;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8981;&#x9002;&#x5F53;&#x8B66;&#x60D5;&#x8FB9;&#x9645;&#x6548;&#x5E94;&#x3002;</li>
</ol>
<p>&#x8FB9;&#x9645;&#x6548;&#x5E94;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x8BA9;&#x4E00;&#x4EA9;&#x5730;&#x4ECE;&#x4EA9;&#x4EA7;500&#x65A4;&#x589E;&#x52A0;&#x5230;1000&#x65A4;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x6295;&#x5165;100&#x5757;&#xFF1B;&#x8BA9;&#x4EA9;&#x4EA7;&#x4ECE;1000&#x589E;&#x52A0;&#x5230;1500&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;200&#x5757;&#xFF1B;&#x8BA9;&#x4EA9;&#x4EA7;&#x4ECE;1500&#x589E;&#x52A0;&#x5230;2000&#x5219;&#x9700;&#x8981;400&#x5757;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x5BF9;C++&#x7684;&#x5B66;&#x4E60;&#xFF0C;C++&#x662F;&#x516C;&#x8BA4;&#x7684;&#x590D;&#x6742;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x505A;C++&#x7684;&#x5F8B;&#x5E08;&#xFF0C;&#x90A3;&#x4E48;&#x4F30;&#x8BA1;&#x641E;&#x4E2A;10&#x5E74;&#x53EF;&#x80FD;&#x591F;&#x8D44;&#x683C;&#x4E86;&#xFF0C;&#x4F46;&#x95EE;&#x9898;&#x662F;&#x628A;&#x65F6;&#x95F4;&#x90FD;&#x6295;&#x5728;&#x8FD9;&#x4E2A;&#x4E0A;&#xFF0C;&#x6295;&#x5165;&#x4EA7;&#x51FA;&#x6BD4;&#x53EF;&#x80FD;&#x4E0D;&#x597D;&#x3002;&#x800C;&#x505C;&#x5728;&#x90A3;&#x91CC;&#x5408;&#x9002;&#x5219;&#x662F;&#x4E2A;&#x5C3A;&#x5EA6;&#x95EE;&#x9898;&#xFF0C;&#x5927;&#x81F4;&#x6765;&#x8BB2;&#x662F;&#x53EF;&#x4EE5;&#x9760;&#x65F6;&#x95F4;&#x5F25;&#x8865;&#x7684;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x4E13;&#x5230;&#x6700;&#x5E95;&#x5C42;&#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;100&#x4E07;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x9884;&#x5148;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x4E86;&#x89E3;&#x6BCF;&#x4E00;&#x5904;&#x7EC6;&#x8282;&#xFF0C;&#x5C31;&#x6709;&#x70B9;&#x8FC7;&#x4E86;&#x3002;</p>
<ol>
<li>&#x53EF;&#x4EE5;&#x628A;&#x535A;&#x518D;&#x63A8;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x719F;&#x6089;&#x4E13;&#x95E8;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x3001;&#x719F;&#x6089;&#x591A;&#x79CD;&#x65E2;&#x5B58;&#x6846;&#x67B6;&#x7684;&#x7279;&#x6027;&#x3001;&#x719F;&#x6089;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x5173;&#x952E;&#x70B9;&#x3002;&#x719F;&#x6089;&#x591A;&#x79CD;&#x65E2;&#x5B58;&#x6846;&#x67B6;&#x7684;&#x7279;&#x6027;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#x662F;&#xFF1A;</li>
</ol>
<p>&#x8BBE;&#x8BA1;&#x67D0;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x5C31;&#x662F;&#x662F;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x6A21;&#x5757;&#x3002;&#x4E00;&#x65E6;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x6A21;&#x5757;&#xFF08;&#x5305;&#xFF0C;&#x6846;&#x67B6;&#x7B49;&#xFF09;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x8003;&#x8651;&#x7A76;&#x7ADF;&#x7528;&#x90A3;&#x4E2A;&#x3002;</p>
<p>&#x505A;&#x8FD9;&#x7C7B;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E00;&#x5B9A;&#x5E7F;&#x535A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x505A;&#x9009;&#x62E9;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x7279;&#x522B;&#x7684;&#x8270;&#x96BE;&#x3002;</p>
<p>&#x5047;&#x4F7F;&#x8BF4;&#x73B0;&#x5728;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x8981;&#x5BFC;&#x5165;&#x4E00;&#x5957;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x505A;&#x51B3;&#x5B9A;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x8003;&#x8651;&#x6240;&#x6709;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;</p>
<p>&#x81EA;&#x5DF1;&#x4ECE;&#x5934;&#x9020;&#xFF0C;&#x8FD8;&#x662F;&#x7528;&#x73B0;&#x6210;&#x7684;&#x505A;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#xFF1F;<br>&#x7528;&#x73B0;&#x6210;&#x7684;&#xFF0C;&#x662F;&#x7528;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF0C;&#x5FAE;&#x8F6F;&#x7684;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x516C;&#x53F8;&#x7684;&#xFF1F;<br>&#x7528;&#x5FAE;&#x8F6F;&#x7684;&#x8BDD;&#xFF0C;&#x662F;&#x7528;MS Project&#x8FD8;&#x662F;&#x57FA;&#x4E8E;SharePoint&#xFF0C;&#x8FD8;&#x662F;&#x6DF7;&#x5408;&#xFF1F;&#x8003;&#x8651;License&#x8D39;&#x7528;&#x7684;&#x8BDD;&#x771F;&#x7684;&#x5212;&#x7B97;&#x4E48;&#xFF1F;<br>&#x7528;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x9009;&#x9879;&#x7A76;&#x7ADF;&#x5BFC;&#x5165;&#x90A3;&#x4E00;&#x4E2A;?<br>&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x4ECE;&#x5934;&#x9020;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x57FA;&#x4E8E;&#x5FAE;&#x8F6F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD8;&#x662F;&#x57FA;&#x4E8E;LAMP&#x8FD9;&#x6837;&#x7684;&#x6280;&#x672F;&#xFF1F;<br>&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6846;&#x67B6;&#xFF1F;<br>&#x5982;&#x679C;&#x8981;&#x505A;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#xFF1F;<br>&#x4E00;&#x4E2A;&#x4EBA;&#x5F88;&#x96BE;&#x7CBE;&#x901A;&#x4E0A;&#x9762;&#x6240;&#x6709;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4F46;&#x5F53;&#x505A;&#x9009;&#x62E9;&#x65F6;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x6982;&#x5FF5;&#x4E5F;&#x662F;&#x707E;&#x96BE;&#x6027;&#x7684;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8003;&#x8651;&#x535A;&#x4E0E;&#x4E13;&#x5E73;&#x8861;&#x70B9;&#x65F6;&#x4F3C;&#x4E4E;&#x6709;&#x4E00;&#x79CD;&#x7279;&#x4F8B;&#xFF0C;&#x94BB;&#x7814;&#x7279;&#x5B9A;&#x7B97;&#x6CD5;&#x7684;&#x4EBA;&#xFF0C;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x53EA;&#x5F80;&#x4E13;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x94BB;&#x7814;TTS&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x51E0;&#x5341;&#x5E74;&#x5982;&#x4E00;&#x65E5;&#x53EA;&#x8981;&#x4E13;&#x6CE8;&#x4E8E;TTS&#x5C31;&#x5B8C;&#x4E86;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5177;&#x4F53;&#x9009;&#x62E9;&#x90A3;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x5219;&#x8981;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x60C5;&#x5F62;&#x6765;&#x5B9A;&#x3002;&#x603B;&#x7684;&#x539F;&#x5219;&#x662F;&#x8981;&#x4EE5;&#x5F53;&#x4E0B;&#x5DE5;&#x4F5C;&#x4E3A;&#x6839;&#x57FA;&#xFF0C;&#x4EE5;&#x5B9E;&#x7528;&#x4E3A;&#x76EE;&#x7684;&#x7504;&#x9009;&#x5404;&#x79CD;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x8FFD;&#x6C42;&#x5E73;&#x8861;&#x70B9;&#x3002;</p>
<p>&#x5927;&#x81F4;&#x4E0A;&#x8BB2;&#xFF0C;&#x671F;&#x671B;&#x505A;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x7684;&#x66F4;&#x9002;&#x5408;&#x524D;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x800C;&#x671F;&#x671B;&#x505A;&#x6280;&#x672F;&#x7BA1;&#x7406;&#x7684;&#x5219;&#x66F4;&#x9002;&#x5408;&#x540E;&#x4E00;&#x7C7B;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x65F6;&#x673A;&#x4E0E;&#x5FC5;&#x8981;&#x6027;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BB2;&#x8D8A;&#x662F;&#x6CA1;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x8D8A;&#x4E0D;&#x9002;&#x5408;&#x5B66;&#x4E60;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x8D8A;&#x9700;&#x8981;&#x89C4;&#x5212;&#x6574;&#x4F53;&#x628A;&#x63E1;&#x5168;&#x5C40;&#x7684;&#x65F6;&#x5019;&#x8D8A;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#x8986;&#x76D6;&#x7684;&#x5143;&#x7D20;&#x975E;&#x5E38;&#x7E41;&#x6742;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x7BA1;&#x7406;&#x3001;&#x6D41;&#x7A0B;&#x3001;&#x5F00;&#x53D1;&#x6A21;&#x578B;&#x3001;&#x4F30;&#x7B97;&#x3001;&#x5206;&#x6790;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7B49;&#x3002;&#x8FD9;&#x65E0;&#x7591;&#x4F1A;&#x628A;&#x77E5;&#x8BC6;&#x9762;&#x6269;&#x5C55;&#x7684;&#x5F88;&#x5BBD;&#xFF0C;&#x4E00;&#x65E6;&#x6CA1;&#x6709;&#x6839;&#x5E95;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x53D8;&#x6210;&#x7EB8;&#x4E0A;&#x8C08;&#x5175;&#xFF0C;&#x5938;&#x5938;&#x5176;&#x8C08;&#x3002;</p>
<p>&#x5728;&#x4F17;&#x591A;&#x8F6F;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7EDD;&#x5BF9;&#x662F;&#x5F88;&#x7279;&#x522B;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x5F88;&#x9119;&#x89C6;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x8BF4;&#xFF1A;&#x6211;&#x4E00;&#x770B;&#x5230;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x4E66;&#x5C31;&#x76F4;&#x63A5;&#x7565;&#x8FC7;&#xFF1B;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5F88;&#x63A8;&#x5D07;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x4F1A;&#x82B1;&#x5F88;&#x5927;&#x7684;&#x5FC3;&#x601D;&#x53BB;&#x7814;&#x7A76;&#x654F;&#x6377;&#x3001;CMMI&#x7B49;&#x3002;</p>
<p>&#x521A;&#x5165;&#x804C;&#x573A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5927;&#x81F4;&#x4E0A;&#x662F;&#x8BA8;&#x538C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E1C;&#x897F;&#x79BB;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x8DF5;&#x6709;&#x70B9;&#x8FDC;&#xFF0C;&#x5E76;&#x4E14;&#x4E3B;&#x8981;&#x662F;&#x6DFB;&#x52A0;&#x675F;&#x7F1A;&#x3002;&#x4F46;&#x65E2;&#x7136;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7EB7;&#x7E41;&#x7684;&#x5386;&#x53F2;&#x90FD;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x51FA;&#x89C4;&#x5F8B;&#xFF0C;&#x5FFD;&#x89C6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5185;&#x5728;&#x89C4;&#x5F8B;&#x65E0;&#x7591;&#x7684;&#x5BF9;&#x6709;&#x5FD7;&#x4E8E;&#x6210;&#x4E3A;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x4EBA;&#x662F;&#x4E0D;&#x5229;&#x7684;&#x3002;</p>
<p>&#x771F;&#x8981;&#x5B66;&#x4E60;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x4ECE;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x5F88;&#x9AD8;&#x7684;&#x6559;&#x79D1;&#x4E66;&#x5F00;&#x59CB;&#xFF0C;&#x800C;&#x9002;&#x5408;&#x4ECE;&#x300A;&#x4EE3;&#x7801;&#x5927;&#x5168;&#x300B;&#x8FD9;&#x6837;&#x4E0E;&#x5B9E;&#x9645;&#x5173;&#x8054;&#x6BD4;&#x8F83;&#x7D27;&#x5BC6;&#x7684;&#x4E66;&#x7C4D;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x5728;&#x56FD;&#x5185;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x843D;&#x5730;&#x4F3C;&#x4E4E;&#x59CB;&#x7EC8;&#x56F0;&#x96BE;&#xFF0C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x76F8;&#x5173;&#x540D;&#x8BCD;&#x59CB;&#x7EC8;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x53D8;&#x6362;&#xFF08;ISO&#xFF0C;CMMI&#xFF0C;&#x654F;&#x6377;&#x7B49;&#xFF09;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x80FD;&#x843D;&#x5730;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x5374;&#x4E0D;&#x591A;&#xFF0C;&#x8FD9;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x79CD;&#x540A;&#x8BE1;&#x7684;&#x5C40;&#x9762;&#xFF1A;&#x521A;&#x5BF9;&#x4E00;&#x4E2A;&#x7EDD;&#x671B;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x5BF9;&#x65B0;&#x7684;&#x4E00;&#x4E2A;&#x62A5;&#x4EE5;&#x5E0C;&#x671B;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6B65;&#x9AA4;&#x4E0A;&#x505A;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;&#x8FD9;&#x79CD;&#x72B6;&#x51B5;&#x4E5F;&#x8BB8;&#x6709;&#x5176;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6BD4;&#x5982;&#x751F;&#x5B58;&#x538B;&#x529B;&#x8FC7;&#x4E8E;&#x5F3A;&#x5927;&#x5BFC;&#x81F4;&#x5DE5;&#x7A0B;&#x529B;&#x91CF;&#x7684;&#x957F;&#x8FDC;&#x4EF7;&#x503C;&#x88AB;&#x6F20;&#x89C6;&#xFF0C;&#x8FDB;&#x800C;&#x4F7F;&#x65B9;&#x6CD5;&#x8BBA;&#x5E76;&#x4E0D;&#x4E3A;&#x89E3;&#x51B3;&#x73B0;&#x5B9E;&#x95EE;&#x9898;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x8BC1;&#x4E66;&#x800C;&#x5B58;&#x5728;&#x3002;&#x5F88;&#x96BE;&#x636E;&#x6B64;&#x5C31;&#x8BF4;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/g-programming-guide-5-balance/" data-id="cj0gavbw5003gpcskrt9xuxis" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/g-programming-guide-5-balance/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/g-programming-guide-6-golden-time/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：别错过人生中学习的黄金时期 保持知识更新
        
      </div>
    </a>
  
  
    <a href="/2016/g-programming-guide-4-become-master/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：为何你成不了编程高手？ 成长路上常见的坑</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/g-programming-guide-5-balance/" data-title="码路指南：在博与专之间取得平衡 平衡最合适" data-url="http://snowyying.github.io/2016/g-programming-guide-5-balance/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0] 
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">16</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">12</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12px;">C</a> <a href="/tags/C/" style="font-size: 12px;">C++</a> <a href="/tags/C-C/" style="font-size: 15px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 12px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 18px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11px;">poll</a> <a href="/tags/select/" style="font-size: 13px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/性能/" style="font-size: 13px;">性能</a> <a href="/tags/成长/" style="font-size: 19px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 18px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 17px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14px;">设计模式</a> <a href="/tags/软件质量/" style="font-size: 11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">三月 2017</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">二月 2017</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">七月 2016</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/network-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/network-api-restful-overview/">理解 RESTful 架构</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>