<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：程序员的几个职场发展方向 职场该如何走？ | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2660 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;

&amp;#x6E05;&amp;#x4EE3;&amp;#x8457;&amp;#x540D;&amp;#x5B66;&amp;#x8005;&amp;#x66FE;&amp;#x5BF9;&amp;#x77E5;&amp;#x8BC6;&amp;#x5730;&amp;#x56FE;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：程序员的几个职场发展方向 职场该如何走？">
<meta property="og:url" content="http://snowyying.github.io/2016/g-programming-guide-3-direction/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2660 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;

&amp;#x6E05;&amp;#x4EE3;&amp;#x8457;&amp;#x540D;&amp;#x5B66;&amp;#x8005;&amp;#x66FE;&amp;#x5BF9;&amp;#x77E5;&amp;#x8BC6;&amp;#x5730;&amp;#x56FE;&amp;">
<meta property="og:updated_time" content="2017-01-12T02:31:14.121Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：程序员的几个职场发展方向 职场该如何走？">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2660 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;

&amp;#x6E05;&amp;#x4EE3;&amp;#x8457;&amp;#x540D;&amp;#x5B66;&amp;#x8005;&amp;#x66FE;&amp;#x5BF9;&amp;#x77E5;&amp;#x8BC6;&amp;#x5730;&amp;#x56FE;&amp;">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不破, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-g-programming-guide-3-direction" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：程序员的几个职场发展方向 职场该如何走？
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/g-programming-guide-3-direction/" class="article-date">
  <time datetime="2016-08-05T05:16:41.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2660 2014&#x5E74;01&#x6708;18&#x65E5;</code></p>
<blockquote>
<p>&#x6E05;&#x4EE3;&#x8457;&#x540D;&#x5B66;&#x8005;&#x66FE;&#x5BF9;&#x77E5;&#x8BC6;&#x5730;&#x56FE;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x505A;&#x8FC7;&#x975E;&#x5E38;&#x7CBE;&#x786E;&#x7684;&#x8868;&#x8FF0;&#xFF1A;</p>
<p>&#x51E1;&#x8BFB;&#x4E66;&#x6700;&#x5207;&#x8981;&#x8005;&#xFF0C;&#x76EE;&#x5F55;&#x4E4B;&#x5B66;&#x4E5F;&#x3002;&#x76EE;&#x5F55;&#x660E;&#xFF0C;&#x65B9;&#x53EF;&#x8BFB;&#x4E66;&#xFF0C;&#x4E0D;&#x660E;&#xFF0C;&#x7EC8;&#x662F;&#x4E71;&#x8BFB;&#x3002;</p>
<p>&#x2014;&#x2014; &#x738B;&#x9E23;&#x76DB;&#xFF0C;&#x300A;&#x5341;&#x4E03;&#x53F2;&#x5546;&#x69B7;&#x300B;</p>
</blockquote>
<p>&#x76EE;&#x5F55;&#x5373;&#x662F;&#x5730;&#x56FE;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x66F4;&#x613F;&#x610F;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x7684;&#x201C;&#x5730;&#x56FE;&#x201D;&#xFF0C;&#x8FD9;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x5BF9;&#x5F52;&#x7EB3;&#x5404;&#x79CD;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x77E5;&#x8BC6;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<h6 id="1-&#x901A;&#x7528;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;"><a href="#1-&#x901A;&#x7528;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;" class="headerlink" title="1. &#x901A;&#x7528;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;"></a>1. &#x901A;&#x7528;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;</h6><ul>
<li>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;C/C++&#xFF0C;Java&#xFF0C;C#&#xFF0C;Python&#xFF0C;Perl&#xFF0C;PHP&#x7B49;&#xFF09;</li>
<li>&#x6846;&#x67B6;&#x548C;&#x7C7B;&#x5E93;(Struts&#xFF0C;Spring&#xFF0C;OSGi&#x7684;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;MFC&#xFF0C;Boost&#x7B49;)</li>
<li>&#x5E73;&#x53F0;(Windows API&#xFF0C;POSIX&#xFF0C;.Net Framework&#x203B;1&#xFF0C;Java API&#xFF0C;C/C++ Runtime Library&#x7B49;&#xFF09;&#x3002;&#x6070;&#x5982;Jeffry Richter&#x6240;&#x8BF4;&#xFF0C;&#x5927;&#x591A;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4ECE;&#x5185;&#x5B58;&#x673A;&#x5236;&#x3001;&#x7EBF;&#x7A0B;&#x673A;&#x5236;&#x3001;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3001;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x3001;&#x7EC4;&#x4EF6;&#x7EC4;&#x5408;&#x7B49;&#x65B9;&#x9762;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x8003;&#x5BDF;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x3002;</li>
<li>&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784; (CPU&#x6307;&#x4EE4;&#xFF0C;&#x865A;&#x62DF;&#x5B58;&#x50A8;&#x7B49;)</li>
<li>&#x6570;&#x636E;&#x5E93;</li>
<li>&#x5B9E;&#x7528;&#x6280;&#x5DE7; (&#x8C03;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;&#x7B49;)</li>
</ul>
<p>&#x2026; &#x2026;<br><em>\</em>1&#x6709;&#x7684;&#x65F6;&#x5019;&#x5B50;&#x7C7B;&#x522B;&#x95F4;&#x7684;&#x754C;&#x9650;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x754C;&#x5B9A;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5B58;&#x5728;&#x7740;&#x50CF;.Net Framework&#x8FD9;&#x6837;&#x6DB5;&#x76D6;&#x4E86;&#x8FC7;&#x591A;&#x5185;&#x5BB9;&#x7684;&#x6982;&#x5FF5;&#x3002;*</p>
<a id="more"></a>
<h6 id="2-&#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x521B;&#x5EFA;&#x548C;&#x4F18;&#x5316;"><a href="#2-&#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x521B;&#x5EFA;&#x548C;&#x4F18;&#x5316;" class="headerlink" title="2. &#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x521B;&#x5EFA;&#x548C;&#x4F18;&#x5316;"></a>2. &#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x521B;&#x5EFA;&#x548C;&#x4F18;&#x5316;</h6><ul>
<li>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;/&#x7ED3;&#x6784;&#x5316;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;</li>
<li>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</li>
<li>&#x91CD;&#x6784;</li>
<li>&#x5951;&#x7EA6;&#x5F0F;&#x7F16;&#x7A0B;</li>
<li>UML *2</li>
</ul>
<p>&#x2026; &#x2026;</p>
<p><em>\</em>2  &#x4ECE;&#x5F62;&#x5F0F;&#x4E0A;&#x6765;&#x770B;UML&#x66F4;&#x8FD1;&#x4F3C;&#x4E8E;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x4ECE;&#x5176;&#x76EE;&#x7684;&#x4E0A;&#x6765;&#x770B;&#x4E5F;&#x8BB8;&#x5F52;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x66F4;&#x5408;&#x9002;&#x7684;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x3002;*</p>
<h6 id="3-&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x77E5;&#x8BC6;"><a href="#3-&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x77E5;&#x8BC6;" class="headerlink" title="3. &#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x77E5;&#x8BC6;"></a>3. &#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x77E5;&#x8BC6;</h6><ul>
<li>&#x56FE;&#x5F62;&#x56FE;&#x50CF;&#x7B97;&#x6CD5;</li>
<li>&#x7F51;&#x7EDC;&#x534F;&#x8BAE;</li>
<li>&#x4EBA;&#x5DE5;&#x667A;&#x80FD;</li>
<li>&#x6570;&#x503C;/&#x975E;&#x6570;&#x503C;&#x7C7B;&#x7B97;&#x6CD5;</li>
<li>&#x8D22;&#x52A1;&#x77E5;&#x8BC6;</li>
<li>&#x8D1F;&#x8F7D;&#x5747;&#x8861;</li>
</ul>
<p>&#x2026; &#x2026;</p>
<h6 id="4-&#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x95F4;&#x63A5;&#x77E5;&#x8BC6;"><a href="#4-&#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x95F4;&#x63A5;&#x77E5;&#x8BC6;" class="headerlink" title="4. &#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x95F4;&#x63A5;&#x77E5;&#x8BC6;"></a>4. &#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x95F4;&#x63A5;&#x77E5;&#x8BC6;</h6><ul>
<li>&#x9700;&#x6C42;&#x5F00;&#x53D1;&#x548C;&#x63CF;&#x8FF0;</li>
<li>&#x4F30;&#x7B97;</li>
<li>&#x4F30;&#x7B97;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#xFF0C;COCOMO, FP&#x7B49;&#x3002;</li>
<li>&#x4F30;&#x7B97;&#x672F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x8BA1;&#x6570;&#x7B49;&#x539F;&#x59CB;&#x529E;&#x6CD5;&#x3002;</li>
<li>&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x548C;&#x65B9;&#x6CD5;&#x8BBA;</li>
<li>&#x8F7B;&#x91CF;&#x578B;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;&#x6BD4;&#x5982;&#x654F;&#x6377;&#x3002;</li>
<li>&#x5927;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;&#x6BD4;&#x5982;CMMI</li>
<li>&#x7EFC;&#x5408;&#x5206;&#x6790;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x300A;&#x4EBA;&#x6708;&#x795E;&#x8BDD;&#x300B;&#xFF0C;&#x300A;&#x4EBA;&#x4EF6;&#x300B;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</li>
</ul>
<p>&#x968F;&#x7740;&#x5F85;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x901A;&#x7528;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x4E2D;&#xFF0C;&#x51E0;&#x79CD;&#x6280;&#x672F;&#x5F80;&#x5F80;&#x4F1A;&#x7EC4;&#x6210;&#x4E00;&#x79CD;&#x6280;&#x672F;Stack&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x9700;&#x8981;&#x88AB;&#x770B;&#x505A;&#x4E00;&#x7EC4;&#x5FC5;&#x987B;&#x4E00;&#x8D77;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;LAMP&#xFF08;Linux+Apache+MySQL+Python/PHP&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E0A;&#x9762;&#x7F57;&#x5217;&#x7684;&#x8FDC;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF0C;&#x8FD9;&#x79CD;&#x7F57;&#x5217;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5C55;&#x793A;&#x4E00;&#x79CD;&#x5206;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x8FD9;&#x79CD;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8865;&#x5145;&#x548C;&#x5B8C;&#x5584;&#xFF0C;&#x5927;&#x591A;&#x53EF;&#x63A5;&#x89E6;&#x5230;&#x77E5;&#x8BC6;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x5F52;&#x5165;&#x7279;&#x5B9A;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;WinRT&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x5E73;&#x53F0;&#xFF0C;HTML5&#x5219;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7B49;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x53C2;&#x7167;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x7C7B;&#x5EFA;&#x7ACB;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x56FE;&#xFF0C;&#x6709;&#x70B9;&#x95EE;&#x9898;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6709;&#x5C31;&#x6BD4;&#x6CA1;&#x6709;&#x8981;&#x597D;&#x5F88;&#x591A;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x4F9D;&#x636E;&#x8FD9;&#x6837;&#x7684;&#x5730;&#x56FE;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x4E00;&#x6761;&#x81EA;&#x5DF1;&#x7684;&#x7EBF;&#x8DEF;&#xFF0C;&#x6301;&#x7EED;&#x7D2F;&#x79EF;&#xFF0C;&#x5BFB;&#x6C42;&#x5B9E;&#x8DF5;&#x673A;&#x4F1A;&#xFF0C;&#x6700;&#x7EC8;&#x5C31;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x9AD8;&#x624B;&#x3002;</p>
<p>&#x800C;&#x5173;&#x4E8E;&#x589E;&#x503C;&#x6240;&#x9700;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x6240;&#x8981;&#x907F;&#x5F00;&#x7684;&#x9677;&#x9631;&#xFF0C;&#x5C06;&#x4E0B;&#x9762;&#x9646;&#x7EED;&#x63D0;&#x5230;&#x3002;</p>
<p>&#x589E;&#x503C;&#x3001;&#x8BFB;&#x4E66;&#x4E0E;&#x5927;&#x5C40;&#x89C2;</p>
<p>&#x5355;&#x7EAF;&#x4ECE;&#x8FBE;&#x6210;&#x67D0;&#x4E00;&#x76EE;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x8BFB;&#x4E66;&#x5F80;&#x5F80;&#x975E;&#x662F;&#x7EDD;&#x5BF9;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x79E6;&#x59CB;&#x7687;&#x628A;&#x4E66;&#x4E00;&#x628A;&#x706B;&#x70E7;&#x4E86;&#xFF0C;&#x5218;&#x90A6;&#x9879;&#x7FBD;&#x4E00;&#x6837;&#x9020;&#x53CD;&#x5E76;&#x53D6;&#x5F97;&#x80DC;&#x5229;&#x3002;&#x4F46;&#x8BFB;&#x4E66;&#x65E0;&#x7591;&#x7684;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x4E00;&#x4E2A;&#x4EBA;&#x589E;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BB0;&#x4E0D;&#x5F97;&#x662F;&#x8C01;&#x8BF4;&#x8FC7;&#xFF1A;&#x5B9E;&#x8DF5;&#x65E0;&#x7591;&#x662F;&#x4EBA;&#x7C7B;&#x6700;&#x597D;&#x7684;&#x8001;&#x5E08;&#xFF0C;&#x4F46;&#x53EA;&#x9760;&#x5B9E;&#x8DF5;&#x6765;&#x8BA4;&#x77E5;&#x4E16;&#x754C;&#x65E0;&#x7591;&#x4E5F;&#x662F;&#x611A;&#x8822;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x7CBE;&#x8F9F;&#x7684;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8981;&#x60F3;&#x57F9;&#x517B;&#x5927;&#x5C40;&#x89C2;&#xFF0C;&#x90A3;&#x5C31;&#x975E;&#x8BFB;&#x4E66;&#x4E0D;&#x53EF;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x4EB2;&#x8EAB;&#x7ECF;&#x5386;&#xFF0C;&#x5728;&#x5927;&#x7684;&#x65F6;&#x7A7A;&#x80CC;&#x666F;&#x4E2D;&#x5F80;&#x5F80;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x622A;&#x9762;&#xFF0C;&#x8FD9;&#x4E00;&#x622A;&#x9762;&#x4E2D;&#x7EDD;&#x4E0D;&#x4F1A;&#x5305;&#x542B;&#x53EF;&#x4EE5;&#x5F52;&#x7EB3;&#x51FA;&#x6240;&#x6709;&#x771F;&#x7406;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x4F9D;&#x8D56;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x5B9E;&#x8DF5;&#x4E5F;&#x5C31;&#x5FC5;&#x7136;&#x9650;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x89C6;&#x91CE;&#x3002; &#x8FD9;&#x4E00;&#x70B9;&#x968F;&#x7740;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x8D23;&#x4EFB;&#x8303;&#x56F4;&#x53D8;&#x5927;&#x5F80;&#x5F80;&#x4F1A;&#x4F53;&#x73B0;&#x4E3A;&#x4E00;&#x79CD;&#x5236;&#x7EA6;&#x548C;&#x9650;&#x5236;&#x3002;&#x6240;&#x4EE5;&#x57F9;&#x6839;&#x8BB2;&#xFF1A;&#x6709;&#x5B9E;&#x9645;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x867D;&#x80FD;&#x591F;&#x5904;&#x7406;&#x4E2A;&#x522B;&#x6027;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x4F46;&#x82E5;&#x8981;&#x7EFC;&#x89C2;&#x6574;&#x4F53;&#xFF0C;&#x8FD0;&#x7B79;&#x5168;&#x5C40;&#xFF0C;&#x5374;&#x552F;&#x6709;&#x5B66;&#x8BC6;&#x65B9;&#x80FD;&#x529E;&#x5230;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4ECE;&#x5B9E;&#x8DF5;&#x6765;&#x770B;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8981;&#x60F3;&#x57F9;&#x517B;&#x51FA;&#x4E00;&#x79CD;&#x5927;&#x5C40;&#x89C2;&#xFF0C;&#x90A3;&#x5C31;&#x975E;&#x8BFB;&#x4E66;&#x4E0D;&#x53EF;&#x3002;&#x800C;&#x5927;&#x5C40;&#x89C2;&#x5F80;&#x5F80;&#x662F;&#x6210;&#x4E3A;&#x5C06;&#x5E05;&#x4E4B;&#x624D;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x5230;&#x8F6F;&#x4EF6;&#x800C;&#x8A00;&#xFF0C;&#x6709;&#x4E00;&#x672C;&#x5F88;&#x6709;&#x540D;&#x7684;&#x4E66;&#x5BF9;&#x57F9;&#x517B;&#x6280;&#x672F;&#x7684;&#x5927;&#x5C40;&#x89C2;&#x6709;&#x5E2E;&#x52A9;&#xFF1A;&#x300A;&#x4EE3;&#x7801;&#x5927;&#x5168;&#x300B;&#x3002;&#x81F3;&#x4E8E;&#x4E13;&#x4E1A;&#x6027;&#x8F83;&#x5F3A;&#x7684;&#x4E66;&#xFF0C;&#x53CD;&#x5012;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x60C5;&#x666F;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x63D0;&#x4E86;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4E0A;&#x9762;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x5F20;&#x5730;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5177;&#x4F53;&#x7684;&#x53BB;&#x8003;&#x8651;&#x51E0;&#x6761;&#x8FDB;&#x9636;&#x8DEF;&#x5F84;&#x3002;</p>
<h2 id="&#x8DEF;&#x5F84;&#x4E00;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x67B6;&#x6784;&#x5E08;"><a href="#&#x8DEF;&#x5F84;&#x4E00;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x67B6;&#x6784;&#x5E08;" class="headerlink" title="&#x8DEF;&#x5F84;&#x4E00;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x67B6;&#x6784;&#x5E08;"></a>&#x8DEF;&#x5F84;&#x4E00;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x67B6;&#x6784;&#x5E08;</h2><p>&#x67B6;&#x6784;&#x5E08;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x706B;&#x7684;&#x804C;&#x4F4D;&#x540D;&#x5B57;&#xFF0C;&#x4F46;&#x4F60;&#x5F88;&#x96BE;&#x7ED9;&#x5B83;&#x4E0B;&#x7CBE;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6240;&#x9648;&#x8FF0;&#x7684;&#x4E00;&#x5207;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#x548C;&#x4F53;&#x4F1A;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5B83;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x89E3;&#x91CA;&#x5B8C;&#x5168;&#x543B;&#x5408;&#x3002;&#x56E0;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x4E43;&#x81F3;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6A21;&#x7CCA;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x5FC3;&#x53BB;&#x627E;&#xFF0C;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5404;&#x79CD;&#x5B9A;&#x4E49;&#xFF08;&#x751A;&#x81F3;IEEE&#x548C;SEI&#x7684;&#x5B9A;&#x4E49;&#x4E5F;&#x4E0D;&#x4E00;&#x81F4;&#xFF09;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x4F60;&#x53EA;&#x80FD;&#x53C2;&#x7167;&#x522B;&#x4EBA;&#xFF0C;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x6765;&#x8BB2;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E5F;&#x662F;&#x8BBE;&#x8BA1;&#xFF0C;&#x6240;&#x4EE5;&#x51E1;&#x662F;&#x505A;&#x8BBE;&#x8BA1;&#x7684;&#x90FD;&#x53EF;&#x4EE5;&#x79F0;&#x81EA;&#x5DF1;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x89C4;&#x6A21;&#x53D8;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x51B3;&#x7B56;&#x5C31;&#x5177;&#x6709;&#x4E86;&#x7279;&#x522B;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9700;&#x8981;&#x4E13;&#x95E8;&#x7684;&#x4EBA;&#x6765;&#x505A;&#xFF0C;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E5F;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x522B;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x8003;&#x8651;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8003;&#x8651;&#x9009;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3001;&#x9009;&#x7528;&#x90A3;&#x4E2A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x3001;&#x9009;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x5C0F;&#x89C4;&#x6A21;&#x7A0B;&#x5E8F;&#x4E2D;&#x5F80;&#x5F80;&#x662F;&#x5C45;&#x4E8E;&#x6B21;&#x8981;&#x5730;&#x4F4D;&#x7684;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x95E8;&#x6216;&#x51E0;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x80FD;&#x591F;&#x5F88;&#x719F;&#x7EC3;&#x7684;&#x5199;&#x51FA;&#x8D28;&#x91CF;&#x8F83;&#x9AD8;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4ED6;&#x60F3;&#x6210;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x4EBA;&#x9996;&#x5148;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x4E13;&#x4E1A;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x4E13;&#x4E1A;&#x53EF;&#x4EE5;&#x662F;&#x201C;&#x91D1;&#x878D;&#x201D;&#xFF0C;&#x201C;&#x8D22;&#x52A1;&#x201D;&#xFF0C;&#x201C;&#x7535;&#x5546;&#x201D;&#xFF0C;&#x201C;&#x7BA1;&#x7406;&#x201D;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5C5E;&#x4E8E;&#x67D0;&#x4E00;&#x4E13;&#x4E1A;&#x7684;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x3002;&#x5982;&#x679C;&#x628A;&#x9700;&#x6C42;&#x548C;&#x6700;&#x7EC8;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x770B;&#x6210;&#x63CF;&#x8FF0;&#x540C;&#x4E00;&#x4E8B;&#x7269;&#x7684;&#x4E00;&#x4F53;&#x4E24;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x8BBE;&#x8BA1;&#x59CB;&#x7EC8;&#x662F;&#x8981;&#x67B6;&#x8D77;&#x8FD9;&#x4E24;&#x8005;&#x95F4;&#x7684;&#x6865;&#x6881;&#x3002;&#x800C;&#x67B6;&#x6865;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x53EA;&#x77E5;&#x9053;&#x4E00;&#x7AEF;&#x800C;&#x4E0D;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x7AEF;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x6DF1;&#x5316;&#x8BBE;&#x8BA1;&#x6240;&#x9700;&#x8981;&#x7684;&#x5404;&#x79CD;&#x901A;&#x7528;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#xFF08;UML&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3001;&#x6027;&#x80FD;&#x786E;&#x4FDD;&#x7B49;&#xFF09;&#x3002;&#x8FD9;&#x65F6;&#x548C;&#x4E00;&#x822C;&#x6240;&#x8BF4;&#x7684;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x533A;&#x522B;&#x662F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8981;&#x5206;&#x5FC3;&#x601D;&#x53BB;&#x8003;&#x8651;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x800C;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x8981;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x3002;&#x800C;&#x4E00;&#x822C;&#x6240;&#x8BF4;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x4E2D;&#xFF0C;&#x6BD4;&#x8F83;&#x4FA7;&#x91CD;&#x81EA;&#x5DF1;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x5E72;&#xFF08;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3001;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x7B49;&#xFF09;&#x3002;&#x4E3A;&#x8FBE;&#x6210;&#x8FD9;&#x4E00;&#x76EE;&#x7684;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x73B0;&#x6709;&#x6280;&#x672F;&#x7684;&#x4F18;&#x52A3;&#x6709;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x6E05;&#x6670;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x6BD4;&#x5982;&#x8981;&#x80FD;&#x5206;&#x6E05;&#x695A;&#x90A3;&#x4E9B;&#x662F;&#x6210;&#x719F;&#x7A33;&#x5B9A;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x90A3;&#x4E9B;&#x662F;&#x5904;&#x5728;&#x5B9E;&#x9A8C;&#x9636;&#x6BB5;&#x7684;&#x6280;&#x672F;&#x3002;Pinterest&#x7F51;&#x7AD9;&#x5C31;&#x66FE;&#x7ECF;&#x8FDB;&#x884C;&#x8FC7;&#x4E0B;&#x5217;&#x8FD9;&#x6837;&#x7684;&#x67B6;&#x6784;&#x6539;&#x8FDB;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x6539;&#x8FDB;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5404;&#x79CD;&#x6280;&#x672F;&#x7684;&#x4F18;&#x52A3;&#x662F;&#x4EE3;&#x4EF7;&#x5F88;&#x5927;&#x7684;&#xFF1A;</p>
<p>Pinterest &#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF1A;</p>
<p>Rackspace<br>1 small web engine<br>1 small MySQL DB<br>2011/1&#xFF1A;</p>
<p>Amazon EC2 + S3 + CloudFront<br>1 NGinX, 4 Web Engines (for redundancy, not really for load)<br>1 MySQL DB + 1 Read Slave (in case master goes down)<br>1 Task Queue + 2 Task Processors<br>1 MongoDB (for counters)<br>2 Engineers<br>2011/9:</p>
<p>Amazon EC2 + S3 + CloudFront<br>2NGinX, 16 Web Engines + 2 API Engines<br>5 Functionally sharded MySQL DB + 9 read slaves<br>4 Cassandra Nodes<br>15 Membase Nodes (3 separate clusters)<br>8 Memcache Nodes<br>10 Redis Nodes<br>3 Task Routers + 4 Task Processors<br>4 Elastic Search Nodes<br>3 Mongo Clusters<br>3 Engineers<br>2012/1:</p>
<p>Amazon EC2 + S3 + Akamai, ELB<br>90 Web Engines + 50 API Engines<br>66 MySQL DBs (m1.xlarge) + 1 slave each<br>59 Redis Instances<br>51 Memcache Instances<br>1 Redis Task Manager + 25 Task Processors<br>Sharded Solr<br>6 Engineers<br>2012/10:</p>
<p>Amazon EC2 + S3 + Edge Cast,Akamai, Level 3<br>180 Web Engines + 240 API Engines<br>88 MySQL DBs (cc2.8xlarge) + 1 slave each<br>110 Redis Instances<br>200 Memcache Instances<br>4 Redis Task Manager + 80 Task Processors<br>Sharded Solr<br>40 Engineers (and growing)<br>&#x6458;&#x81EA;&#xFF1A;<a href="http://highscalability.com/blog/2013/4/15/scaling-pinterest-from-0-to-10s-of-billions-of-page-views-a.html" target="_blank" rel="external">http://highscalability.com/blog/2013/4/15/scaling-pinterest-from-0-to-10s-of-billions-of-page-views-a.html</a></p>
<p>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6BD4;&#x8F83;&#x771F;&#x5B9E;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53C2;&#x7167;&#x7740;&#x60F3;&#x60F3;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x6765;&#x4E3B;&#x5BFC;&#xFF0C;&#x90A3;&#x8FD8;&#x6B20;&#x7F3A;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x70B9;&#x8981;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x505A;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5DF2;&#x7ECF;&#x76F8;&#x5BF9;&#x4E8E;&#x5728;&#x505A;&#x6280;&#x672F;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#xFF0C;&#x81F3;&#x5C11;&#x8981;&#x9002;&#x5F53;&#x6D89;&#x730E;&#x4F30;&#x7B97;&#x5E76;&#x80FD;&#x505A;&#x51FA;&#x5408;&#x9002;&#x7684;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x65E6;&#x65E5;&#x7A0B;&#x7D27;&#x5F20;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x4EBA;&#x624B;&#x7B49;&#x624B;&#x6BB5;&#x6765;&#x5728;&#x8D28;&#x91CF;&#x3001;&#x6210;&#x672C;&#x548C;&#x8FDB;&#x5EA6;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x5747;&#x8861;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x77E5;&#x8BC6;&#x9762;&#x5DF2;&#x7ECF;&#x6269;&#x7684;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x5728;&#x5177;&#x4F53;&#x67D0;&#x4E2A;&#x4E13;&#x4E1A;&#x9886;&#x57DF;&#x4E0A;&#x7684;&#x6DF1;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x6B20;&#x7F3A;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5728;&#x505A;&#x4E00;&#x6B3E;&#x7535;&#x5B50;&#x6D88;&#x8D39;&#x4EA7;&#x54C1;&#x65F6;&#x7528;&#x5230;&#x4E86;TTS&#xFF0C;&#x4F46;&#x67B6;&#x6784;&#x5E08;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x4E86;&#x89E3;TTS&#x7684;&#x7B97;&#x6CD5;&#x2014;&#x8FD9;&#x662F;CodeGuru&#x7684;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x67B6;&#x6784;&#x5E08;&#x6240;&#x9700;&#x8981;&#x8FBE;&#x6210;&#x7684;&#x6700;&#x7EC8;&#x76EE;&#x6807;&#x53EF;&#x4EE5;&#x5F62;&#x8C61;&#x7684;&#x63CF;&#x8FF0;&#x4E3A;&#xFF1A;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x8003;&#x8651;&#x7528;&#x6237;&#x548C;&#x5E02;&#x573A;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x67B6;&#x6784;&#x5E08;&#x8981;&#x80FD;&#x628A;&#x8FD9;&#x4E1C;&#x897F;&#x6620;&#x5C04;&#x5230;&#x6280;&#x672F;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6765;&#x3002;&#x5982;&#x679C;&#x662F;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x7684;&#x4E3B;&#x5BFC;&#x8BBE;&#x8BA1;&#x4E0B;&#x8981;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x6362;&#x5230;&#x5176;&#x4ED6;&#x884C;&#x4E1A;&#x4E5F;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#xFF0C;&#x4ECE;&#x4EA7;&#x54C1;&#x7684;&#x7684;&#x89D2;&#x5EA6;&#x5F80;&#x56DE;&#x770B;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x8981;&#x80FD;&#x89E3;&#x51B3;&#x548C;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x5BFC;&#x5B8C;&#x6210;&#x5546;&#x4E1A;&#x4E0A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;&#x5B9E;&#x73B0;&#x624B;&#x6BB5;&#x4E0A;&#x5012;&#x5E76;&#x65E0;&#x9650;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x8D2D;&#x4E70;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x7EC4;&#x7EC7;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x5E73;&#x8861;&#x77ED;&#x671F;&#x548C;&#x957F;&#x671F;&#x5229;&#x76CA;&#xFF0C;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x8DEF;&#x5F84;&#x4E8C;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;CodeGuru"><a href="#&#x8DEF;&#x5F84;&#x4E8C;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;CodeGuru" class="headerlink" title="&#x8DEF;&#x5F84;&#x4E8C;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;CodeGuru"></a>&#x8DEF;&#x5F84;&#x4E8C;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;CodeGuru</h2><p>&#x4E0E;&#x67B6;&#x6784;&#x5E08;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x667A;&#x529B;&#x5BC6;&#x96C6;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x6280;&#x80FD;&#x9AD8;&#x8D85;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x8FD9;&#x79CD;&#x7A0B;&#x5E8F;&#x5458;&#x5F80;&#x5F80;&#x88AB;&#x79F0;&#x4E3A;Guru&#x3002;</p>
<p>&#x8FD9;&#x6761;&#x8DEF;&#x7EBF;&#x91CC;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E76;&#x4E0D;&#x628A;&#x81EA;&#x5DF1;&#x64C5;&#x957F;&#x7684;&#x9886;&#x57DF;&#x6269;&#x7684;&#x592A;&#x5BBD;&#xFF0C;&#x4F46;&#x5728;&#x6307;&#x5B9A;&#x9886;&#x57DF;&#x4E0A;&#x4F1A;&#x6316;&#x6398;&#x7684;&#x5F88;&#x6DF1;&#x3002;&#x9A71;&#x52A8;&#x3001;&#x5B57;&#x5E93;&#x3001;&#x56FE;&#x5F62;&#x5E93;&#x3001;&#x7B97;&#x6CD5;&#x5E93;&#x3001;OCR&#x7B49;&#x90FD;&#x504F;&#x5411;&#x4E8E;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x5047;&#x5982;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x8BED;&#x8A00;&#x4E4B;&#x540E;&#xFF0C;&#x60F3;&#x5F80;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x7684;&#x6280;&#x80FD;&#x548C;&#x67B6;&#x6784;&#x5E08;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4E00;&#x4E2A;&#x4EBA;&#x5982;&#x679C;&#x60F3;&#x5F80;&#x9A71;&#x52A8;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4E86;&#x89E3;CPU&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x3001;&#x5185;&#x6838;&#x8C03;&#x8BD5;&#x65B9;&#x5F0F;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0E;&#x76F8;&#x5E94;&#x9A71;&#x52A8;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x673A;&#x5236;&#x3001;&#x786C;&#x4EF6;&#x4FA7;&#x7684;&#x89C4;&#x683C;&#x3001;&#x901A;&#x8BAF;&#x534F;&#x8BAE;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#x5F88;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x89C4;&#x6A21;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x5E9E;&#x5927;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FD9;&#x7C7B;&#x4E1C;&#x897F;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x53D1;&#x6325;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x662F;&#x5927;&#x91CF;&#x6216;&#x9EBB;&#x70E6;&#x6216;&#x8270;&#x6DF1;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>
<p>2013&#x5E74;1&#x6708;&#xFF0C;ITeye&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x6761;&#x4FE1;&#x606F;&#x8BF4;&#xFF1A;Intel&#x9762;&#x5411;&#x5B66;&#x751F;&#x514D;&#x8D39;&#x63D0;&#x4F9B; C++ &#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x7B80;&#x5355;&#x7684;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E0B;&#x662F;&#x90A3;&#x4E9B;&#x5DE5;&#x5177;&#x514D;&#x8D39;&#x5411;&#x5B66;&#x751F;&#x63D0;&#x4F9B;&#xFF1A;</p>
<p>Intel C++ Composer XE&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#xFF1A;<br>Intel C++&#x7F16;&#x8BD1;&#x5668;&#xFF08;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF09;<br>Intel&#x6570;&#x5B66;&#x6838;&#x5FC3;&#x51FD;&#x6570;&#x5E93;&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x6570;&#x5B66;&#x5E93;&#xFF09;<br>Intel&#x7EBF;&#x7A0B;&#x6784;&#x5EFA;&#x6A21;&#x5757;&#xFF08;C++&#x4EFB;&#x52A1;&#x6A21;&#x578B;&#x3001;&#x6700;&#x6D41;&#x884C;&#x7684;C++&#x5E76;&#x884C;&#x65B9;&#x6CD5;&#xFF09;<br> Intel&#x96C6;&#x6210;&#x6027;&#x80FD;&#x57FA;&#x5143;&#xFF08;&#x591A;&#x5A92;&#x4F53;&#x57FA;&#x5143;&#x5E93;&#xFF09;<br>Intel Advisor XE&#xFF08;&#x63A8;&#x8350;&#x7684;&#x5E76;&#x884C;&#x5F00;&#x53D1;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#xFF09;<br>Intel VTune Amplifier XE&#xFF08;&#x975E;&#x4FB5;&#x5165;&#x6027;&#x7684;&#x6027;&#x80FD;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF09;<br>Intel Inspector XE&#xFF08;&#x5148;&#x8FDB;&#x7684;&#x7EBF;&#x7A0B;&#x548C;&#x5185;&#x5B58;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF09;<br>&#x770B;&#x5230;&#x8FD9;&#x5F20;&#x5217;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x4E0B;&#x8981;&#x5F00;&#x53D1;&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x5F00;&#x53D1;&#x90FD;&#x5C5E;&#x4E8E;&#x9AD8;&#x96BE;&#x5EA6;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x548C;&#x5F00;&#x53D1;&#x5927;&#x89C4;&#x6A21;&#x7684;MIS&#x7CFB;&#x7EDF;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x67D0;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x8D1F;&#x62C5;&#x8D77;&#x76F8;&#x5E94;&#x7684;&#x8D23;&#x4EFB;&#x3002;&#x800C;&#x8FD9;&#x7C7B;&#x9886;&#x57DF;&#x5219;&#x6B63;&#x662F;Guru&#x7684;&#x5929;&#x4E0B;&#x3002;</p>
<h2 id="&#x8DEF;&#x5F84;&#x4E09;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x7EAF;&#x7BA1;&#x7406;"><a href="#&#x8DEF;&#x5F84;&#x4E09;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x7EAF;&#x7BA1;&#x7406;" class="headerlink" title="&#x8DEF;&#x5F84;&#x4E09;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x7EAF;&#x7BA1;&#x7406;"></a>&#x8DEF;&#x5F84;&#x4E09;&#xFF1A;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x7EAF;&#x7BA1;&#x7406;</h2><p>&#x7EAF;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x548C;&#x6280;&#x672F;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7528;&#x662F;&#x5426;&#x63A5;&#x89E6;&#x4E43;&#x81F3;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x533A;&#x5206;&#x3002;&#x7EAF;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x628A;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x9884;&#x7B97;&#x7F16;&#x5236;&#x3001;&#x4EBA;&#x5458;&#x804C;&#x4E1A;&#x8DEF;&#x5F84;&#x3001;&#x8003;&#x8BC4;&#x3001;&#x5EA6;&#x91CF;&#x3001;&#x6D41;&#x7A0B;&#x6539;&#x5584;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x4E0A;&#x3002;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x7B49;&#x4EF7;&#x4E8E;&#x548C;&#x7F16;&#x7A0B;&#x5DE5;&#x4F5C;&#x8BF4;&#x62DC;&#x62DC;&#xFF0C;&#x5F53;&#x7136;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x5F97;&#x6709;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x548C;&#x6982;&#x5FF5;&#x521B;&#x5EFA;&#x4E43;&#x81F3;&#x903B;&#x8F91;&#x4F18;&#x5316;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x6CA1;&#x6CD5;&#x6C9F;&#x901A;&#xFF0C;&#x8FDB;&#x800C;&#x7ED9;&#x5DE5;&#x4F5C;&#x9020;&#x6210;&#x969C;&#x788D;&#x3002;</p>
<p>&#x4ECE;&#x9700;&#x8981;&#x8BFB;&#x7684;&#x4E66;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x8981;&#x770B;&#x8FC7;PMBOK&#xFF0C;&#x300A;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;&#x300B;&#xFF0C;&#x300A;&#x7BA1;&#x7406;&#x7684;&#x5B9E;&#x8DF5;&#x300B;&#xFF0C;&#x300A;&#x57FA;&#x4E1A;&#x957F;&#x9752;&#x300B;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x60F3;&#x505A;&#x7BA1;&#x7406;&#x8981;&#x4ECE;PMP&#x5F00;&#x59CB;&#xFF0C;&#x90A3;&#x5927;&#x6982;&#x662F;&#x8FD8;&#x6CA1;&#x592A;&#x660E;&#x767D;&#x7BA1;&#x7406;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x672C;&#x8D28;&#x3002;&#x7BA1;&#x7406;&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x79CD;&#x501F;&#x52BF;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x6280;&#x672F;&#x6027;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x6BD4;&#x5982;&#x8981;&#x7406;&#x89E3;&#x6323;&#x503C;&#x66F2;&#x7EBF;&#x8FD9;&#x7C7B;&#xFF0C;&#x4F46;&#x8FD9;&#x65B9;&#x9762;&#x77E5;&#x8BC6;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x590D;&#x6742; &#x2014;&#x2014; &#x81F3;&#x5C11;&#x6CA1;&#x6709;C++11&#x590D;&#x6742;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x65F6;&#x95F4;&#x6B63;&#x5E38;&#x667A;&#x5546;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x592A;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x638C;&#x63E1;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x505A;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E86;&#x548C;&#x5B66;&#x4E60;C++&#x8BED;&#x8A00;&#x4E00;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x504F;&#x79BB;&#x4E86;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x629B;&#x5F00;&#x673A;&#x7F18;&#x8FD9;&#x7C7B;&#x4E1C;&#x897F;&#x4E0D;&#x8BBA;&#xFF0C;&#x505A;&#x597D;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x6709;&#x4E24;&#x70B9;&#x5F88;&#x5173;&#x952E;&#xFF1A;</p>
<p><strong>&#x4E00; &#x662F;&#x8981;&#x628A;&#x6280;&#x672F;&#x5DE5;&#x4F5C;&#x505A;&#x7684;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x597D;&#x3002;</strong><br>&#x8FD9;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x5B66;&#x800C;&#x4F18;&#x5219;&#x4ED5;&#x7684;&#x610F;&#x5473;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x65F6;&#x5019;&#x4EBA;&#x4EEC;&#x66F4;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x201C;&#x5C06;&#x519B;&#x8D77;&#x4E8E;&#x884C;&#x4F0D;&#xFF0C;&#x5BB0;&#x76F8;&#x62D4;&#x4E8E;&#x5DDE;&#x90E1;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x5355;&#x53EA;&#x4F1A;&#x800D;&#x5634;&#x76AE;&#x5B50;&#x7684;&#x4EBA;&#x3002;&#x8FC7;&#x5EA6;&#x52A1;&#x5B9E;&#x7684;&#x4EBA;&#x5BB9;&#x6613;&#x8FF7;&#x5931;&#x4E8E;&#x9053;&#x8DEF;&#xFF0C;&#x8FC7;&#x5EA6;&#x52A1;&#x865A;&#x7684;&#x4EBA;&#x5219;&#x5BB9;&#x6613;&#x98D8;&#x7684;&#x592A;&#x9AD8;&#x800C;&#x4E27;&#x5931;&#x6839;&#x57FA;&#x3002;&#x7BA1;&#x7406;&#x8005;&#x6B63;&#x5E94;&#x8BE5;&#x8EAB;&#x5904;&#x5728;&#x8FD9;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x70B9;&#x3002;</p>
<p><strong>&#x4E8C; &#x662F;&#x8981;&#x80FD;&#x591F;&#x501F;&#x52BF;&#x3002;</strong><br>&#x8981;&#x60C5;&#x5546;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x80FD;&#x628A;&#x5F88;&#x591A;&#x4EBA;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8981;&#x77E5;&#x9053;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x89C4;&#x5219;&#x5316;&#xFF0C;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x7075;&#x6D3B;&#x628A;&#x63E1;&#x3002;&#x8FC7;&#x5EA6;&#x504F;&#x5411;&#x89C4;&#x5219;&#x662F;&#x6559;&#x6761;&#xFF0C;&#x8FC7;&#x5EA6;&#x504F;&#x5411;&#x7075;&#x6D3B;&#x5219;&#x662F;&#x4EBA;&#x6CBB;&#xFF0C;&#x5E73;&#x8861;&#x70B9;&#x59CB;&#x7EC8;&#x8981;&#x6839;&#x636E;&#x5177;&#x4F53;&#x4EBA;&#x5458;&#x7684;&#x72B6;&#x51B5;&#xFF0C;&#x5DE5;&#x4F5C;&#x7279;&#x8D28;&#x8FD9;&#x4E9B;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x7684;&#x4E8B;&#x60C5;&#x6765;&#x628A;&#x63E1;&#x3002;&#x8FD9;&#x6709;&#x70B9;&#x5FAE;&#x5999;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E2A;&#x7FA4;&#x4F53;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x63A8;&#x7FFB;&#x5148;&#x4EBA;&#x540E;&#x4E8B;&#x8FD9;&#x7C7B;&#x89C4;&#x5219;&#x3002;&#x8FD9;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x662F;&#x4E1C;&#x65B9;&#x7279;&#x8272;&#xFF0C;&#x5F53;&#x4F60;&#x60F3;&#x505A;&#x7BA1;&#x7406;&#x5E76;&#x60F3;&#x63A8;&#x8FDB;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EC8;&#x7A76;&#x8981;&#x7406;&#x6E05;&#x4EBA;&#x9645;&#x4E0A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x548C;&#x53EF;&#x80FD;&#x4F1A;&#x6B32;&#x901F;&#x5219;&#x4E0D;&#x8FBE;&#x3002;&#x8FD9;&#x70B9;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x8FDB;&#x4E00;&#x6B65;&#x5C55;&#x5F00;&#x6765;&#x8C08;&#x3002;<br>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x70B9;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x51FA;&#x81EA;&#x90ED;&#x81F4;&#x661F;&#x8001;&#x5E08;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x5458;&#x7684;&#x771F;&#x5B9E;&#x7591;&#x95EE;&#xFF08;&#x6587;&#x5B57;&#x4E0A;&#x6709;&#x4FEE;&#x9970;&#xFF09;&#xFF0C;X&#x5165;&#x804C;&#x540E;&#x7684;&#x73B0;&#x72B6;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x5F00;&#x53D1;&#x90E8;&#x73B0;&#x5728;26&#x4E2A;&#x4EBA;&#x3002;&#x57FA;&#x672C;&#x7EC4;&#x7EC7;&#x67B6;&#x6784;&#x662F;&#x7531;&#x5F00;&#x53D1;&#x7EC4;&#x3001;&#x9700;&#x6C42;&#x7EC4;&#x3001;&#x6D4B;&#x8BD5;&#x7EC4;&#x3001;&#x8FD0;&#x7EF4;&#x90E8;&#x56DB;&#x4E2A;&#x90E8;&#x95E8;&#x7EC4;&#x6210;&#x3002;&#x9700;&#x6C42;&#x7EC4;&#x7684;&#x4EBA;&#x6536;&#x96C6;&#x9700;&#x6C42;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x6307;&#x6D3E;&#x7ED9;&#x5F00;&#x53D1;&#x7EC4;&#xFF0C;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x3002;&#x5F00;&#x53D1;&#x7EC4;&#x7684;&#x6587;&#x6863;&#x4E25;&#x91CD;&#x7F3A;&#x4E4F;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x516C;&#x53F8;&#x5185;&#x6709;&#x6280;&#x672F;&#x603B;&#x76D1;&#x548C;&#x5F00;&#x53D1;&#x90E8;&#x7ECF;&#x7406;&#x7684;&#x5C97;&#x4F4D;&#x3002;&#x773C;&#x4E0B;&#x5168;&#x516C;&#x53F8;&#x5C31;X&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#xFF0C;&#x76EE;&#x524D;&#x662F;&#x8DDF;&#x7740;&#x5F00;&#x53D1;&#x90E8;&#x7ECF;&#x7406;&#xFF0C;&#x5728;&#x719F;&#x6089;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x7CFB;&#x7EDF;&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6587;&#x6863;&#x7684;&#x9057;&#x7559;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x662F;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5F00;&#x53D1;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E00;&#x8FB9;&#x5F00;&#x53D1;&#x4E00;&#x8FB9;&#x719F;&#x6089;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x73B0;&#x5728;X&#x5E76;&#x6CA1;&#x6709;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x9645;&#x6743;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7EC4;&#x4E5F;&#x53EA;&#x6709;&#x5F00;&#x53D1;&#x90E8;&#x7ECF;&#x7406;&#xFF0C;&#x52A0;&#x4E0A;2&#x4E2A;&#x5F00;&#x53D1;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;1&#x4E2A;&#x6D4B;&#x8BD5;&#x548C;X&#x5171;5&#x4E2A;&#x4EBA;&#x3002;&#x5176;&#x4E2D;X&#x548C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x90FD;&#x662F;&#x65B0;&#x6765;&#x7684;&#x3002;</p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E1A;&#x52A1;&#x90E8;&#x95E8;&#x5728;&#x641E;&#x4E00;&#x4E9B;&#x6D41;&#x7A0B;&#xFF0C;&#x4F46;&#x8FD8;&#x6CA1;&#x505A;&#x5B8C;&#xFF0C;&#x6CA1;&#x6709;&#x5728;&#x5F00;&#x53D1;&#x90E8;&#x8FDB;&#x884C;&#x5B9E;&#x65BD;&#x3002;&#x5DE5;&#x4F5C;&#x6C14;&#x6C1B;&#x6BD4;&#x8F83;&#x6C89;&#x95F7;&#x3002;&#x6280;&#x672F;&#x603B;&#x76D1;&#x548C;&#x5F00;&#x53D1;&#x90E8;&#x7ECF;&#x7406;&#xFF0C;&#x90FD;&#x662F;&#x6280;&#x672F;&#x578B;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x8F83;&#x504F;&#x5411;&#x6280;&#x672F;&#xFF0C;&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x4E5F;&#x591A;&#x504F;&#x5411;&#x4E8E;&#x5177;&#x4F53;&#x6267;&#x884C;&#x3002;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;Redmine&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x548C;BUG&#x8DDF;&#x8E2A;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x7CFB;&#x7EDF;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EA7;&#x54C1;&#x7EBF;&#x5236;&#xFF0C;&#x5C5E;&#x4E8E;&#x9700;&#x8981;&#x957F;&#x671F;&#x5F00;&#x53D1;&#x7EF4;&#x62A4;&#x7684;&#xFF0C;&#x9700;&#x6C42;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x6765;&#xFF0C;&#x76F8;&#x5E94;&#x4EBA;&#x5458;&#x4E5F;&#x5C31;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x7684;&#x505A;&#xFF0C;&#x6CA1;&#x6709;&#x7248;&#x672C;&#x5236;&#x5EA6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8BA1;&#x5212;&#x548C;&#x89C4;&#x5212;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x73B0;&#x5728;&#x4E3B;&#x8981;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x79CD;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;X&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x81EA;&#x5DF1;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#xFF1F;</p>
<p>&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x5E76;&#x6CA1;&#x6709;&#x552F;&#x4E00;&#x7B54;&#x6848;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x6709;&#x4E9B;&#x901A;&#x884C;&#x7684;&#x624B;&#x6BB5;&#x53EF;&#x4F9B;&#x53C2;&#x8003;&#xFF0C;&#x6700;&#x7EC8;&#x505A;&#x4E0D;&#x505A;&#x7684;&#x597D;&#x548C;&#x4E2A;&#x4EBA;&#x80FD;&#x529B;&#x4E43;&#x81F3;&#x73AF;&#x5883;&#x5173;&#x8054;&#x5F88;&#x7D27;&#xFF1A;</p>
<ul>
<li>&#x4E86;&#x89E3;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x51B5;&#xFF0C;&#x5305;&#x62EC;&#x89C4;&#x683C;&#x3001;&#x4EE3;&#x7801;&#x89C4;&#x6A21;&#x3001;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3001;&#x4EE3;&#x7801;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x3001;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3001;&#x95EE;&#x9898;&#x6240;&#x5728;&#x7B49;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x5F88;&#x53EF;&#x80FD;&#x8FD9;&#x7C7B;&#x7CFB;&#x7EDF;&#x7F3A;&#x4E4F;&#x4E00;&#x79CD;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#xFF0C;&#x662F;&#x9760;&#x5355;&#x7EAF;&#x7684;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x7684;&#x91CF;&#x5806;&#x79EF;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4EE3;&#x7801;&#x5197;&#x4F59;&#x975E;&#x5E38;&#x5389;&#x5BB3;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x4E5F;&#x521B;&#x5EFA;&#x7684;&#x6BD4;&#x8F83;&#x968F;&#x610F;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x4EBA;&#x5458;&#x3002;&#x5305;&#x62EC;&#x4EBA;&#x5458;&#x7684;&#x80FD;&#x529B;&#x6C34;&#x5E73;&#x3001;&#x5DE5;&#x4F5C;&#x610F;&#x613F;&#x72B6;&#x51B5;&#x3001;&#x6027;&#x683C;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x516C;&#x53F8;&#x3002;&#x5C24;&#x5176;&#x662F;&#x516C;&#x53F8;&#x7684;&#x8FD0;&#x4F5C;&#x98CE;&#x683C;&#xFF0C;&#x6709;&#x7684;&#x516C;&#x53F8;&#x504F;&#x4EBA;&#x6CBB;&#x6709;&#x7684;&#x516C;&#x53F8;&#x504F;&#x4E8E;&#x89C4;&#x5219;&#x3002;&#x77ED;&#x671F;&#x5BF9;&#x8FD9;&#x7C7B;&#x73B0;&#x884C;&#x79E9;&#x5E8F;&#x8981;&#x8003;&#x8651;&#x5982;&#x4F55;&#x987A;&#x5E94;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x6539;&#x53D8;&#x3002;</li>
<li>&#x5BF9;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x51B5;&#x548C;&#x4EBA;&#x7684;&#x72B6;&#x51B5;&#x6709;&#x6240;&#x628A;&#x63E1;&#x540E;&#xFF0C;&#x8981;&#x5BF9;&#x613F;&#x666F;&#x8FDB;&#x884C;&#x63CF;&#x753B;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x505A;&#x90A3;&#x4E9B;&#x6539;&#x5584;&#xFF0C;&#x5BF9;&#x901F;&#x5EA6;&#x505A;&#x5982;&#x4F55;&#x6539;&#x5584;&#xFF0C;&#x76EE;&#x6807;&#x7684;&#x9AD8;&#x4F4E;&#x8981;&#x9002;&#x5EA6;&#xFF0C;&#x8981;&#x80FD;&#x83B7;&#x5F97;&#x4E0A;&#x53F8;&#x548C;&#x4E0B;&#x5C5E;&#x7684;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x8FD8;&#x8981;&#x80FD;&#x5E73;&#x8861;&#x77ED;&#x671F;&#x548C;&#x957F;&#x671F;&#x76EE;&#x6807;&#xFF0C;&#x65E2;&#x4E0D;&#x80FD;&#x957F;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x6CA1;&#x6709;&#x4EA7;&#x51FA;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x6709;&#x4EA7;&#x51FA;&#x4F46;&#x8FDB;&#x6B65;&#x4E0D;&#x53EF;&#x89C1;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x6B65;&#x9AA4;&#x91CC;&#x6700;&#x5178;&#x578B;&#x7684;&#x5FCC;&#x8BB3;&#x662F;&#x6025;&#x529F;&#x8FD1;&#x5229;&#x7684;&#x505A;&#x8D85;&#x51FA;&#x81EA;&#x5DF1;&#x5F71;&#x54CD;&#x529B;&#x8303;&#x56F4;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x76EE;&#x6807;&#x4E0E;&#x73B0;&#x6709;&#x4EBA;&#x5458;&#x7684;&#x80FD;&#x529B;&#x5B8C;&#x5168;&#x4E0D;&#x5339;&#x914D;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x4E0D;&#x987E;&#x53CA;&#x5BF9;&#x9500;&#x552E;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x800C;&#x5355;&#x7EAF;&#x7684;&#x505A;&#x7CFB;&#x7EDF;&#x7684;&#x4F18;&#x5316;&#x3002;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x5F62;&#x662F;&#xFF0C;&#x8FDE;&#x7EED;&#x8FBE;&#x6210;&#x51E0;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x3002;</li>
<li>&#x641E;&#x6E05;&#x695A;&#x56E2;&#x961F;&#x6210;&#x5458;&#x548C;&#x516C;&#x53F8;&#x7684;&#x7684;&#x57FA;&#x672C;&#x8BC9;&#x6C42;&#xFF0C;&#x5728;&#x53D6;&#x5F97;&#x6210;&#x7EE9;&#x7684;&#x540C;&#x65F6;&#x5C3D;&#x53EF;&#x80FD;&#x53CC;&#x8D62;&#x7684;&#x6269;&#x5927;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x786E;&#x4FDD;&#x56E2;&#x961F;&#x7684;&#x6267;&#x884C;&#x529B;&#x3002;</li>
<li>&#x9010;&#x6B65;&#x5BFC;&#x5165;&#x57FA;&#x672C;&#x6D41;&#x7A0B;&#xFF0C;&#x4F7F;&#x9879;&#x76EE;&#x4E0A;&#x8F68;&#x9053;&#x3002;&#x4F46;&#x6D41;&#x7A0B;&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x6210;&#x7EE9;&#x7684;&#x501F;&#x53E3;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x89C4;&#x5212;&#x613F;&#x666F;&#xFF0C;&#x770B;&#x80FD;&#x5426;&#x53D6;&#x5F97;&#x66F4;&#x5927;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6311;&#x6218;&#x662F;&#x5426;&#x80FD;&#x505A;&#x51FA;&#x771F;&#x6B63;&#x6709;&#x7279;&#x8272;&#x6BD4;&#x8F83;&#x4F18;&#x5F02;&#x7684;&#x4EA7;&#x54C1;&#x3002;</li>
<li>&#x5728;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x516C;&#x53F8;&#x91CC;&#xFF0C;&#x5BF9;&#x5E94;&#x624B;&#x6BB5;&#x4E0A;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x89C4;&#x8303;&#x6027;&#x6BD4;&#x8F83;&#x5F3A;&#x7684;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x7B2C;4,5&#x4E24;&#x6B65;&#x7684;&#x6743;&#x91CD;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x4F4E;&#x3002;&#x5728;&#x4E0A;&#x8FF0;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;PMP&#x8FD9;&#x7C7B;&#x4E66;&#x7C4D;&#x4E2D;&#x6240;&#x63D0;&#x5230;&#x7684;&#x79CD;&#x79CD;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x8BDA;&#x7136;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x548C;&#x4EBA;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x8001;&#x677F;&#x3001;&#x76F4;&#x5C5E;&#x4E0A;&#x53F8;&#x3001;&#x4E0B;&#x5C5E;&#xFF09;&#x5F80;&#x5F80;&#x4F1A;&#x5BF9;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x4EA7;&#x751F;&#x66F4;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x662F;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x4E0E;&#x7EAF;&#x7CB9;&#x6280;&#x672F;&#x5DE5;&#x4F5C;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x3002;</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/g-programming-guide-3-direction/" data-id="cj0ge26dn001hogskliatw8c9" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/g-programming-guide-3-direction/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/g-programming-guide-4-become-master/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：为何你成不了编程高手？ 成长路上常见的坑
        
      </div>
    </a>
  
  
    <a href="/2016/g-programming-guide-2-the-master/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：怎样才算是编程高手？ 高手的定义</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/g-programming-guide-3-direction/" data-title="码路指南：程序员的几个职场发展方向 职场该如何走？" data-url="http://snowyying.github.io/2016/g-programming-guide-3-direction/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0] 
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">16</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">12</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12px;">C</a> <a href="/tags/C/" style="font-size: 12px;">C++</a> <a href="/tags/C-C/" style="font-size: 15px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 12px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 18px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11px;">poll</a> <a href="/tags/select/" style="font-size: 13px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/性能/" style="font-size: 13px;">性能</a> <a href="/tags/成长/" style="font-size: 19px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 18px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 17px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14px;">设计模式</a> <a href="/tags/软件质量/" style="font-size: 11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">三月 2017</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">二月 2017</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">七月 2016</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/network-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/network-api-restful-overview/">理解 RESTful 架构</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>