<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：为何你成不了编程高手？ 成长路上常见的坑 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2661 2014&amp;#x5E74;01&amp;#x6708;19&amp;#x65E5;
&amp;#x524D;&amp;#x9762;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x6210;&amp;#x4E3A;&amp;#x9AD8;&amp;#x624B;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：为何你成不了编程高手？ 成长路上常见的坑">
<meta property="og:url" content="http://snowyying.github.io/2016/gen-programming-guide-4-become-master/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2661 2014&amp;#x5E74;01&amp;#x6708;19&amp;#x65E5;
&amp;#x524D;&amp;#x9762;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x6210;&amp;#x4E3A;&amp;#x9AD8;&amp;#x624B;&amp;#x">
<meta property="og:updated_time" content="2017-01-12T02:31:14.095Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：为何你成不了编程高手？ 成长路上常见的坑">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2661 2014&amp;#x5E74;01&amp;#x6708;19&amp;#x65E5;
&amp;#x524D;&amp;#x9762;&amp;#x8BB2;&amp;#x5230;&amp;#x4E86;&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#x6210;&amp;#x4E3A;&amp;#x9AD8;&amp;#x624B;&amp;#x">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不破, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-gen-programming-guide-4-become-master" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：为何你成不了编程高手？ 成长路上常见的坑
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/gen-programming-guide-4-become-master/" class="article-date">
  <time datetime="2016-08-05T05:20:40.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA; http://www.nowamagic.net/librarys/veda/detail/2661 2014&#x5E74;01&#x6708;19&#x65E5;</code></p>
<p>&#x524D;&#x9762;&#x8BB2;&#x5230;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x9700;&#x8981;&#x6709;&#x4E00;&#x5F20;&#x5730;&#x56FE;&#xFF0C;&#x501F;&#x52A9;&#x8FD9;&#x6837;&#x4E00;&#x5F20;&#x5730;&#x56FE;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6210;&#x4E3A;&#x67B6;&#x6784;&#x5E08;&#x3001;Guru&#x6216;&#x8005;&#x7EAF;&#x7BA1;&#x7406;&#x8005;&#x3002;&#x4F46;&#x8FD9;&#x6761;&#x8DEF;&#x603B;&#x662F;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x987A;&#x7545;&#x3002;</p>
<p>&#x5347;&#x7EA7;&#x7EC3;&#x529F;&#x6D41;&#x7684;&#x7F51;&#x6E38;&#x4E2D;&#x603B;&#x4F1A;&#x7ED9;&#x4FEE;&#x4ED9;&#x7684;&#x4E3B;&#x4EBA;&#x516C;&#x8BBE;&#x7F6E;&#x4E0B;&#x51E0;&#x5927;&#x5173;&#x5361;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x91D1;&#x4E39;&#x96BE;&#x6210;&#x3001;&#x5143;&#x795E;&#x96BE;&#x6210;&#x3001;&#x6210;&#x4E86;&#x5143;&#x795E;&#x540E;&#x8FD8;&#x6709;&#x5929;&#x4EBA;&#x4E94;&#x8870;&#x7B49;&#x7B49;&#x3002;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x5173;&#x53E3;&#xFF0C;&#x60C5;&#x8282;&#x5F88;&#x96BE;&#x63A8;&#x52A8;&#xFF0C;&#x6240;&#x4EE5;&#x4ED9;&#x4FA0;&#x7C7B;&#x7684;&#x7F51;&#x6E38;&#x51E0;&#x4E4E;&#x65E0;&#x4E00;&#x4F8B;&#x5916;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x7C7B;&#x8BBE;&#x5B9A;&#x3002;&#x8FD9;&#x4E00;&#x4F20;&#x7EDF;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;&#x300A;&#x897F;&#x6E38;&#x8BB0;&#x300B;&#x548C;&#x300A;&#x5C01;&#x795E;&#x6F14;&#x4E49;&#x300B;&#x3002;</p>
<p>&#x62FF;&#x8FD9;&#x4E2A;&#x6765;&#x5BF9;&#x7167;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x589E;&#x503C;&#x9053;&#x8DEF;&#xFF0C;&#x5C31;&#x4F1A;&#x731B;&#x5730;&#x53D1;&#x73B0;&#xFF0C;&#x5347;&#x7EA7;&#x7EC3;&#x529F;&#x6D41;&#x4E5F;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x626F;&#x6DE1;&#x3002;&#x4E0D;&#x7BA1;&#x8D70;&#x90A3;&#x6761;&#x9053;&#x8DEF;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4FEE;&#x70BC;&#x8DEF;&#x4E0A;&#x540C;&#x6837;&#x7684;&#x4E5F;&#x6709;&#x4E09;&#x707E;&#x4E5D;&#x96BE;&#xFF0C;&#x8981;&#x60F3;&#x6210;&#x5C31;&#x9AD8;&#x624B;&#xFF0C;&#x8FD8;&#x662F;&#x5F97;&#x4E00;&#x4E2A;&#x4E2A;&#x8DE8;&#x8FC7;&#x53BB;&#x624D;&#x884C;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x9AD8;&#x5EA6;&#x540E;&#x518D;&#x56DE;&#x5934;&#x89C2;&#x671B;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x540C;&#x5B66;&#x3001;&#x66FE;&#x7ECF;&#x7684;&#x540C;&#x4E8B;&#x603B;&#x662F;&#x4F1A;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x539F;&#x56E0;&#x5012;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5929;&#x9053;&#x916C;&#x52E4;&#x5C31;&#x53EF;&#x4EE5;&#x6577;&#x884D;&#x7684;&#x884C;&#x5F53;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x5177;&#x4F53;&#x770B;&#x770B;&#xFF0C;&#x7A76;&#x7ADF;&#x589E;&#x503C;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x90A3;&#x4E9B;&#x9677;&#x9631;&#xFF0C;&#x6389;&#x5230;&#x5751;&#x91CC;&#x53C8;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x591A;&#x5927;&#x4EE3;&#x4EF7;&#x624D;&#x722C;&#x7684;&#x51FA;&#x6765;&#x3002;</p>
<a id="more"></a>
<p>&#x5B66;&#x4E60;&#x5931;&#x53BB;&#x7126;&#x70B9;</p>
<p>&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x91CC;&#x6709;&#x51E0;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x9898;&#x76EE;&#xFF0C;&#x6BCF;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x88AB;&#x7FFB;&#x51FA;&#x6765;PK&#x4E00;&#x4E0B;&#xFF0C;&#x6BD4;&#x5982;&#x5173;&#x4E8E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4F18;&#x52A3;&#x7684;&#x6BD4;&#x8F83;&#x7B49;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x9898;&#x76EE;&#x662F;&#x8F6F;&#x4EF6;&#x548C;&#x6570;&#x5B66;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x6D3E;&#x4EBA;&#x8BA4;&#x4E3A;&#x6570;&#x5B66;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x6D3E;&#x4EBA;&#x8BA4;&#x4E3A;&#x6570;&#x5B66;&#x548C;&#x8F6F;&#x4EF6;&#x6CA1;&#x4EC0;&#x4E48;&#x592A;&#x5927;&#x5173;&#x7CFB;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x5728;&#x67D0;&#x51E0;&#x4E2A;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x91CC;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x5FC3;&#x89C2;&#x5BDF;&#x8FC7;&#x8FD9;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E8B;&#x60C5;&#x7279;&#x522B;&#x6709;&#x610F;&#x601D;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;2011&#x5E74;&#xFF0C;CSDN&#x8F6C;&#x4E86;&#x4E00;&#x7BC7;&#xFF0C;&#x53EB;&#xFF1A;&#x201C;&#x6570;&#x5B66;&#x662F;&#x6210;&#x5C31;&#x5353;&#x8D8A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x5FC5;&#x5907;&#x6280;&#x80FD;&#x201D;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5728;&#x6587;&#x672B;&#x4F5C;&#x8005;&#x8BF4;&#xFF1A;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x6570;&#x5B66;&#x5BF9;&#x6240;&#x6709;&#x4E8B;&#x90FD;&#x6709;&#x5229;&#x4E48;&#xFF1F;&#x8FD9;&#x4E8B;&#x60C5;&#x5F88;&#x96BE;&#x8BF4;&#xFF0C;&#x6211;&#x5BF9;&#x6211;&#x73B0;&#x5728;&#x7684;&#x5904;&#x5883;&#x5341;&#x5206;&#x6EE1;&#x610F;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4E5F;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x8FD9;&#x90FD;&#x548C;&#x6F5C;&#x80FD;&#x6709;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x534F;&#x4F5C;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x540D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x4F60;&#x771F;&#x7684;&#x4E0D;&#x9700;&#x8981;&#x6570;&#x5B66;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E50;&#x4E8E;&#x4F60;&#x7684;&#x6574;&#x4E2A;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5728;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x4E2D;&#x505A;&#x4F01;&#x4E1A;CRUD&#x5E94;&#x7528;&#xFF0C;&#x6216;&#x5728;&#x95F2;&#x6687;&#x65F6;&#x95F4;&#x6ED1;&#x7FD4;&#x8DF3;&#x4F1E;&#x6216;&#x6781;&#x9650;&#x6C34;&#x4E0A;&#x6ED1;&#x677F;&#xFF08;&#x6216;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x65F6;&#x9AE6;&#x7684;&#x6781;&#x5BA2;&#x8FD0;&#x52A8;&#xFF09;&#xFF0C;&#x4E5F;&#x5206;&#x914D;&#x8F83;&#x591A;&#x65F6;&#x95F4;&#x5728;Spring&#x3001;Hibernate&#x3001;Visual Studio&#x6216;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x4E0A;&#x3002;&#x90A3;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x804C;&#x4F4D;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x9650;&#x5236;&#x4F60;&#x7684;&#x6F5C;&#x529B;&#xFF0C;&#x4F60;&#x80FD;&#x53D8;&#x5F97;&#x6781;&#x5177;&#x4EF7;&#x503C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x6DF1;&#x5165;&#x8FFD;&#x6C42;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4E3A;&#x591A;&#x6837;&#x5316;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x800C;&#x594B;&#x6597;&#xFF0C;&#x60F3;&#x8981;&#x6709;&#x80FD;&#x529B;&#x5C1D;&#x8BD5;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x4EE3;&#x7801;&#x7684;&#x4E8B;&#xFF0C;&#x4ECE;&#x4FE1;&#x606F;&#x68C0;&#x7D22;&#x5230;Linux&#x5185;&#x6838;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3001;&#x7A0B;&#x5E8F;&#x5458;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x7684;&#x5B8C;&#x7F8E;&#x7EC4;&#x5408;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x6280;&#x80FD;&#x8FBE;&#x5230;&#x6807;&#x51C6;&#x3002;&#x957F;&#x8BDD;&#x77ED;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6570;&#x5B66;&#x65B9;&#x9762;&#x6709;&#x4E00;&#x5B9A;&#x5929;&#x8D4B;&#xFF0C;&#x90A3;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5927;&#x95E8;&#x90FD;&#x662F;&#x5411;&#x4F60;&#x655E;&#x5F00;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x5B89;&#x5B89;&#x5FC3;&#x5FC3;&#x5730;&#x505A;CRUD&#x578B;&#x5DE5;&#x4F5C;&#x5427;&#xFF01;</p>
<p>&#x603B;&#x7684;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x6570;&#x5B66;&#x5F88;&#x5173;&#x952E;&#xFF0C;&#x5F97;&#x5B66;&#x3002;</p>
<p>&#x800C;&#x5728;2012&#x5E74;CSDN&#x53C8;&#x8F6C;&#x4E86;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x53EB;&#xFF1A;&#x7F16;&#x7A0B;&#x9700;&#x8981;&#x77E5;&#x9053;&#x591A;&#x5C11;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#xFF1F;&#x5728;&#x6587;&#x7AE0;&#x91CC;&#x4F5C;&#x8005;&#x8BF4;&#xFF1A;</p>
<p>&#x6570;&#x5B66;&#x548C;&#x7F16;&#x7A0B;&#x6709;&#x4E00;&#x79CD;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x8BEF;&#x89E3;&#x7684;&#x8054;&#x7CFB;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5728;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x5BF9;&#x6570;&#x5B66;&#x5F88;&#x5728;&#x884C;&#x6216;&#x8005;&#x6570;&#x5B66;&#x5206;&#x6570;&#x5F88;&#x9AD8;&#x3002;&#x4F46;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x4E86;&#x7F16;&#x7A0B;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x591A;&#x5C11;&#x6570;&#x5B66;&#x5462;&#xFF1F;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x591A;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x6211;&#x4F1A;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x7F16;&#x7A0B;&#x4E2D;&#x6240;&#x9700;&#x8981;&#x7684;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x90FD;&#x77E5;&#x9053;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x57FA;&#x672C;&#x7684;&#x7F16;&#x7A0B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4E0B;&#x9762;&#x7684;&#xFF1A;</p>
<p>&#x52A0;&#x51CF;&#x4E58;&#x9664; &#x2014;&#x2014; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7535;&#x8111;&#x4F1A;&#x5E2E;&#x4F60;&#x4F5C;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x8FD0;&#x7B97;&#x3002;&#x4F60;&#x4EC5;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8FD0;&#x7528;&#x5B83;&#x4EEC;&#x3002;<br>&#x6A21;&#x8FD0;&#x7B97; &#x2014;&#x2014; &#x6A21;&#x8FD0;&#x7B97;&#x662F;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x4F59;&#x6570;&#xFF0C;&#x5B83;&#x7684;&#x7B26;&#x53F7;&#x901A;&#x5E38;&#x7528;%&#x767E;&#x5206;&#x53F7;&#x6765;&#x8868;&#x793A;&#x3002;&#x6240;&#x4EE5;23&#x9664;&#x4EE5;7&#x7B49;&#x4E8E;3&#xFF0C;&#x4F59;&#x6570;&#x662F;2&#x3002;23 mod 7 = 2&#x3002;<br>&#x5224;&#x65AD;&#x662F;&#x5947;&#x6570;&#x8FD8;&#x662F;&#x5076;&#x6570;&#x7684;&#x6A21;&#x8FD0;&#x7B97; &#x2014;&#x2014; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x6570;&#x662F;&#x5947;&#x6570;&#x8FD8;&#x662F;&#x5076;&#x6570;&#xFF0C;&#x7528;&#x5B83;mod 2&#x6765;&#x4F5C;&#x6A21;&#x8FD0;&#x7B97;&#x3002;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x662F;0&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5076;&#x6570;&#x3002;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x662F;1&#xFF0C;&#x5C31;&#x662F;&#x5947;&#x6570;&#x3002;23 mod 2&#x7B49;&#x4E8E;1&#xFF0C;&#x6240;&#x4EE5;23&#x662F;&#x5947;&#x6570;&#xFF0C;24 mod 2&#x7B49;&#x4E8E;0&#xFF0C;24&#x662F;&#x5076;&#x6570;&#x3002;<br>&#x5BF9;&#x4E00;&#x4E2A;&#x6570;&#x4F5C;&#x767E;&#x5206;&#x6570;&#x8FD0;&#x7B97;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x6570;&#x6765;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x767E;&#x5206;&#x6570;&#x3002;&#x8B6C;&#x5982;&#x4F60;&#x8981;&#x5F97;&#x5230;279&#x7684;54%&#xFF0C;&#x5C31;&#x662F;&#x7528;0.54*279&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4E3A;&#x4EC0;&#x4E48;1.0&#x7B49;&#x4E8E;100%&#xFF0C;0.0&#x7B49;&#x4E8E;0%&#x3002;<br>&#x77E5;&#x9053;&#x8D1F;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8D1F;&#x6570;&#x4E58;&#x4EE5;&#x8D1F;&#x6570;&#x7B49;&#x4E8E;&#x6B63;&#x6570;&#x3002;&#x8D1F;&#x6570;&#x4E58;&#x4EE5;&#x6B63;&#x6570;&#x7B49;&#x4E8E;&#x8D1F;&#x6570;&#x3002;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;<br>&#x77E5;&#x9053;&#x8FEA;&#x5361;&#x5C14;&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#xFF08;0,0&#xFF09;&#x4EE3;&#x8868;&#x5C4F;&#x5E55;&#x5DE6;&#x4E0A;&#x89D2;&#xFF0C;Y&#x5750;&#x6807;&#x7684;&#x6B63;&#x8F74;&#x5F80;&#x4E0B;&#x3002;<br>&#x77E5;&#x9053;&#x52FE;&#x80A1;&#x5B9A;&#x5F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x7B1B;&#x5361;&#x5C14;&#x5750;&#x6807;&#x4E2D;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x7684;&#x3002;&#x52FE;&#x80A1;&#x5B9A;&#x5F8B;a^2+^2=c^2&#x3002;(x1,y1)&#x548C;(x2,y2)&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x7B49;&#x4E8E;((x1&#x2013;x2)^2+(y1&#x2013;y2)^2)&#x3002;<br>&#x77E5;&#x9053;&#x5341;&#x8FDB;&#x5236;&#x3001;&#x4E8C;&#x8FDB;&#x5236;&#x3001;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x3002;&#x5341;&#x8FDB;&#x5236;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7528;&#x7684;&#x5341;&#x4E2A;&#x6570;&#xFF1A;0-9&#x3002;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x5341;&#x8FDB;&#x5236;&#x7CFB;&#x7EDF;&#x662F;&#x4EBA;&#x7C7B;&#x53D1;&#x660E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6709;&#x5341;&#x4E2A;&#x624B;&#x6307;&#x3002;<br>&#x603B;&#x7684;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x6570;&#x5B66;&#x4E0D;&#x592A;&#x5173;&#x952E;&#xFF0C;&#x5927;&#x591A;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4E0D;&#x5B66;&#x3002;</p>
<p>&#x4F60;&#x5982;&#x679C;&#x6301;&#x7EED;&#x5173;&#x6CE8;&#x8FD9;&#x4E8B;&#x513F;&#xFF0C;&#x5404;&#x79CD;&#x6781;&#x7AEF;&#x5BF9;&#x7ACB;&#x7684;&#x89C2;&#x70B9;&#x7EDD;&#x5BF9;&#x4F1A;&#x5435;&#x7206;&#x4F60;&#x7684;&#x5934;&#x3002;&#x4F46;&#x8FD9;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x7ED3;&#x8BBA;&#xFF0C;&#x56E0;&#x4E3A;&#x88AB;&#x5BF9;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#x4E24;&#x6781;&#x90FD;&#x662F;&#x592A;&#x5927;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x5982;&#x679C;&#x628A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7F29;&#x51CF;&#x4E3A;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x90A3;&#x4E89;&#x8BAE;&#x6027;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5047;&#x5982;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#xFF0C;&#x5374;&#x82B1;&#x4E86;10&#x5E74;&#x6765;&#x5B66;&#x4E60;&#x6570;&#x5B66;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x5929;&#x9762;&#x5BF9;&#x7684;&#x662F;UI&#x5E03;&#x5C40;&#x3001;IDE&#x4F7F;&#x7528;&#x3001;&#x5708;&#x590D;&#x6742;&#x5EA6;&#x63A7;&#x5236;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x7C7B;&#x5E93;&#x7684;&#x4F7F;&#x7528;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x4EBA;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x6570;&#x5B66;&#x5176;&#x5B9E;&#x6CA1;&#x5565;&#x7528;&#xFF0C;&#x4ED6;&#x7B49;&#x4EF7;&#x4E8E;&#x56E0;&#x4E3A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x800C;&#x5931;&#x53BB;&#x4E86;10&#x5E74;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x60F3;&#x8868;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x65E6;&#x8BEF;&#x8BFB;&#x4E86;&#x77E5;&#x8BC6;&#x4E0E;&#x76EE;&#x7684;&#x95F4;&#x7684;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x5B66;&#x4E60;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#xFF0C;&#x8FDB;&#x800C;&#x9020;&#x6210;&#x8D1F;&#x6548;&#x5E94;&#xFF0C;&#x6BD5;&#x7ADF;&#x76F8;&#x5BF9;&#x4E8E;&#x4EBA;&#x7684;&#x53EF;&#x627F;&#x53D7;&#x8D1F;&#x8377;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#x4E0D;&#x662F;&#x592A;&#x5C11;&#xFF0C;&#x800C;&#x662F;&#x592A;&#x591A;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x7684;&#x8BA4;&#x8BC6;&#x662F;&#x53EA;&#x8981;&#x5B66;&#x4E60;&#x5C31;&#x5FC5;&#x7136;&#x6709;&#x6240;&#x5F97;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4EBA;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x4E00;&#x5B9A;&#x7684;&#x662F;&#x6B63;&#x9762;&#x7684;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x504F;&#x9887;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x91CC;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#x4E4B;&#x6240;&#x4EE5;&#x5F02;&#x5E38;&#x7A81;&#x51FA;&#xFF0C;&#x5C31;&#x5728;&#x4E8E;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x4E24;&#x4E2A;&#x7279;&#x8D28;&#xFF1A;&#x66F4;&#x8FED;&#x901F;&#x5EA6;&#x5FEB;&#x548C;&#x5B50;&#x9886;&#x57DF;&#x4F17;&#x591A;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x8F6F;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x662F;&#x7206;&#x70B8;&#x6027;&#x589E;&#x957F;&#x3002;</p>
<p>&#x800C;&#x907F;&#x514D;&#x201C;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x201D;&#x8FD9;&#x4E00;&#x9677;&#x9631;&#x7684;&#x7B2C;&#x4E00;&#x5173;&#x952E;&#x5219;&#x662F;&#x5206;&#x7C7B;&#xFF1A;&#x5BF9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x6240;&#x5173;&#x8054;&#x7684;&#x77E5;&#x8BC6;&#x4E5F;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5F62;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x5C40;&#x89C2;&#x548C;&#x6574;&#x4F53;&#x89C6;&#x56FE;&#x3002;</p>
<p>&#x524D;&#x6587;&#x66FE;&#x7ECF;&#x63D0;&#x8FC7;&#x96C6;&#x4E2D;&#x5BF9;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x91CC;&#x518D;&#x8865;&#x5145;&#x4E00;&#x4E2A;&#x5BF9;&#x7ED5;&#x8FC7;&#x8FD9;&#x4E00;&#x9677;&#x9631;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x6765;&#x81EA;&#x300A;&#x8F6F;&#x4EF6;&#x6210;&#x672C;&#x4F30;&#x7B97;&#xFF1A;COCOMOII&#x6A21;&#x578B;&#x65B9;&#x6CD5;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#x3002;</p>
<p>&#x4E66;&#x91CC;&#x9762;&#x628A;&#x8F6F;&#x4EF6;&#x5206;&#x6210;&#x4E86;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x7C7B;&#x522B;&#xFF1A;</p>
<p>&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x7F16;&#x7A0B;&#xFF08;&#x4E00;&#x822C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF09;<br>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x5668;&#xFF08;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7B49;&#xFF09;    &#x5E94;&#x7528;&#x7EC4;&#x88C5;    &#x7CFB;&#x7EDF;&#x96C6;&#x6210;<br>&#x57FA;&#x7840;&#x7ED3;&#x6784;&#xFF08;OS&#xFF0C;DB&#x7B49;&#xFF09;<br>&#x5728;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E66;&#x91CC;&#x8FD8;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x5373;95%&#x7684;&#x4EBA;&#x4ECE;&#x4E8B;&#x7684;&#x662F;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x7F16;&#x7A0B;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#xFF0C;&#x901A;&#x8FC7;&#x5B83;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x8BC6;&#x5230;&#x6BCF;&#x4E00;&#x7C7B;&#x522B;&#x80CC;&#x540E;&#x9690;&#x542B;&#x7684;&#x77E5;&#x8BC6;&#x9700;&#x6C42;&#x5176;&#x5B9E;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5219;&#x8981;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x7684;&#x8BBE;&#x5B9A;&#x7126;&#x70B9;&#x3002;&#x518D;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x7B97;&#x6CD5;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;&#x6700;&#x7ECF;&#x5178;&#x7684;&#x4E66;&#x7C4D;&#x6050;&#x6015;&#x662F;Donald Knuth&#x7684;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x827A;&#x672F;&#x300B;&#x3002;&#x5BF9;&#x6B64;&#x4E66;&#x7684;&#x8BC4;&#x4EF7;&#x5DF2;&#x7ECF;&#x4E0D;&#x6B62;&#x662F;&#x9AD8;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5982;&#xFF1A;</p>
<p>&#x8FD9;&#x90E8;&#x591A;&#x5377;&#x4E13;&#x8457;&#x662F;&#x516C;&#x8BA4;&#x7684;&#x5BF9;&#x7ECF;&#x5178;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6700;&#x6743;&#x5A01;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x51E0;&#x5341;&#x5E74;&#x6765;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5B66;&#x751F;&#x3001;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x8FD8;&#x662F;&#x7F16;&#x7A0B;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#xFF0C;&#x672C;&#x5957;&#x4E66;&#x7684;&#x524D;&#x4E09;&#x5377;&#x90FD;&#x662F;&#x4ED6;&#x4EEC;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7406;&#x8BBA;&#x3001;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x5B9E;&#x8DF5;&#x7684;&#x5B9D;&#x8D35;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x5957;&#x96C6;&#x6240;&#x6709;&#x57FA;&#x7840;&#x7B97;&#x6CD5;&#x4E4B;&#x5927;&#x6210;&#x7684;&#x7ECF;&#x5178;&#x4E4B;&#x4F5C;&#xFF0C;&#x5F53;&#x4ECA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6240;&#x638C;&#x63E1;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x77E5;&#x8BC6;&#x90FD;&#x6765;&#x6E90;&#x4E8E;&#x6B64;&#x3002;</p>
<p>&#x2014;&#x2014; Byte</p>
<p>&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5E94;&#x8BE5;&#x628A;&#x8FD9;&#x4E66;&#x8BFB;&#x4E00;&#x8BFB;&#xFF1F;&#x8FD9;&#x4E66;&#x7684;&#x524D;&#x4E09;&#x5377;&#x5927;&#x81F4;&#x6709;2000&#x9875;&#xFF0C;&#x4E0A;&#x73ED;&#x7684;&#x4EBA;&#x90FD;&#x8BFB;&#x901A;&#x4F30;&#x8BA1;&#x8981;1~2&#x5E74;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x81F3;&#x5C11;&#x5728;&#x6211;&#x6765;&#x770B;&#xFF0C;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x8981;&#x770B;&#x4F60;&#x505A;&#x7684;&#x662F;&#x90A3;&#x7C7B;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F60;&#x4EBA;&#x751F;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x5728;&#x90A3;&#x91CC;&#x800C;&#x5B9A;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x7684;&#x662F;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x7F16;&#x7A0B;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x8D22;&#x52A1;&#x7C7B;&#x8F6F;&#x4EF6;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x76EE;&#x6807;&#x4E5F;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x7EE7;&#x7EED;&#x6DF1;&#x9020;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x8BFB;&#x8FD9;&#x4E66;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x7F16;&#x7A0B;&#x4E0A;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x5199;&#x7B97;&#x6CD5;&#x7684;&#x673A;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x5C11;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x3002;&#x53CD;&#x5012;&#x662F;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#xFF08;&#x4F1A;&#x8BA1;&#x77E5;&#x8BC6;&#xFF09;&#x3001;OO&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x751A;&#x81F3;&#x4E8E;&#x4F30;&#x7B97;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x90FD;&#x6BD4;&#x7814;&#x7A76;&#x7B97;&#x6CD5;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x3002; &#x65E2;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x90A3;&#x4E48;&#x4ECE;&#x52A1;&#x5B9E;&#x7684;&#x89C2;&#x70B9;&#x4E0A;&#x770B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x53BB;&#x5B66;&#x4E60;&#x4E0D;&#x80FD;&#x5728;&#x53EF;&#x89C1;&#x8303;&#x56F4;&#x5185;&#x521B;&#x751F;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53BB;&#x5B66;&#x4E60;&#x7ACB;&#x523B;&#x53EF;&#x4EE5;&#x53D8;&#x73B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8D70;&#x6781;&#x7AEF;&#x7684;&#x4EBA;&#x4F1A;&#x627E;&#x51FA;&#x9700;&#x8981;&#x5199;&#x7B97;&#x6CD5;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x53CD;&#x9A73;&#x4E0A;&#x8FF0;&#x7ACB;&#x8BBA;&#xFF0C;&#x4F46;&#x70B9;&#x4E0D;&#x8DB3;&#x4EE5;&#x8868;&#x5F81;&#x9762;&#xFF0C;&#x5373;&#x4F7F;&#x5076;&#x5C14;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x4E86;&#x89E3;&#x4E0B;&#x7B97;&#x6CD5;&#xFF0C;&#x771F;&#x5C31;&#x503C;&#x5F97;&#x82B1;&#x90A3;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#x53BB;&#x5B66;&#x4E60;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5C3D;&#x53EF;&#x80FD;&#x501F;&#x9274;&#x73B0;&#x6210;&#x7684;&#x3002;</p>
<p>&#x800C;&#x5728;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x6027;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x60C5;&#x5F62;&#x5C31;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x65F6;&#x7B97;&#x6CD5;&#x65E0;&#x7591;&#x662F;&#x975E;&#x5E38;&#x6838;&#x5FC3;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6240;&#x4EE5;Google&#x8FD9;&#x7C7B;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x4E2D;&#x5F80;&#x5F80;&#x975E;&#x5E38;&#x5F3A;&#x8C03;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6700;&#x5173;&#x952E;&#x7684;&#x5C31;&#x662F;&#x805A;&#x7126;&#xFF0C;&#x805A;&#x7126;&#x7684;&#x6839;&#x672C;&#x5219;&#x662F;&#x8981;&#x5728;&#x9650;&#x5B9A;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x521B;&#x751F;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x4ECE;&#x65B9;&#x6CD5;&#x4E0A;&#x8BB2;&#xFF0C;&#x805A;&#x7126;&#x5C31;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x5927;&#x5C0F;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x6DF1;&#x3002;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x7684;&#x4E0D;&#x8BBA;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BB2;&#xFF0C;&#x6A2A;&#x5411;&#x7A7F;&#x8D8A;&#x548C;&#x7EB5;&#x5411;&#x7A7F;&#x8D8A;&#x90FD;&#x4E0D;&#x592A;&#x884C;&#xFF0C;&#x9664;&#x975E;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x7A77;&#x5C3D;&#x5F53;&#x524D;&#x7684;&#x9886;&#x57DF;&#x3002;&#x7EB5;&#x5411;&#x7A7F;&#x8D8A;&#x662F;&#x6307;&#x4ECE;&#x5E95;&#x5C42;&#x7A7F;&#x5230;&#x4E0A;&#x5C42;&#xFF08;&#x60F3;&#x60F3;&#x5F00;&#x53D1;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x548C;&#x7528;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#xFF09;&#xFF0C;&#x6A2A;&#x5411;&#x7A7F;&#x8D8A;&#x5219;&#x6307;&#x6A2A;&#x8DE8;&#x592A;&#x591A;&#x7684;&#x9886;&#x57DF;&#xFF08;&#x60F3;&#x60F3;&#x4ECE;&#x5185;&#x6838;&#x9A71;&#x52A8;&#x8DE8;&#x8D8A;&#x5230;&#x4FE1;&#x606F;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF09;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x771F;&#x7684;&#x62E5;&#x6709;&#x65E0;&#x9650;&#x7684;&#x65F6;&#x95F4;&#x8D44;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#x70B9;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x592A;&#x5173;&#x952E;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x8FDC;&#x4E0D;&#x50CF;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x5145;&#x6C9B;&#x3002;&#x8FD9;&#x70B9;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x63A2;&#x8BA8;&#x3002;</p>
<p>&#x5728;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x540E;&#xFF0C;&#x518D;&#x914D;&#x5408;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x5206;&#x7C7B;&#x5730;&#x56FE;&#xFF0C;&#x90A3;&#x4E48;&#x907F;&#x5F00;&#x8FD9;&#x4E00;&#x9677;&#x9631;&#x7684;&#x51E0;&#x7387;&#x5C31;&#x5927;&#x4E86;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x4E0E;&#x5B9E;&#x8DF5;&#x76F8;&#x5206;&#x79BB;</p>
<p>&#x559C;&#x6B22;&#x770B;&#x7F51;&#x6587;&#x7684;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x4F1A;&#x4E0D;&#x77E5;&#x9053;&#x8D77;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F30;&#x8BA1;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x6CE8;&#x610F;&#x8FC7;&#x8D77;&#x70B9;&#x7ED9;&#x5C0F;&#x8BF4;&#x5206;&#x7C7B;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x5728;&#x7F51;&#x6587;&#x5C0F;&#x8BF4;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x4E2A;&#x6D41;&#x6D3E;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;&#x626E;&#x732A;&#x5403;&#x864E;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x6D41;&#x6D3E;&#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x662F;&#x5F88;&#x5389;&#x5BB3;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x8981;&#x5047;&#x88C5;&#x5F88;&#x83DC;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x5173;&#x952E;&#x65F6;&#x523B;&#x529B;&#x633D;&#x72C2;&#x6F9C;&#x3002;&#x8FD9;&#x4E2A;&#x6D41;&#x6D3E;&#x5341;&#x5206;&#x6709;&#x4EBA;&#x6C14;&#xFF0C;&#x5927;&#x6982;&#x4EC5;&#x6B21;&#x4E8E;&#x201C;&#x5347;&#x7EA7;&#x7EC3;&#x529F;&#x201D;&#xFF0C;&#x800C;&#x8FDC;&#x9AD8;&#x4E8E;&#x201C;&#x91CD;&#x751F;&#x201D;&#x3001;&#x201C;&#x8F6C;&#x4E16;&#x201D;&#x8FD9;&#x7C7B;&#x7684;&#x6D41;&#x6D3E;&#x3002;</p>
<p>&#x7F51;&#x6587;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x5E02;&#x573A;&#x5BFC;&#x5411;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x53EF;&#x4EE5;&#x4ECE;&#x4FA7;&#x9762;&#x8BF4;&#x660E;&#x5F88;&#x591A;&#x4EBA;&#x559C;&#x6B22;&#x201C;&#x626E;&#x732A;&#x5403;&#x864E;&#x201D;&#x6216;&#x8005;&#x8BF4;&#x6F5C;&#x610F;&#x8BC6;&#x91CC;&#x6709;&#x7740;&#x201C;&#x626E;&#x732A;&#x5403;&#x864E;&#x201D;&#x7684;&#x60C5;&#x8282;&#x3002;&#x201C;&#x626E;&#x732A;&#x5403;&#x864E;&#x201D;&#x8FD9;&#x4E8B;&#x513F;&#x5C0F;&#x8BF4;&#x91CC;&#x770B;&#x7740;&#x5F88;&#x723D;&#xFF0C;&#x4F46;&#x632A;&#x5230;&#x73B0;&#x5B9E;&#x91CC;&#x6765;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x6389;&#x5230;&#x5B66;&#x4E60;&#x9677;&#x9631;&#x91CC;&#x3002;&#x66F4;&#x53EF;&#x6015;&#x7684;&#x662F;&#xFF0C;&#x73B0;&#x5B9E;&#x91CC;&#x6709;&#x8FD9;&#x79CD;&#x5FC3;&#x601D;&#x7684;&#x4EBA;&#x5176;&#x5B9E;&#x4E5F;&#x8FD8;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x73B0;&#x8C61;&#xFF1A;&#x5F88;&#x591A;&#x4EBA;&#x81EA;&#x5B66;&#x7684;&#x4E1C;&#x897F;&#x548C;&#x5DE5;&#x4F5C;&#x4E2D;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x5B8C;&#x5168;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4E00;&#x8FB9;&#x7528;&#x7740;C#&#x505A;Web&#x5F00;&#x53D1;&#xFF0C;&#x4E00;&#x8FB9;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x7740;C/C++&#x505A;&#x5D4C;&#x5165;&#x5F0F;&#x3002;</p>
<p>&#x8FD9;&#x4E8B;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0D;&#x5BF9;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x975E;&#x5E38;&#x5371;&#x9669;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x90A3;&#x6837;&#x90FD;&#x6CA1;&#x6709;&#x9AD8;&#x5EA6;&#x3002;&#x6211;&#x4EEC;&#x5F97;&#x627F;&#x8BA4;&#x5F53;&#x4EBA;&#x751F;&#x88AB;&#x9519;&#x4F4D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x53EA;&#x80FD;&#x8FD9;&#x6837;&#x6765;&#x6539;&#x53D8;&#x547D;&#x8FD0;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4F46;&#x9996;&#x5148;&#x8981;&#x8BA4;&#x8BC6;&#x5230;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x76F8;&#x5F53;&#x4F4E;&#x6548;&#x7684;&#xFF0C;&#x4F4E;&#x6548;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x540E;&#x5BF9;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x6709;&#x7ED3;&#x679C;&#x3002;</p>
<p>CSDN&#x66FE;&#x7ECF;&#x505A;&#x8FC7;&#x4E00;&#x4EFD;&#x85AA;&#x916C;&#x7EDF;&#x8BA1;&#xFF08;<a href="http://www.programmer.com.cn/5877/&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x4E09;&#x4E2A;&#x4E0E;&#x4E0A;&#x8FF0;&#x8EAB;&#x5728;&#x66F9;&#x8425;&#x5FC3;&#x5728;&#x6C49;&#x73B0;&#x8C61;&#x6709;&#x5173;&#x8054;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;" target="_blank" rel="external">http://www.programmer.com.cn/5877/&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x4E09;&#x4E2A;&#x4E0E;&#x4E0A;&#x8FF0;&#x8EAB;&#x5728;&#x66F9;&#x8425;&#x5FC3;&#x5728;&#x6C49;&#x73B0;&#x8C61;&#x6709;&#x5173;&#x8054;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;</a></p>
<p>&#x4E00;&#x662F;73%&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x85AA;&#x8D44;&#x5E76;&#x4E0D;&#x6EE1;&#x610F;&#x3002;<br>&#x4E8C;&#x662F;&#x5404;&#x4E2A;&#x4E3B;&#x6D41;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x5927;&#x3002;&#x867D;&#x7136;C#&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x6708;&#x6536;&#x5165;&#x5C0F;&#x4E8E;5000&#x5143;&#x7684;&#x6BD4;&#x4F8B;&#x6700;&#x9AD8;&#xFF0C;&#x4F46;5000~10000&#x8FD9;&#x4E2A;&#x7FA4;&#x4F53;&#x5728;&#x4E3B;&#x6D41;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x4E0A;&#x76F8;&#x5DEE;&#x5E76;&#x4E0D;&#x5927;&#x3002;<br>&#x4E09;&#x662F;&#x5E73;&#x5747;&#x6765;&#x770B;&#xFF0C;&#x6536;&#x5165;&#x589E;&#x957F;&#x548C;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x6B63;&#x76F8;&#x5173;&#x3002;&#x5F53;&#x7136;&#x8BA4;&#x4E3A;&#x5230;&#x90A3;&#x4E2A;&#x5C81;&#x6570;&#x5DE5;&#x8D44;&#x81EA;&#x7136;&#x5C31;&#x9AD8;&#x4E86;&#x662F;&#x5F88;&#x5371;&#x9669;&#x7684;&#x3002;<br>&#x5BF9;&#x85AA;&#x8D44;&#x4E0D;&#x6EE1;&#x610F;&#x5E94;&#x8BE5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5E0C;&#x671B;&#x8DE8;&#x754C;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x52A8;&#x529B;&#xFF0C;&#x4F46;&#x6536;&#x5165;&#x548C;&#x5E74;&#x9650;&#x6B63;&#x76F8;&#x5173;&#xFF0C;&#x4E0E;&#x8BED;&#x8A00;&#x975E;&#x6B63;&#x76F8;&#x5173;&#x5374;&#x8BF4;&#x660E;&#x5355;&#x7EAF;&#x4ECE;&#x529F;&#x5229;&#x89D2;&#x5EA6;&#x770B;&#x8DE8;&#x754C;&#x5E76;&#x4E0D;&#x660E;&#x667A;&#x3002;&#x56E0;&#x4E3A;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x4EBA;Java&#x8BED;&#x8A00;&#x7528;&#x8FC7;&#x4E09;&#x5E74;&#xFF0C;C#&#x7528;&#x8FC7;&#x4E09;&#x5E74;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x770B;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x66F4;&#x53EF;&#x80FD;&#x5904;&#x5728;&#x4E09;&#x5E74;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x516D;&#x5E74;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x662F;&#x4E00;&#x79CD;&#x56FA;&#x5316;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x8FD9;&#x5C31;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x66F4;&#x591A;&#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x8DF5;&#x800C;&#x975E;&#x662F;&#x4E00;&#x79CD;&#x7406;&#x8BBA;&#x3002;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5185;&#x7684;&#x5F88;&#x591A;&#x9886;&#x57DF;&#xFF0C;&#x603B;&#x4F53;&#x4E0A;&#x770B;&#x4F53;&#x73B0;&#x7684;&#x662F;&#x590D;&#x6742;&#x800C;&#x4E0D;&#x662F;&#x8270;&#x96BE;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x3002;</p>
<p>&#x8BB2;&#x5230;&#x5230;&#x8FD9;&#x91CC;&#x5C31;&#x6709;&#x5FC5;&#x8981;&#x7B80;&#x5355;&#x533A;&#x5206;&#x4E00;&#x4E0B;&#x201C;&#x590D;&#x6742;&#x201D;&#x548C;&#x201C;&#x8270;&#x96BE;&#x201D;&#x3002;&#x8003;&#x8BD5;&#x51FA;&#x9898;&#x53EF;&#x4EE5;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x662F;&#x6BCF;&#x9053;&#x9898;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#xFF0C;&#x4F46;&#x9898;&#x91CF;&#x5F88;&#x5927;&#xFF1B;&#x4E00;&#x662F;&#x9898;&#x91CF;&#x5F88;&#x5C11;&#xFF0C;&#x4F46;&#x6BCF;&#x9053;&#x5F88;&#x96BE;&#x3002;&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x4E24;&#x7C7B;&#x8003;&#x8BD5;&#x65B9;&#x6CD5;&#x4E0B;&#xFF0C;&#x5F97;&#x9AD8;&#x5206;&#x90FD;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5176;&#x96BE;&#x5EA6;&#x7684;&#x6765;&#x6E90;&#x5374;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x524D;&#x8005;&#x66F4;&#x591A;&#x7684;&#x4F53;&#x73B0;&#x4E3A;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x5374;&#x4F53;&#x73B0;&#x4E3A;&#x8270;&#x96BE;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x91CC;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x4E13;&#x95E8;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x7B97;&#x6CD5;&#x7B49;&#xFF0C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5219;&#x66F4;&#x7C7B;&#x4F3C;&#x4E8E;&#x524D;&#x8005;&#xFF0C;&#x6240;&#x4EE5;&#x7ECF;&#x8FC7;&#x57F9;&#x8BAD;&#x540E;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x505A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#xFF0C;&#x8FDB;&#x5165;&#x95E8;&#x69DB;&#x5E76;&#x4E0D;&#x9AD8;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8270;&#x96BE;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5929;&#x5206;&#x5F88;&#x91CD;&#x8981;&#xFF1B;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x7EC3;&#x4E60;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6240;&#x4EE5;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B9E;&#x8DF5;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x7EAF;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#x7684;&#x6743;&#x91CD;&#x8F83;&#x4F4E;&#xFF0C;&#x5F53;&#x7136;&#x57FA;&#x672C;&#x7684;&#x7B97;&#x6CD5;&#x590D;&#x6742;&#x5EA6;&#x8FD8;&#x662F;&#x8981;&#x660E;&#x767D;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8131;&#x79BB;&#x9879;&#x76EE;&#x5B9E;&#x8DF5;&#x7684;&#x5B66;&#x4E60;&#x6295;&#x5165;&#x4EA7;&#x51FA;&#x6BD4;&#x5F80;&#x5F80;&#x4F1A;&#x5DEE;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x7F16;&#x7A0B;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x5355;&#x7EAF;&#x4ECE;&#x5B66;&#x4E60;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x638C;&#x63E1;&#x5404;&#x79CD;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#xFF08;&#x4E8B;&#x4EF6;&#x3001;&#x4FE1;&#x53F7;&#x706F;&#x3001;&#x4E92;&#x65A5;&#x91CF;&#x7B49;&#xFF09;&#x4E5F;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#x3002;&#x5199;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5F88;&#x5C11;&#x4F1A;&#x51FA;&#x9519;&#x3002;&#x4F46;&#x4E00;&#x65E6;&#x843D;&#x5230;&#x5177;&#x4F53;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x867D;&#x7136;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x672C;&#x8D28;&#x6CA1;&#x53D8;&#xFF0C;&#x4F46;&#x6CA1;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x51E0;&#x4E4E;&#x4E00;&#x5B9A;&#x4F1A;&#x5728;&#x6D89;&#x53CA;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#x5BFC;&#x81F4;&#x4E00;&#x4F1A;&#x513F;&#x51FA;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x4E0D;&#x51FA;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x518D;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;&#x4F60;&#x53EF;&#x80FD;&#x770B;&#x4E86;&#x5F88;&#x591A;&#x8BBE;&#x8BA1;&#x7684;&#x4E66;&#xFF0C;&#x4F46;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x5199;&#x8FC7;&#x4EC0;&#x4E48;&#x7A0B;&#x5E8F;&#xFF0C;&#x603B;&#x662F;&#x5728;&#x65E2;&#x6709;&#x4EE3;&#x7801;&#x4E0A;&#x4FEE;&#x4FEE;&#x6539;&#x6539;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x5B8C;&#x6210;&#x51E0;&#x5343;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x77E5;&#x8BC6;&#x662F;&#x5F88;&#x96BE;&#x878D;&#x6C47;&#x8D2F;&#x901A;&#x7684;&#xFF0C;&#x4E5F;&#x8FD8;&#x662F;&#x65E0;&#x6CD5;&#x5F88;&#x597D;&#x7684;&#x627F;&#x62C5;&#x5927;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x70B9;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x65C1;&#x8BC1;&#xFF0C;&#x6839;&#x636E;&#x7EDF;&#x8BA1;&#x6700;&#x591A;&#x7684;Bug&#x662F;&#x7531;&#x65B0;&#x624B;&#x5BFC;&#x81F4;&#x7684;&#x3002;&#x8FD9;&#x4ECE;&#x4FA7;&#x9762;&#x8BF4;&#x660E;&#xFF0C;&#x80FD;&#x505A;&#x548C;&#x80FD;&#x505A;&#x597D;&#x4E4B;&#x95F4;&#x7684;&#x9E3F;&#x6C9F;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5B9E;&#x8DF5;&#x6765;&#x586B;&#x5E73;&#x7684;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x671F;&#x671B;&#x5148;&#x9009;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x518D;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#xFF0C;&#x52AA;&#x529B;&#x8F6C;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x635F;&#x5931;&#x5F88;&#x5927;&#x7684;&#x3002;&#x5355;&#x7EAF;&#x4ECE;&#x589E;&#x503C;&#x6548;&#x80FD;&#x4E0A;&#x770B;&#xFF0C;&#x89E3;&#x51B3;&#x8FD9;&#x70B9;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x9664;&#x975E;&#x5FC5;&#x987B;&#x653E;&#x5F03;&#x5F53;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x9886;&#x57DF;&#xFF0C;&#x5426;&#x5219;&#x8981;&#x4EE5;&#x5F53;&#x524D;&#x53C2;&#x52A0;&#x7684;&#x9879;&#x76EE;&#x4E3A;&#x6839;&#x57FA;&#x5C55;&#x5F00;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x8C03;&#x548C;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x8DF5;&#x3002;</p>
<p>&#x800C;&#x9664;&#x975E;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x9886;&#x57DF;&#x8FC7;&#x4E8E;&#x504F;&#x72ED;&#xFF0C;&#x5927;&#x591A;&#x65F6;&#x5019;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;C#&#x2192;C/C++&#xFF09;&#x3001;&#x4E0D;&#x540C;&#x9886;&#x57DF;&#x95F4;&#xFF08;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x2192;&#x5730;&#x7406;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7B49;&#xFF09;&#x7A7F;&#x8D8A;&#x635F;&#x5931;&#x53EF;&#x80FD;&#x66F4;&#x5927;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x5982;&#x4F55;&#x5728;&#x201C;&#x535A;&#x201D;&#x4E0E;&#x201C;&#x4E13;&#x201D;&#x95F4;&#x5E73;&#x8861;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x4E2D;&#x66F4;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x9886;&#x57DF;&#xFF0C;&#x5C06;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x91CC;&#x9646;&#x7EED;&#x8C08;&#x5230;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/gen-programming-guide-4-become-master/" data-id="cj0i7aeof001nggskghloc0ro" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/gen-programming-guide-4-become-master/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/gen-programming-guide-5-balance/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：在博与专之间取得平衡 平衡最合适
        
      </div>
    </a>
  
  
    <a href="/2016/gen-programming-guide-3-direction/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：程序员的几个职场发展方向 职场该如何走？</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/gen-programming-guide-4-become-master/" data-title="码路指南：为何你成不了编程高手？ 成长路上常见的坑" data-url="http://snowyying.github.io/2016/gen-programming-guide-4-become-master/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">16</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">13</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/网络/">网络</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12.22px;">C</a> <a href="/tags/C/" style="font-size: 12.22px;">C++</a> <a href="/tags/C-C/" style="font-size: 15.56px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11.11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15.56px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 11.11px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11.11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 13.33px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11.11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17.78px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13.33px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12.22px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11.11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 11.11px;">http</a> <a href="/tags/https/" style="font-size: 10px;">https</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11.11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11.11px;">poll</a> <a href="/tags/select/" style="font-size: 13.33px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11.11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16.67px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/性能/" style="font-size: 13.33px;">性能</a> <a href="/tags/成长/" style="font-size: 18.89px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16.67px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 17.78px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 17.78px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14.44px;">设计模式</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 11.11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/os-linux-construct-comic/">漫画趣解 linux 内核构造</a>
          </li>
        
          <li>
            <a href="/2017/gen-programmer-skill-map/">程序员技能图谱</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-simple-web-server/">开源 http(s) 框架 Simple Web Server</a>
          </li>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/net-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT 协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-overview/">理解 RESTful 架构</a>
          </li>
        
          <li>
            <a href="/2017/c-c-cpp-hybird-programming/">C 与 C++ 混合编程</a>
          </li>
        
          <li>
            <a href="/2017/os-io-fast-gpio/">ARM Linux 通过 mmap 操作 GPIO (快速 GPIO)</a>
          </li>
        
          <li>
            <a href="/2017/misc-key-matrix/">GPIO 的矩阵按键扫描电路</a>
          </li>
        
          <li>
            <a href="/2017/misc-fallible-it-words/">中国程序员容易发音错误的计算机相关英文单词</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>