<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>设计模式形象比喻 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA;: http://blog.csdn.net/hehe9737/article/details/7074562 2011-12-15
&amp;#x521B;&amp;#x5EFA;&amp;#x578B;&amp;#x6A21;&amp;#x5F0F;
&amp;#x62BD;&amp;#x8C61;&amp;#x5DE5;&amp;#x5382;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF08;Abstract Factory&amp;#xF">
<meta property="og:type" content="article">
<meta property="og:title" content="设计模式形象比喻">
<meta property="og:url" content="http://snowyying.github.io/2016/swe-dp-metaphor/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA;: http://blog.csdn.net/hehe9737/article/details/7074562 2011-12-15
&amp;#x521B;&amp;#x5EFA;&amp;#x578B;&amp;#x6A21;&amp;#x5F0F;
&amp;#x62BD;&amp;#x8C61;&amp;#x5DE5;&amp;#x5382;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF08;Abstract Factory&amp;#xF">
<meta property="og:updated_time" content="2017-02-07T06:33:51.381Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="设计模式形象比喻">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA;: http://blog.csdn.net/hehe9737/article/details/7074562 2011-12-15
&amp;#x521B;&amp;#x5EFA;&amp;#x578B;&amp;#x6A21;&amp;#x5F0F;
&amp;#x62BD;&amp;#x8C61;&amp;#x5DE5;&amp;#x5382;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF08;Abstract Factory&amp;#xF">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不破, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-swe-dp-metaphor" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      设计模式形象比喻
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/swe-dp-metaphor/" class="article-date">
  <time datetime="2016-11-10T14:54:14.000Z" itemprop="datePublished">2016-11-10</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Software-Engineering/">Software Engineering</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: http://blog.csdn.net/hehe9737/article/details/7074562 2011-12-15</code></p>
<h2 id="&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;"></a>&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;</h2><ul>
<li><p>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF08;Abstract Factory&#xFF09;<br>&#x8FFD;MM&#x5C11;&#x4E0D;&#x4E86;&#x8BF7;&#x5403;&#x996D;&#x4E86;&#xFF0C;&#x9EA6;&#x5F53;&#x52B3;&#x7684;&#x9E21;&#x7FC5;&#x548C;&#x80AF;&#x5FB7;&#x57FA;&#x7684;&#x9E21;&#x7FC5;&#x90FD;&#x662F;MM&#x7231;&#x5403;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x867D;&#x7136;&#x53E3;&#x5473;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4E0D;&#x7BA1;&#x4F60;&#x5E26;MM&#x53BB;&#x9EA6;&#x5F53;&#x52B3;&#x6216;&#x80AF;&#x5FB7;&#x57FA;&#xFF0C;&#x53EA;&#x7BA1;&#x5411;&#x670D;&#x52A1;&#x5458;&#x8BF4;&#x201C;&#x6765;&#x56DB;&#x4E2A;&#x9E21;&#x7FC5;&#x201D;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x9EA6;&#x5F53;&#x52B3;&#x548C;&#x80AF;&#x5FB7;&#x57FA;&#x5C31;&#x662F;&#x751F;&#x4EA7;&#x9E21;&#x7FC5;&#x7684;Factory</p>
<blockquote>
<p>&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF1A;&#x5BA2;&#x6237;&#x7C7B;&#x548C;&#x5DE5;&#x5382;&#x7C7B;&#x5206;&#x5F00;&#x3002;&#x6D88;&#x8D39;&#x8005;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x9700;&#x8981;&#x67D0;&#x79CD;&#x4EA7;&#x54C1;&#xFF0C;&#x53EA;&#x9700;&#x5411;&#x5DE5;&#x5382;&#x8BF7;&#x6C42;&#x5373;&#x53EF;&#x3002;&#x6D88;&#x8D39;&#x8005;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x7EB3;&#x65B0;&#x4EA7;&#x54C1;&#x3002;&#x7F3A;&#x70B9;&#x662F;&#x5F53;&#x4EA7;&#x54C1;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5DE5;&#x5382;&#x7C7B;&#x4E5F;&#x8981;&#x505A;&#x76F8;&#x5E94;&#x7684;&#x4FEE;&#x6539;&#x3002;&#x5982;&#xFF1A;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x53CA;&#x5982;&#x4F55;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4F9B;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Builder&#xFF09;<br>MM&#x6700;&#x7231;&#x542C;&#x7684;&#x5C31;&#x662F;&#x201C;&#x6211;&#x7231;&#x4F60;&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x4E86;&#xFF0C;&#x89C1;&#x5230;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x7684;MM,&#x8981;&#x80FD;&#x591F;&#x7528;&#x5979;&#x4EEC;&#x7684;&#x65B9;&#x8A00;&#x8DDF;&#x5979;&#x8BF4;&#x8FD9;&#x53E5;&#x8BDD;&#x54E6;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x79CD;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x673A;&#xFF0C;&#x4E0A;&#x9762;&#x6BCF;&#x79CD;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6309;&#x952E;&#xFF0C;&#x89C1;&#x5230;MM&#x6211;&#x53EA;&#x8981;&#x6309;&#x5BF9;&#x5E94;&#x7684;&#x952E;&#xFF0C;&#x5B83;&#x5C31;&#x80FD;&#x591F;&#x7528;&#x76F8;&#x5E94;&#x7684;&#x8BED;&#x8A00;&#x8BF4;&#x51FA;&#x201C;&#x6211;&#x7231;&#x4F60;&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x4E86;&#xFF0C;&#x56FD;&#x5916;&#x7684;MM&#x4E5F;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x641E;&#x5B9A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x201C;&#x6211;&#x7231;&#x4F60; &#x201D;builder&#x3002;&#xFF08;&#x8FD9;&#x4E00;&#x5B9A;&#x6BD4;&#x7F8E;&#x519B;&#x5728;&#x4F0A;&#x62C9;&#x514B;&#x7528;&#x7684;&#x7FFB;&#x8BD1;&#x673A;&#x597D;&#x5356;&#xFF09;</p>
<blockquote>
<p>&#x5EFA;&#x9020;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x8868;&#x8C61;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x6210;&#x8FC7;&#x7A0B;&#x5206;&#x5272;&#x5F00;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4E00;&#x4E2A;&#x5EFA;&#x9020;&#x8FC7;&#x7A0B;&#x751F;&#x6210;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x90E8;&#x8868;&#x8C61;&#x7684;&#x4EA7;&#x54C1;&#x5BF9;&#x8C61;&#x3002;&#x5EFA;&#x9020;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x4EA7;&#x54C1;&#x5185;&#x90E8;&#x8868;&#x8C61;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5BA2;&#x6237;&#x4E0D;&#x5FC5;&#x77E5;&#x9053;&#x4EA7;&#x54C1;&#x5185;&#x90E8;&#x7EC4;&#x6210;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5EFA;&#x9020;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5F3A;&#x5236;&#x5B9E;&#x884C;&#x4E00;&#x79CD;&#x5206;&#x6B65;&#x9AA4;&#x8FDB;&#x884C;&#x7684;&#x5EFA;&#x9020;&#x8FC7;&#x7A0B;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x5DE5;&#x5382;(&#x65B9;&#x6CD5;)&#x6A21;&#x5F0F;&#xFF08;Factory&#xFF09;<br>&#x8BF7;MM&#x53BB;&#x9EA6;&#x5F53;&#x52B3;&#x5403;&#x6C49;&#x5821;&#xFF0C;&#x4E0D;&#x540C;&#x7684;MM&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53E3;&#x5473;&#xFF0C;&#x8981;&#x6BCF;&#x4E2A;&#x90FD;&#x8BB0;&#x4F4F;&#x662F;&#x4E00;&#x4EF6;&#x70E6;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4E00;&#x822C;&#x91C7;&#x7528;Factory Method&#x6A21;&#x5F0F;&#xFF0C;&#x5E26;&#x7740;MM&#x5230;&#x670D;&#x52A1;&#x5458;&#x90A3;&#x513F;&#xFF0C;&#x8BF4;&#x201C;&#x8981;&#x4E00;&#x4E2A;&#x6C49;&#x5821;&#x201D;&#xFF0C;&#x5177;&#x4F53;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6C49;&#x5821;&#x5462;&#xFF0C;&#x8BA9;MM&#x76F4;&#x63A5;&#x8DDF;&#x670D;&#x52A1;&#x5458;&#x8BF4;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x5DE5;&#x5382;(&#x65B9;&#x6CD5;)&#x6A21;&#x5F0F;&#xFF1A;&#x6838;&#x5FC3;&#x5DE5;&#x5382;&#x7C7B;&#x4E0D;&#x518D;&#x8D1F;&#x8D23;&#x6240;&#x6709;&#x4EA7;&#x54C1;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5177;&#x4F53;&#x521B;&#x5EFA;&#x7684;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x5B50;&#x7C7B;&#x53BB;&#x505A;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x89D2;&#x8272;&#xFF0C;&#x4EC5;&#x8D1F;&#x8D23;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x5DE5;&#x5382;&#x7C7B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x63A5;&#x89E6;&#x54EA;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7C7B;&#x5E94;&#x5F53;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x79CD;&#x7EC6;&#x8282;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x539F;&#x578B;&#x6A21;&#x5F0F;&#xFF08;Prototype&#xFF09;<br>&#x8DDF;MM&#x7528;QQ&#x804A;&#x5929;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8BF4;&#x4E9B;&#x6DF1;&#x60C5;&#x7684;&#x8BDD;&#x8BED;&#x4E86;&#xFF0C;&#x6211;&#x641C;&#x96C6;&#x4E86;&#x597D;&#x591A;&#x8089;&#x9EBB;&#x7684;&#x60C5;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x65F6;&#x53EA;&#x8981;copy&#x51FA;&#x6765;&#x653E;&#x5230;QQ&#x91CC;&#x9762;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x60C5;&#x8BDD;prototype&#x4E86;&#x3002;&#xFF08;100&#x5757;&#x94B1;&#x4E00;&#x4EFD;&#xFF0C;&#x4F60;&#x8981;&#x4E0D;&#x8981;&#xFF09;</p>
<blockquote>
<p>&#x539F;&#x578B;&#x6A21;&#x5F0F;&#xFF1A;&#x901A;&#x8FC7;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x6765;&#x6307;&#x660E;&#x6240;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x590D;&#x5236;&#x8FD9;&#x4E2A;&#x539F;&#x578B;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x51FA;&#x66F4;&#x591A;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x6A21;&#x5F0F;&#x5141;&#x8BB8;&#x52A8;&#x6001;&#x7684;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x5C11;&#x4EA7;&#x54C1;&#x7C7B;&#xFF0C;&#x4EA7;&#x54C1;&#x7C7B;&#x4E0D;&#x9700;&#x8981;&#x975E;&#x5F97;&#x6709;&#x4EFB;&#x4F55;&#x4E8B;&#x5148;&#x786E;&#x5B9A;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x539F;&#x59CB;&#x6A21;&#x578B;&#x6A21;&#x5F0F;&#x9002;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x3002;&#x7F3A;&#x70B9;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x914D;&#x5907;&#x4E00;&#x4E2A;&#x514B;&#x9686;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF08;Singleton&#xFF09;<br>&#x4FFA;&#x6709;6&#x4E2A;&#x6F02;&#x4EAE;&#x7684;&#x8001;&#x5A46;&#xFF0C;&#x5979;&#x4EEC;&#x7684;&#x8001;&#x516C;&#x90FD;&#x662F;&#x6211;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5BB6;&#x91CC;&#x7684;&#x8001;&#x516C;Sigleton&#xFF0C;&#x5979;&#x4EEC;&#x53EA;&#x8981;&#x8BF4;&#x9053;&#x201C;&#x8001;&#x516C;&#x201D;&#xFF0C;&#x90FD;&#x662F;&#x6307;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6211;(&#x521A;&#x624D;&#x505A;&#x4E86;&#x4E2A;&#x68A6;&#x5566;&#xFF0C;&#x54EA;&#x6709;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#x4E8B;)</p>
<blockquote>
<p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF1A;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x786E;&#x4FDD;&#x67D0;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E14;&#x81EA;&#x884C;&#x5B9E;&#x4F8B;&#x5316;&#x5E76;&#x5411;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x5B9E;&#x4F8B;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x53EA;&#x5E94;&#x5728;&#x6709;&#x771F;&#x6B63;&#x7684;&#x201C;&#x5355;&#x4E00;&#x5B9E;&#x4F8B;&#x201D;&#x7684;&#x9700;&#x6C42;&#x65F6;&#x624D;&#x53EF;&#x4F7F;&#x7528;&#x3002;</p>
</blockquote>
</li>
</ul>
<a id="more"></a>
<h2 id="&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;"></a>&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;</h2><ul>
<li><p>&#x9002;&#x914D;&#x5668;(&#x53D8;&#x538B;&#x5668;)&#x6A21;&#x5F0F;&#xFF08;Adapter&#xFF09;<br>&#x5728;&#x670B;&#x53CB;&#x805A;&#x4F1A;&#x4E0A;&#x78B0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7F8E;&#x5973;Sarah&#xFF0C;&#x4ECE;&#x9999;&#x6E2F;&#x6765;&#x7684;&#xFF0C;&#x53EF;&#x6211;&#x4E0D;&#x4F1A;&#x8BF4;&#x7CA4;&#x8BED;&#xFF0C;&#x5979;&#x4E0D;&#x4F1A;&#x8BF4;&#x666E;&#x901A;&#x8BDD;&#xFF0C;&#x53EA;&#x597D;&#x6C42;&#x52A9;&#x4E8E;&#x6211;&#x7684;&#x670B;&#x53CB;kent&#x4E86;&#xFF0C;&#x4ED6;&#x4F5C;&#x4E3A;&#x6211;&#x548C;Sarah&#x4E4B;&#x95F4;&#x7684;Adapter&#xFF0C;&#x8BA9;&#x6211;&#x548C;Sarah&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x4EA4;&#x8C08;&#x4E86;(&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x4F1A;&#x4E0D;&#x4F1A;&#x800D;&#x6211;)</p>
<blockquote>
<p>&#x9002;&#x914D;&#x5668;(&#x53D8;&#x538B;&#x5668;)&#x6A21;&#x5F0F;&#xFF1A;&#x628A;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x53D8;&#x6362;&#x6210;&#x5BA2;&#x6237;&#x7AEF;&#x6240;&#x671F;&#x5F85;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x539F;&#x672C;&#x56E0;&#x63A5;&#x53E3;&#x539F;&#x56E0;&#x4E0D;&#x5339;&#x914D;&#x800C;&#x65E0;&#x6CD5;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x7684;&#x4E24;&#x4E2A;&#x7C7B;&#x80FD;&#x591F;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;&#x9002;&#x914D;&#x7C7B;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x53C2;&#x6570;&#x8FD4;&#x8FD8;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x5B9E;&#x4F8B;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x6865;&#x63A5;(&#x6865;&#x6881;)&#x6A21;&#x5F0F;&#xFF08;Bridge&#xFF09;<br>&#x65E9;&#x4E0A;&#x78B0;&#x5230;MM&#xFF0C;&#x8981;&#x8BF4;&#x65E9;&#x4E0A;&#x597D;&#xFF0C;&#x665A;&#x4E0A;&#x78B0;&#x5230;MM&#xFF0C;&#x8981;&#x8BF4;&#x665A;&#x4E0A;&#x597D;&#xFF1B;&#x78B0;&#x5230;MM&#x7A7F;&#x4E86;&#x4EF6;&#x65B0;&#x8863;&#x670D;&#xFF0C;&#x8981;&#x8BF4;&#x4F60;&#x7684;&#x8863;&#x670D;&#x597D;&#x6F02;&#x4EAE;&#x54E6;&#xFF0C;&#x78B0;&#x5230;MM&#x65B0;&#x505A;&#x7684;&#x53D1;&#x578B;&#xFF0C;&#x8981;&#x8BF4;&#x4F60;&#x7684;&#x5934;&#x53D1;&#x597D;&#x6F02;&#x4EAE;&#x54E6;&#x3002;&#x4E0D;&#x8981;&#x95EE;&#x6211;&#x201C;&#x65E9;&#x4E0A;&#x78B0;&#x5230;MM&#x65B0;&#x505A;&#x4E86;&#x4E2A;&#x53D1;&#x578B;&#x600E;&#x4E48;&#x8BF4;&#x201D;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x5DF1;&#x7528;BRIDGE&#x7EC4;&#x5408;&#x4E00;&#x4E0B;&#x4E0D;&#x5C31;&#x884C;&#x4E86;</p>
<blockquote>
<p>&#x6865;&#x63A5;(&#x6865;&#x6881;)&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x62BD;&#x8C61;&#x5316;&#x4E0E;&#x5B9E;&#x73B0;&#x5316;&#x8131;&#x8026;&#xFF0C;&#x4F7F;&#x5F97;&#x4E8C;&#x8005;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5C06;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5F3A;&#x5173;&#x8054;&#x53D8;&#x6210;&#x5F31;&#x5173;&#x8054;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6307;&#x5728;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x5316;&#x548C;&#x5B9E;&#x73B0;&#x5316;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x7EC4;&#x5408;/&#x805A;&#x5408;&#x5173;&#x7CFB;&#x800C;&#x4E0D;&#x662F;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4E24;&#x8005;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x6DF7;&#x5408;(&#x5408;&#x6210;)&#x6A21;&#x5F0F;&#xFF08;Composite&#xFF09;<br>Mary&#x4ECA;&#x5929;&#x8FC7;&#x751F;&#x65E5;&#x3002;<br>&#x201C;&#x6211;&#x8FC7;&#x751F;&#x65E5;&#xFF0C;&#x4F60;&#x8981;&#x9001;&#x6211;&#x4E00;&#x4EF6;&#x793C;&#x7269;&#x3002;&#x201D;<br>&#x201C;&#x55EF;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x53BB;&#x5546;&#x5E97;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x6311;&#x3002;&#x201D;<br>&#x201C;&#x8FD9;&#x4EF6;T&#x6064;&#x633A;&#x6F02;&#x4EAE;&#xFF0C;&#x4E70;&#xFF0C;&#x8FD9;&#x6761;&#x88D9;&#x5B50;&#x597D;&#x770B;&#xFF0C;&#x4E70;&#xFF0C;&#x8FD9;&#x4E2A;&#x5305;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x4E70;&#x3002;&#x201D;<br>&#x201C;&#x5582;&#xFF0C;&#x4E70;&#x4E86;&#x4E09;&#x4EF6;&#x4E86;&#x5440;&#xFF0C;&#x6211;&#x53EA;&#x7B54;&#x5E94;&#x9001;&#x4E00;&#x4EF6;&#x793C;&#x7269;&#x7684;&#x54E6;&#x3002;&#x201D;<br>&#x201C;&#x4EC0;&#x4E48;&#x5440;&#xFF0C;T&#x6064;&#x52A0;&#x88D9;&#x5B50;&#x52A0;&#x5305;&#x5305;&#xFF0C;&#x6B63;&#x597D;&#x914D;&#x6210;&#x4E00;&#x5957;&#x5440;&#xFF0C;&#x5C0F;&#x59D0;&#xFF0C;&#x9EBB;&#x70E6;&#x4F60;&#x5305;&#x8D77;&#x6765;&#x3002; &#x201D;<br>&#x201C;&#x2026;&#x2026;&#x201D;&#xFF0C;MM&#x90FD;&#x4F1A;&#x7528;Composite&#x6A21;&#x5F0F;&#x4E86;&#xFF0C;&#x4F60;&#x4F1A;&#x4E86;&#x6CA1;&#x6709;&#xFF1F;</p>
<blockquote>
<p>&#x6DF7;&#x5408;(&#x5408;&#x6210;)&#x6A21;&#x5F0F;&#xFF1A;&#x5408;&#x6210;&#x6A21;&#x5F0F;&#x5C06;&#x5BF9;&#x8C61;&#x7EC4;&#x7EC7;&#x5230;&#x6811;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6574;&#x4F53;&#x4E0E;&#x90E8;&#x5206;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5408;&#x6210;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x5408;&#x6210;&#x6A21;&#x5F0F;&#x628A;&#x90E8;&#x5206;&#x4E0E;&#x6574;&#x4F53;&#x7684;&#x5173;&#x7CFB;&#x7528;&#x6811;&#x7ED3;&#x6784;&#x8868;&#x793A;&#x51FA;&#x6765;&#x3002;&#x5408;&#x6210;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x5BA2;&#x6237;&#x7AEF;&#x628A;&#x4E00;&#x4E2A;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6210;&#x5206;&#x5BF9;&#x8C61;&#x548C;&#x7531;&#x4ED6;&#x4EEC;&#x590D;&#x5408;&#x800C;&#x6210;&#x7684;&#x5408;&#x6210;&#x5BF9;&#x8C61;&#x540C;&#x7B49;&#x770B;&#x5F85;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#xFF08;Decorator&#xFF09;<br>Mary&#x8FC7;&#x5B8C;&#x8F6E;&#x5230;Sarly&#x8FC7;&#x751F;&#x65E5;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x8981;&#x53EB;&#x5979;&#x81EA;&#x5DF1;&#x6311;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#x8FD9;&#x4E2A;&#x6708;&#x4F19;&#x98DF;&#x8D39;&#x80AF;&#x5B9A;&#x73A9;&#x5B8C;&#xFF0C;&#x62FF;&#x51FA;&#x6211;2008&#x5E74;&#x5728;&#x534E;&#x5C71;&#x9876;&#x4E0A;&#x7167;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x5728;&#x80CC;&#x9762;&#x5199;&#x4E0A;&#x201C;&#x6700;&#x597D;&#x7684;&#x7684;&#x793C;&#x7269;&#xFF0C;&#x5C31;&#x662F;&#x7231;&#x4F60;&#x7684;Fita&#x201D;&#xFF0C;&#x518D;&#x5230;&#x8857;&#x4E0A;&#x793C;&#x54C1;&#x5E97;&#x4E70;&#x4E86;&#x4E2A;&#x50CF;&#x6846;&#xFF08;&#x5356;&#x793C;&#x54C1;&#x7684;MM&#x4E5F;&#x5F88;&#x6F02;&#x4EAE;&#x54E6;&#xFF09;&#xFF0C;&#x518D;&#x627E;&#x9694;&#x58C1;&#x641E;&#x7F8E;&#x672F;&#x8BBE;&#x8BA1;&#x7684;Mike&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x6F02;&#x4EAE;&#x7684;&#x76D2;&#x5B50;&#x88C5;&#x8D77;&#x6765;&#x2026;&#x2026;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;Decorator&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x5728;&#x4FEE;&#x9970;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x5440;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x770B;&#x61C2;&#x4E86;&#x5417;&#xFF1F;</p>
<blockquote>
<p>&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#xFF1A;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#x4EE5;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x900F;&#x660E;&#x7684;&#x65B9;&#x5F0F;&#x6269;&#x5C55;&#x5BF9;&#x8C61;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x662F;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x7684;&#x4E00;&#x4E2A;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF0C;&#x63D0;&#x4F9B;&#x6BD4;&#x7EE7;&#x627F;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x52A8;&#x6001;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x589E;&#x52A0;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x518D;&#x52A8;&#x6001;&#x7684;&#x64A4;&#x6D88;&#x3002;&#x589E;&#x52A0;&#x7531;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x7684;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x975E;&#x5E38;&#x5927;&#x91CF;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x95E8;&#x9762;(&#x5916;&#x89C2;)&#x6A21;&#x5F0F;&#xFF08;Facade)<br>&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x4E13;&#x4E1A;&#x7684;Nikon&#x76F8;&#x673A;&#xFF0C;&#x6211;&#x5C31;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x624B;&#x52A8;&#x8C03;&#x5149;&#x5708;&#x3001;&#x5FEB;&#x95E8;&#xFF0C;&#x8FD9;&#x6837;&#x7167;&#x51FA;&#x6765;&#x7684;&#x7167;&#x7247;&#x624D;&#x4E13;&#x4E1A;&#xFF0C;&#x4F46;MM&#x53EF;&#x4E0D;&#x61C2;&#x8FD9;&#x4E9B;&#xFF0C;&#x6559;&#x4E86;&#x534A;&#x5929;&#x4E5F;&#x4E0D;&#x4F1A;&#x3002;&#x5E78;&#x597D;&#x76F8;&#x673A;&#x6709;Facade&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x628A;&#x76F8;&#x673A;&#x8C03;&#x6574;&#x5230;&#x81EA;&#x52A8;&#x6863;&#xFF0C;&#x53EA;&#x8981;&#x5BF9;&#x51C6;&#x76EE;&#x6807;&#x6309;&#x5FEB;&#x95E8;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4E00;&#x5207;&#x7531;&#x76F8;&#x673A;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#xFF0C;&#x8FD9;&#x6837;MM&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x76F8;&#x673A;&#x7ED9;&#x6211;&#x62CD;&#x5F20;&#x7167;&#x7247;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x95E8;&#x9762;(&#x5916;&#x89C2;)&#x6A21;&#x5F0F;&#xFF1A;&#x5916;&#x90E8;&#x4E0E;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x901A;&#x4FE1;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x95E8;&#x9762;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x3002;&#x95E8;&#x9762;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x5F97;&#x5B50;&#x7CFB;&#x7EDF;&#x66F4;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x95E8;&#x9762;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x6B64;&#x95E8;&#x9762;&#x7C7B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;&#x4F46;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x95E8;&#x9762;&#x7C7B;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#xFF08;Flyweight&#xFF09;<br>&#x6BCF;&#x5929;&#x8DDF;MM&#x53D1;&#x77ED;&#x4FE1;&#xFF0C;&#x624B;&#x6307;&#x90FD;&#x7D2F;&#x6B7B;&#x4E86;&#xFF0C;&#x6700;2009&#x5E74;&#x4E70;&#x4E86;&#x4E2A;&#x65B0;&#x624B;&#x673A;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x53E5;&#x5B50;&#x5B58;&#x5728;&#x624B;&#x673A;&#x91CC;&#xFF0C;&#x8981;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x76F4;&#x63A5;&#x62FF;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x524D;&#x9762;&#x52A0;&#x4E0A;MM&#x7684;&#x540D;&#x5B57;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x4E86;&#xFF0C;&#x518D;&#x4E0D;&#x7528;&#x4E00;&#x4E2A;&#x5B57;&#x4E00;&#x4E2A;&#x5B57;&#x6572;&#x4E86;&#x3002;&#x5171;&#x4EAB;&#x7684;&#x53E5;&#x5B50;&#x5C31;&#x662F;Flyweight&#xFF0C;MM&#x7684;&#x540D;&#x5B57;&#x5C31;&#x662F;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x5916;&#x90E8;&#x7279;&#x5F81;&#xFF0C;&#x6839;&#x636E;&#x4E0A;&#x4E0B;&#x6587;&#x60C5;&#x51B5;&#x4F7F;&#x7528;&#x3002;</p>
<blockquote>
<p>&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#xFF1A;FLYWEIGHT&#x5728;&#x62F3;&#x51FB;&#x6BD4;&#x8D5B;&#x4E2D;&#x6307;&#x6700;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x4EE5;&#x5171;&#x4EAB;&#x7684;&#x65B9;&#x5F0F;&#x9AD8;&#x6548;&#x7684;&#x652F;&#x6301;&#x5927;&#x91CF;&#x7684;&#x7EC6;&#x7C92;&#x5EA6;&#x5BF9;&#x8C61;&#x3002;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x80FD;&#x505A;&#x5230;&#x5171;&#x4EAB;&#x7684;&#x5173;&#x952E;&#x662F;&#x533A;&#x5206;&#x5185;&#x8574;&#x72B6;&#x6001;&#x548C;&#x5916;&#x8574;&#x72B6;&#x6001;&#x3002;&#x5185;&#x8574;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728;&#x4EAB;&#x5143;&#x5185;&#x90E8;&#xFF0C;&#x4E0D;&#x4F1A;&#x968F;&#x73AF;&#x5883;&#x7684;&#x6539;&#x53D8;&#x800C;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x5916;&#x8574;&#x72B6;&#x6001;&#x662F;&#x968F;&#x73AF;&#x5883;&#x7684;&#x6539;&#x53D8;&#x800C;&#x6539;&#x53D8;&#x7684;&#x3002;&#x5916;&#x8574;&#x72B6;&#x6001;&#x4E0D;&#x80FD;&#x5F71;&#x54CD;&#x5185;&#x8574;&#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x5C06;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x7684;&#x72B6;&#x6001;&#x548C;&#x4E0D;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x5E38;&#x89C4;&#x7C7B;&#x4E2D;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x5C06;&#x4E0D;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x7C7B;&#x91CC;&#x5254;&#x9664;&#x51FA;&#x53BB;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x88AB;&#x5171;&#x4EAB;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5E94;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5DE5;&#x5382;&#x5BF9;&#x8C61;&#x8D1F;&#x8D23;&#x521B;&#x5EFA;&#x88AB;&#x5171;&#x4EAB;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x964D;&#x4F4E;&#x5185;&#x5B58;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF08;Proxy&#xFF09;<br>&#x8DDF;MM&#x5728;&#x7F51;&#x4E0A;&#x804A;&#x5929;&#xFF0C;&#x4E00;&#x5F00;&#x5934;&#x603B;&#x662F;&#x201C;hi,&#x4F60;&#x597D;&#x201D;,&#x201C;&#x4F60;&#x4ECE;&#x54EA;&#x513F;&#x6765;&#x5440;&#xFF1F;&#x201D;&#x201C;&#x4F60;&#x591A;&#x5927;&#x4E86;&#xFF1F;&#x201D;&#x201C;&#x8EAB;&#x9AD8;&#x591A;&#x5C11;&#x5440;&#xFF1F;&#x201D;&#x8FD9;&#x4E9B;&#x8BDD;&#xFF0C;&#x771F;&#x70E6;&#x4EBA;&#xFF0C;&#x5199;&#x4E2A;&#x7A0B;&#x5E8F;&#x505A;&#x4E3A;&#x6211;&#x7684;Proxy&#x5427;&#xFF0C;&#x51E1;&#x662F;&#x63A5;&#x6536;&#x5230;&#x8FD9;&#x4E9B;&#x8BDD;&#x90FD;&#x8BBE;&#x7F6E;&#x597D;&#x4E86;&#x81EA;&#x52A8;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x63A5;&#x6536;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x8BDD;&#x65F6;&#x518D;&#x901A;&#x77E5;&#x6211;&#x56DE;&#x7B54;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x9177;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF1A;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x7ED9;&#x67D0;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x7531;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x63A7;&#x5236;&#x5BF9;&#x6E90;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;&#x4EE3;&#x7406;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x6216;&#x4E00;&#x4E2A;&#x673A;&#x6784;&#x4EE3;&#x8868;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x673A;&#x6784;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#x3002;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BA2;&#x6237;&#x4E0D;&#x60F3;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x5728;&#x5BA2;&#x6237;&#x548C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x8D77;&#x5230;&#x4E2D;&#x4ECB;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5206;&#x8FA8;&#x4E0D;&#x51FA;&#x4EE3;&#x7406;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x4E0E;&#x771F;&#x5B9E;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x3002;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x771F;&#x6B63;&#x7684;&#x88AB;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x6301;&#x6709;&#x4E00;&#x4E2A;&#x88AB;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x4E0D;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x88AB;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#xFF0C;&#x88AB;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4ED6;&#x89D2;&#x8272;&#x4EE3;&#x4E3A;&#x521B;&#x5EFA;&#x5E76;&#x4F20;&#x5165;&#x3002;</p>
</blockquote>
</li>
</ul>
<h2 id="&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;"><a href="#&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;" class="headerlink" title="&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;"></a>&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;</h2><ul>
<li><p>&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#xFF08;Chain of Responsibility&#xFF09;<br>&#x665A;&#x4E0A;&#x53BB;&#x4E0A;&#x82F1;&#x8BED;&#x8BFE;&#xFF0C;&#x4E3A;&#x4E86;&#x597D;&#x5F00;&#x6E9C;&#x5750;&#x5230;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x6392;&#xFF0C;&#x54C7;&#xFF0C;&#x524D;&#x9762;&#x5750;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x6F02;&#x4EAE;&#x7684;MM&#x54CE;&#xFF0C;&#x627E;&#x5F20;&#x7EB8;&#x6761;&#xFF0C;&#x5199;&#x4E0A;&#x201C;Hi&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x6211;&#x7684;&#x5973;&#x670B;&#x53CB;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x613F;&#x610F;&#x8BF7;&#x5411;&#x524D;&#x4F20;&#x201D;&#xFF0C;&#x7EB8;&#x6761;&#x5C31;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x7684;&#x4F20;&#x4E0A;&#x53BB;&#x4E86;&#xFF0C;&#x7CDF;&#x7CD5;&#xFF0C;&#x4F20;&#x5230;&#x7B2C;&#x4E00;&#x6392;&#x7684;MM&#x628A;&#x7EB8;&#x6761;&#x4F20;&#x7ED9;&#x8001;&#x5E08;&#x4E86;&#xFF0C;&#x542C;&#x8BF4;&#x662F;&#x4E2A;&#x8001;&#x5904;&#x5973;&#x5440;&#xFF0C;&#x5FEB;&#x8DD1;!</p>
<blockquote>
<p>&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#xFF1A;&#x5728;&#x8D23;&#x4EFB;&#x94FE;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x7531;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5BF9;&#x5176;&#x4E0B;&#x5BB6;&#x7684;&#x5F15;&#x7528;&#x800C;&#x63A5;&#x8D77;&#x6765;&#x5F62;&#x6210;&#x4E00;&#x6761;&#x94FE;&#x3002;&#x8BF7;&#x6C42;&#x5728;&#x8FD9;&#x4E2A;&#x94FE;&#x4E0A;&#x4F20;&#x9012;&#xFF0C;&#x76F4;&#x5230;&#x94FE;&#x4E0A;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x51B3;&#x5B9A;&#x5904;&#x7406;&#x6B64;&#x8BF7;&#x6C42;&#x3002;&#x5BA2;&#x6237;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x94FE;&#x4E0A;&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6700;&#x7EC8;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x52A8;&#x6001;&#x7684;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x94FE;&#x548C;&#x5206;&#x914D;&#x8D23;&#x4EFB;&#x3002;&#x5904;&#x7406;&#x8005;&#x6709;&#x4E24;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#x6216;&#x8005;&#x628A;&#x8D23;&#x4EFB;&#x63A8;&#x7ED9;&#x4E0B;&#x5BB6;&#x3002;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x6700;&#x7EC8;&#x4E0D;&#x88AB;&#x4EFB;&#x4F55;&#x63A5;&#x6536;&#x7AEF;&#x5BF9;&#x8C61;&#x6240;&#x63A5;&#x53D7;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#xFF08;Command&#xFF09;<br>&#x6211;&#x6709;&#x4E00;&#x4E2A;MM&#x5BB6;&#x91CC;&#x7BA1;&#x5F97;&#x7279;&#x522B;&#x4E25;&#xFF0C;&#x6CA1;&#x6CD5;&#x89C1;&#x9762;&#xFF0C;&#x53EA;&#x597D;&#x501F;&#x52A9;&#x4E8E;&#x5979;&#x5F1F;&#x5F1F;&#x5728;&#x6211;&#x4EEC;&#x4FE9;&#x4E4B;&#x95F4;&#x4F20;&#x9001;&#x4FE1;&#x606F;&#xFF0C;&#x5979;&#x5BF9;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x6307;&#x793A;&#xFF0C;&#x5C31;&#x5199;&#x4E00;&#x5F20;&#x7EB8;&#x6761;&#x8BA9;&#x5979;&#x5F1F;&#x5F1F;&#x5E26;&#x7ED9;&#x6211;&#x3002;&#x8FD9;&#x4E0D;&#xFF0C;&#x5979;&#x5F1F;&#x5F1F;&#x53C8;&#x4F20;&#x9001;&#x8FC7;&#x6765;&#x4E00;&#x4E2A;COMMAND&#xFF0C;&#x4E3A;&#x4E86;&#x611F;&#x8C22;&#x4ED6;&#xFF0C;&#x6211;&#x8BF7;&#x4ED6;&#x5403;&#x4E86;&#x7897;&#x6742;&#x9171;&#x9762;&#xFF0C;&#x54EA;&#x77E5;&#x9053;&#x4ED6;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x540C;&#x65F6;&#x7ED9;&#x6211;&#x59D0;&#x59D0;&#x4E09;&#x4E2A;&#x7537;&#x670B;&#x53CB;&#x9001;COMMAND&#xFF0C;&#x5C31;&#x6570;&#x4F60;&#x6700;&#x5C0F;&#x6C14;&#xFF0C;&#x624D;&#x8BF7;&#x6211;&#x5403;&#x9762;&#x3002;&#x201D;</p>
<blockquote>
<p>&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#xFF1A;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x628A;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x6216;&#x8005;&#x64CD;&#x4F5C;&#x5C01;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x628A;&#x53D1;&#x51FA;&#x547D;&#x4EE4;&#x7684;&#x8D23;&#x4EFB;&#x548C;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x7684;&#x8D23;&#x4EFB;&#x5206;&#x5272;&#x5F00;&#xFF0C;&#x59D4;&#x6D3E;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x5141;&#x8BB8;&#x8BF7;&#x6C42;&#x7684;&#x4E00;&#x65B9;&#x548C;&#x53D1;&#x9001;&#x7684;&#x4E00;&#x65B9;&#x72EC;&#x7ACB;&#x5F00;&#x6765;&#xFF0C;&#x4F7F;&#x5F97;&#x8BF7;&#x6C42;&#x7684;&#x4E00;&#x65B9;&#x4E0D;&#x5FC5;&#x77E5;&#x9053;&#x63A5;&#x6536;&#x8BF7;&#x6C42;&#x7684;&#x4E00;&#x65B9;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x66F4;&#x4E0D;&#x5FC5;&#x77E5;&#x9053;&#x8BF7;&#x6C42;&#x662F;&#x600E;&#x4E48;&#x88AB;&#x63A5;&#x6536;&#xFF0C;&#x4EE5;&#x53CA;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x6267;&#x884C;&#xFF0C;&#x4F55;&#x65F6;&#x88AB;&#x6267;&#x884C;&#x4EE5;&#x53CA;&#x662F;&#x600E;&#x4E48;&#x88AB;&#x6267;&#x884C;&#x7684;&#x3002;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#x547D;&#x4EE4;&#x7684;&#x64A4;&#x6D88;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x89E3;&#x6790;&#x5668;&#x6A21;&#x5F0F;&#xFF08;Interpreter&#xFF09;<br>&#x4FFA;&#x6709;&#x4E00;&#x4E2A;&#x300A;&#x6CE1;MM&#x771F;&#x7ECF;&#x300B;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x5404;&#x79CD;&#x6CE1;MM&#x7684;&#x653B;&#x7565;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x53BB;&#x5403;&#x897F;&#x9910;&#x7684;&#x6B65;&#x9AA4;&#x3001;&#x53BB;&#x770B;&#x7535;&#x5F71;&#x7684;&#x65B9;&#x6CD5;&#x7B49;&#x7B49;&#xFF0C;&#x8DDF;MM&#x7EA6;&#x4F1A;&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x505A;&#x4E00;&#x4E2A;Interpreter&#xFF0C;&#x7167;&#x7740;&#x4E0A;&#x9762;&#x7684;&#x811A;&#x672C;&#x6267;&#x884C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x540E;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x51FA;&#x5176;&#x6587;&#x6CD5;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x53E5;&#x5B50;&#x3002;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x5C06;&#x63CF;&#x8FF0;&#x600E;&#x6837;&#x5728;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6587;&#x6CD5;&#x540E;&#xFF0C;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x8BBE;&#x8BA1;&#x89E3;&#x91CA;&#x8FD9;&#x4E9B;&#x8BED;&#x53E5;&#x3002;&#x5728;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x91CC;&#x9762;&#x63D0;&#x5230;&#x7684;&#x8BED;&#x8A00;&#x662F;&#x6307;&#x4EFB;&#x4F55;&#x89E3;&#x91CA;&#x5668;&#x5BF9;&#x8C61;&#x80FD;&#x591F;&#x89E3;&#x91CA;&#x7684;&#x4EFB;&#x4F55;&#x7EC4;&#x5408;&#x3002;&#x5728;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#x4E2D;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x6587;&#x6CD5;&#x7684;&#x547D;&#x4EE4;&#x7C7B;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7EC4;&#x5408;&#x89C4;&#x5219;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE3;&#x8868;&#x5BF9;&#x547D;&#x4EE4;&#x5BF9;&#x8C61;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x547D;&#x4EE4;&#x5BF9;&#x8C61;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x4F55;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#xFF08;Iterator&#xFF09;<br>&#x6211;&#x7231;&#x4E0A;&#x4E86;Mary&#xFF0C;&#x4E0D;&#x987E;&#x4E00;&#x5207;&#x7684;&#x5411;&#x5979;&#x6C42;&#x5A5A;&#x3002;<br>Mary&#xFF1A;&#x201C;&#x60F3;&#x8981;&#x6211;&#x8DDF;&#x4F60;&#x7ED3;&#x5A5A;&#xFF0C;&#x5F97;&#x7B54;&#x5E94;&#x6211;&#x7684;&#x6761;&#x4EF6;&#x201D;<br>&#x6211;&#xFF1A;&#x201C;&#x4EC0;&#x4E48;&#x6761;&#x4EF6;&#x6211;&#x90FD;&#x7B54;&#x5E94;&#xFF0C;&#x4F60;&#x8BF4;&#x5427;&#x201D;<br>Mary&#xFF1A;&#x201C;&#x6211;&#x770B;&#x4E0A;&#x4E86;&#x90A3;&#x4E2A;&#x4E00;&#x514B;&#x62C9;&#x7684;&#x94BB;&#x77F3;&#x201D;<br>&#x6211;&#xFF1A;&#x201C;&#x6211;&#x4E70;&#xFF0C;&#x6211;&#x4E70;&#xFF0C;&#x8FD8;&#x6709;&#x5417;&#xFF1F;&#x201D;<br>Mary&#xFF1A;&#x201C;&#x6211;&#x770B;&#x4E0A;&#x4E86;&#x6E56;&#x8FB9;&#x7684;&#x90A3;&#x680B;&#x522B;&#x5885;&#x201D;<br>&#x6211;&#xFF1A;&#x201C;&#x6211;&#x4E70;&#xFF0C;&#x6211;&#x4E70;&#xFF0C;&#x8FD8;&#x6709;&#x5417;&#xFF1F;&#x201D;<br>Mary&#xFF1A;&#x201C;&#x6211;&#x770B;&#x4E0A;&#x90A3;&#x8F86;&#x6CD5;&#x62C9;&#x5229;&#x8DD1;&#x8F66;&#x201D;<br>&#x6211;&#x8111;&#x888B;&#x55E1;&#x7684;&#x4E00;&#x58F0;&#xFF0C;&#x5750;&#x5728;&#x6905;&#x5B50;&#x4E0A;&#xFF0C;&#x4E00;&#x54AC;&#x7259;&#xFF1A;&#x201C;&#x6211;&#x4E70;&#xFF0C;&#x6211;&#x4E70;&#xFF0C;&#x8FD8;&#x6709;&#x5417;&#xFF1F;&#x201D;</p>
<blockquote>
<p>&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x805A;&#x96C6;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x800C;&#x4E0D;&#x5FC5;&#x66B4;&#x9732;&#x805A;&#x96C6;&#x7684;&#x5185;&#x90E8;&#x8868;&#x8C61;&#x3002;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x7684;&#x603B;&#x4F53;&#x79F0;&#x4E4B;&#x4E3A;&#x805A;&#x96C6;&#xFF0C;&#x805A;&#x96C6;&#x5BF9;&#x8C61;&#x662F;&#x80FD;&#x591F;&#x5305;&#x5BB9;&#x4E00;&#x7EC4;&#x5BF9;&#x8C61;&#x7684;&#x5BB9;&#x5668;&#x5BF9;&#x8C61;&#x3002;&#x8FED;&#x4EE3;&#x5B50;&#x6A21;&#x5F0F;&#x5C06;&#x8FED;&#x4EE3;&#x903B;&#x8F91;&#x5C01;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5B50;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4E0E;&#x805A;&#x96C6;&#x672C;&#x8EAB;&#x9694;&#x5F00;&#x3002;&#x8FED;&#x4EE3;&#x5B50;&#x6A21;&#x5F0F;&#x7B80;&#x5316;&#x4E86;&#x805A;&#x96C6;&#x7684;&#x754C;&#x9762;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x805A;&#x96C6;&#x5BF9;&#x8C61;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x8FED;&#x4EE3;&#x5B50;&#x5BF9;&#x8C61;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5B50;&#x7684;&#x8FED;&#x4EE3;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x662F;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x8FED;&#x4EE3;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x805A;&#x96C6;&#x89D2;&#x8272;&#x53D8;&#x5316;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4E2D;&#x4ECB;(&#x8C03;&#x505C;&#x8005;)&#x6A21;&#x5F0F;&#xFF08;Mediator&#xFF09;<br>&#x56DB;&#x4E2A;MM&#x6253;&#x9EBB;&#x5C06;&#xFF0C;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x8C01;&#x5E94;&#x8BE5;&#x7ED9;&#x8C01;&#x591A;&#x5C11;&#x94B1;&#x7B97;&#x4E0D;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x5E78;&#x4E8F;&#x5F53;&#x65F6;&#x6211;&#x5728;&#x65C1;&#x8FB9;&#xFF0C;&#x6309;&#x7167;&#x5404;&#x81EA;&#x7684;&#x7B79;&#x7801;&#x6570;&#x7B97;&#x94B1;&#xFF0C;&#x8D5A;&#x4E86;&#x94B1;&#x7684;&#x4ECE;&#x6211;&#x8FD9;&#x91CC;&#x62FF;&#xFF0C;&#x8D54;&#x4E86;&#x94B1;&#x7684;&#x4E5F;&#x4ED8;&#x7ED9;&#x6211;&#xFF0C;&#x4E00;&#x5207;&#x5C31;OK&#x5566;&#xFF0C;&#x4FFA;&#x5F97;&#x5230;&#x4E86;&#x56DB;&#x4E2A;MM&#x7684;&#x7535;&#x8BDD;&#x3002;</p>
<blockquote>
<p>&#x4E2D;&#x4ECB;(&#x8C03;&#x505C;&#x8005;)&#x6A21;&#x5F0F;&#xFF1A;&#x8C03;&#x505C;&#x8005;&#x6A21;&#x5F0F;&#x5305;&#x88C5;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5BF9;&#x8C61;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x4E0D;&#x5FC5;&#x76F8;&#x4E92;&#x660E;&#x663E;&#x4F5C;&#x7528;&#x3002;&#x4ECE;&#x800C;&#x4F7F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x677E;&#x6563;&#x5076;&#x5408;&#x3002;&#x5F53;&#x67D0;&#x4E9B;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4F5C;&#x7528;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E9B;&#x4F5C;&#x7528;&#x53EF;&#x4EE5;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#x7684;&#x53D8;&#x5316;&#x3002;&#x8C03;&#x505C;&#x8005;&#x6A21;&#x5F0F;&#x5C06;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x8C03;&#x505C;&#x8005;&#x6A21;&#x5F0F;&#x5C06;&#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x534F;&#x4F5C;&#x62BD;&#x8C61;&#x5316;&#xFF0C;&#x628A;&#x5BF9;&#x8C61;&#x5728;&#x5C0F;&#x5C3A;&#x5EA6;&#x7684;&#x884C;&#x4E3A;&#x4E0A;&#x4E0E;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5206;&#x5F00;&#x5904;&#x7406;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#xFF08;Memento&#xFF09;<br>&#x540C;&#x65F6;&#x8DDF;&#x51E0;&#x4E2A;MM&#x804A;&#x5929;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8BB0;&#x6E05;&#x695A;&#x521A;&#x624D;&#x8DDF;MM&#x8BF4;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#x8BDD;&#xFF0C;&#x4E0D;&#x7136;MM&#x53D1;&#x73B0;&#x4E86;&#x4F1A;&#x4E0D;&#x9AD8;&#x5174;&#x7684;&#x54E6;&#xFF0C;&#x5E78;&#x4E8F;&#x6211;&#x6709;&#x4E2A;&#x5907;&#x5FD8;&#x5F55;&#xFF0C;&#x521A;&#x624D;&#x4E0E;&#x54EA;&#x4E2A;MM&#x8BF4;&#x4E86;&#x4EC0;&#x4E48;&#x8BDD;&#x6211;&#x90FD;&#x62F7;&#x8D1D;&#x4E00;&#x4EFD;&#x653E;&#x5230;&#x5907;&#x5FD8;&#x5F55;&#x91CC;&#x9762;&#x4FDD;&#x5B58;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x5BDF;&#x770B;&#x4EE5;&#x524D;&#x7684;&#x8BB0;&#x5F55;&#x5566;&#x3002;</p>
<blockquote>
<p>&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#xFF1A;&#x5907;&#x5FD8;&#x5F55;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x7684;&#x5FEB;&#x7167;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;&#x662F;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x5C01;&#x88C5;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x6349;&#x4F4F;&#xFF0C;&#x5E76;&#x5916;&#x90E8;&#x5316;&#xFF0C;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5728;&#x5C06;&#x6765;&#x5408;&#x9002;&#x7684;&#x65F6;&#x5019;&#x628A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x8FD8;&#x539F;&#x5230;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Observer)<br>&#x60F3;&#x77E5;&#x9053;&#x54B1;&#x4EEC;&#x516C;&#x53F8;&#x6700;&#x65B0;MM&#x60C5;&#x62A5;&#x5417;&#xFF1F;&#x52A0;&#x5165;&#x516C;&#x53F8;&#x7684;MM&#x60C5;&#x62A5;&#x90AE;&#x4EF6;&#x7EC4;&#x5C31;&#x884C;&#x4E86;&#xFF0C;tom&#x8D1F;&#x8D23;&#x641C;&#x96C6;&#x60C5;&#x62A5;&#xFF0C;&#x4ED6;&#x53D1;&#x73B0;&#x7684;&#x65B0;&#x60C5;&#x62A5;&#x4E0D;&#x7528;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x901A;&#x77E5;&#x6211;&#x4EEC;&#xFF0C;&#x76F4;&#x63A5;&#x53D1;&#x5E03;&#x7ED9;&#x90AE;&#x4EF6;&#x7EC4;&#xFF0C;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x8BA2;&#x9605;&#x8005;&#xFF08;&#x89C2;&#x5BDF;&#x8005;&#xFF09;&#x5C31;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x6536;&#x5230;&#x60C5;&#x62A5;&#x5566;</p>
<blockquote>
<p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8BA9;&#x591A;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#x540C;&#x65F6;&#x76D1;&#x542C;&#x67D0;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x5BF9;&#x8C61;&#x5728;&#x72B6;&#x6001;&#x4E0A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x4F1A;&#x901A;&#x77E5;&#x6240;&#x6709;&#x89C2;&#x5BDF;&#x8005;&#x5BF9;&#x8C61;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#xFF08;State&#xFF09;<br>&#x8DDF;MM&#x4EA4;&#x5F80;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#x5979;&#x7684;&#x72B6;&#x6001;&#x54E6;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x72B6;&#x6001;&#x65F6;&#x5979;&#x7684;&#x884C;&#x4E3A;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x7EA6;&#x5979;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x53BB;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x5BF9;&#x4F60;&#x6CA1;&#x5174;&#x8DA3;&#x7684;MM&#x5C31;&#x4F1A;&#x8BF4; &#x201C;&#x6709;&#x4E8B;&#x60C5;&#x5566;&#x201D;&#xFF0C;&#x5BF9;&#x4F60;&#x4E0D;&#x8BA8;&#x538C;&#x4F46;&#x8FD8;&#x6CA1;&#x559C;&#x6B22;&#x4E0A;&#x7684;MM&#x5C31;&#x4F1A;&#x8BF4;&#x201C;&#x597D;&#x554A;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x5E26;&#x4E0A;&#x6211;&#x540C;&#x4E8B;&#x4E48;&#xFF1F;&#x201D;&#xFF0C;&#x5DF2;&#x7ECF;&#x559C;&#x6B22;&#x4E0A;&#x4F60;&#x7684;MM&#x5C31;&#x4F1A;&#x8BF4;&#x201C;&#x51E0;&#x70B9;&#x949F;&#xFF1F;&#x770B;&#x5B8C;&#x7535;&#x5F71;&#x518D;&#x53BB;&#x6CE1;&#x5427;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x201D;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x770B;&#x7535;&#x5F71;&#x8FC7;&#x7A0B;&#x4E2D;&#x8868;&#x73B0;&#x826F;&#x597D;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;MM&#x7684;&#x72B6;&#x6001;&#x4ECE;&#x4E0D;&#x8BA8;&#x538C;&#x4E0D;&#x559C;&#x6B22;&#x53D8;&#x6210;&#x559C;&#x6B22;&#x54E6;&#x3002;</p>
<blockquote>
<p>&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#xFF1A;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#x6539;&#x53D8;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x770B;&#x4E0A;&#x53BB;&#x8C61;&#x662F;&#x6539;&#x53D8;&#x4E86;&#x5B83;&#x7684;&#x7C7B;&#x4E00;&#x6837;&#x3002;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x628A;&#x6240;&#x7814;&#x7A76;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#x5305;&#x88C5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x72B6;&#x6001;&#x5BF9;&#x8C61;&#x91CC;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x5BF9;&#x8C61;&#x90FD;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x72B6;&#x6001;&#x7C7B;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x3002;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x7684;&#x610F;&#x56FE;&#x662F;&#x8BA9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x4E5F;&#x968F;&#x4E4B;&#x6539;&#x53D8;&#x3002;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x53D6;&#x5F97;&#x7684;&#x72B6;&#x6001;&#x521B;&#x7ACB;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#x3002;&#x5F53;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4FBF;&#x6539;&#x53D8;&#x6240;&#x9009;&#x7684;&#x5B50;&#x7C7B;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#xFF08;Strategy&#xFF09;<br>&#x8DDF;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;MM&#x7EA6;&#x4F1A;&#xFF0C;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x6709;&#x7684;&#x8BF7;&#x7535;&#x5F71;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6709;&#x7684;&#x5219;&#x53BB;&#x5403;&#x5C0F;&#x5403;&#x6548;&#x679C;&#x4E0D;&#x9519;&#xFF0C;&#x6709;&#x7684;&#x53BB;&#x6D77;&#x8FB9;&#x6D6A;&#x6F2B;&#x6700;&#x5408;&#x9002;&#xFF0C;&#x4F46;&#x76EE;&#x7684;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x5F97;&#x5230;MM&#x7684;&#x82B3;&#x5FC3;&#xFF0C;&#x6211;&#x7684;&#x8FFD;MM&#x9526;&#x56CA;&#x4E2D;&#x6709;&#x597D;&#x591A;Strategy&#x54E6;&#x3002;</p>
<blockquote>
<p>&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#xFF1A;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x9488;&#x5BF9;&#x4E00;&#x7EC4;&#x7B97;&#x6CD5;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x5C01;&#x88C5;&#x5230;&#x5177;&#x6709;&#x5171;&#x540C;&#x63A5;&#x53E3;&#x7684;&#x72EC;&#x7ACB;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x66FF;&#x6362;&#x3002;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x628A;&#x884C;&#x4E3A;&#x548C;&#x73AF;&#x5883;&#x5206;&#x5F00;&#x3002;&#x73AF;&#x5883;&#x7C7B;&#x8D1F;&#x8D23;&#x7EF4;&#x6301;&#x548C;&#x67E5;&#x8BE2;&#x884C;&#x4E3A;&#x7C7B;&#xFF0C;&#x5404;&#x79CD;&#x7B97;&#x6CD5;&#x5728;&#x5177;&#x4F53;&#x7684;&#x7B56;&#x7565;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x3002;&#x7531;&#x4E8E;&#x7B97;&#x6CD5;&#x548C;&#x73AF;&#x5883;&#x72EC;&#x7ACB;&#x5F00;&#x6765;&#xFF0C;&#x7B97;&#x6CD5;&#x7684;&#x589E;&#x51CF;&#xFF0C;&#x4FEE;&#x6539;&#x90FD;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x73AF;&#x5883;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x6A21;&#x7248;(&#x65B9;&#x6CD5;)&#x6A21;&#x5F0F;&#xFF08;Template&#xFF09;<br>&#x770B;&#x8FC7;&#x300A;&#x5982;&#x4F55;&#x8BF4;&#x670D;&#x5973;&#x751F;&#x4E0A;&#x5E8A;&#x300B;&#x8FD9;&#x90E8;&#x7ECF;&#x5178;&#x6587;&#x7AE0;&#x5417;&#xFF1F;&#x5973;&#x751F;&#x4ECE;&#x8BA4;&#x8BC6;&#x5230;&#x4E0A;&#x5E8A;&#x7684;&#x4E0D;&#x53D8;&#x7684;&#x6B65;&#x9AA4;&#x5206;&#x4E3A;&#x5DE7;&#x9047;&#x3001;&#x6253;&#x7834;&#x50F5;&#x5C40;&#x3001;&#x5C55;&#x5F00;&#x8FFD;&#x6C42;&#x3001;&#x63A5;&#x543B;&#x3001;&#x524D;&#x620F;&#x3001;&#x52A8;&#x624B;&#x3001;&#x7231;&#x629A;&#x3001;&#x8FDB;&#x53BB;&#x516B;&#x5927;&#x6B65;&#x9AA4;(Template method)&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90FD;&#x6709;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x770B;&#x4F60;&#x968F;&#x673A;&#x5E94;&#x53D8;&#x5566;(&#x5177;&#x4F53;&#x5B9E;&#x73B0;)&#xFF1B;</p>
<blockquote>
<p>&#x6A21;&#x677F;(&#x65B9;&#x6CD5;)&#x6A21;&#x5F0F;&#xFF1A;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x6A21;&#x5F0F;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7C7B;&#xFF0C;&#x5C06;&#x90E8;&#x5206;&#x903B;&#x8F91;&#x4EE5;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x5177;&#x4F53;&#x6784;&#x9020;&#x5B50;&#x7684;&#x5F62;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x7136;&#x540E;&#x58F0;&#x660E;&#x4E00;&#x4E9B;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x6765;&#x8FEB;&#x4F7F;&#x5B50;&#x7C7B;&#x5B9E;&#x73B0;&#x5269;&#x4F59;&#x7684;&#x903B;&#x8F91;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x5BF9;&#x5269;&#x4F59;&#x7684;&#x903B;&#x8F91;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5148;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x9876;&#x7EA7;&#x903B;&#x8F91;&#x6846;&#x67B6;&#xFF0C;&#x800C;&#x5C06;&#x903B;&#x8F91;&#x7684;&#x7EC6;&#x8282;&#x7559;&#x7ED9;&#x5177;&#x4F53;&#x7684;&#x5B50;&#x7C7B;&#x53BB;&#x5B9E;&#x73B0;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Visitor&#xFF09;<br>&#x60C5;&#x4EBA;&#x8282;&#x5230;&#x4E86;&#xFF0C;&#x8981;&#x7ED9;&#x6BCF;&#x4E2A;MM&#x9001;&#x4E00;&#x675F;&#x9C9C;&#x82B1;&#x548C;&#x4E00;&#x5F20;&#x5361;&#x7247;&#xFF0C;&#x53EF;&#x662F;&#x6BCF;&#x4E2A;MM&#x9001;&#x7684;&#x82B1;&#x90FD;&#x8981;&#x9488;&#x5BF9;&#x5979;&#x4E2A;&#x4EBA;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6BCF;&#x5F20;&#x5361;&#x7247;&#x4E5F;&#x8981;&#x6839;&#x636E;&#x4E2A;&#x4EBA;&#x7684;&#x7279;&#x70B9;&#x6765;&#x6311;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x54EA;&#x641E;&#x5F97;&#x6E05;&#x695A;&#xFF0C;&#x8FD8;&#x662F;&#x627E;&#x82B1;&#x5E97;&#x8001;&#x677F;&#x548C;&#x793C;&#x54C1;&#x5E97;&#x8001;&#x677F;&#x505A;&#x4E00;&#x4E0B;Visitor&#xFF0C;&#x8BA9;&#x82B1;&#x5E97;&#x8001;&#x677F;&#x6839;&#x636E;MM&#x7684;&#x7279;&#x70B9;&#x9009;&#x4E00;&#x675F;&#x82B1;&#xFF0C;&#x8BA9;&#x793C;&#x54C1;&#x5E97;&#x8001;&#x677F;&#x4E5F;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7279;&#x70B9;&#x9009;&#x4E00;&#x5F20;&#x5361;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8F7B;&#x677E;&#x591A;&#x4E86;&#xFF1B;</p>
<blockquote>
<p>&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5C01;&#x88C5;&#x4E00;&#x4E9B;&#x65BD;&#x52A0;&#x4E8E;&#x67D0;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5143;&#x7D20;&#x4E4B;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4E00;&#x65E6;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x8BDD;&#xFF0C;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x76F8;&#x5BF9;&#x672A;&#x5B9A;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x628A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x4F5C;&#x7528;&#x4E8E;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x89E3;&#x8131;&#x5F00;&#xFF0C;&#x4F7F;&#x5F97;&#x64CD;&#x4F5C;&#x96C6;&#x5408;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x81EA;&#x7531;&#x7684;&#x6F14;&#x5316;&#x3002;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#x53D8;&#x7684;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BBF;&#x95EE;&#x8005;&#x7C7B;&#x3002;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x5C06;&#x6709;&#x5173;&#x7684;&#x884C;&#x4E3A;&#x96C6;&#x4E2D;&#x5230;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x8005;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5206;&#x6563;&#x5230;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x8282;&#x70B9;&#x7C7B;&#x4E2D;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x8981;&#x5C06;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5BF9;&#x8C61;&#x6D4F;&#x89C8;&#x903B;&#x8F91;&#x653E;&#x5728;&#x8BBF;&#x95EE;&#x8005;&#x7C7B;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x653E;&#x5230;&#x5B83;&#x7684;&#x5B50;&#x7C7B;&#x4E2D;&#x3002;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x8DE8;&#x8FC7;&#x51E0;&#x4E2A;&#x7C7B;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x8BBF;&#x95EE;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x7684;&#x6210;&#x5458;&#x7C7B;&#x3002;</p>
</blockquote>
</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/swe-dp-metaphor/" data-id="cj0i7aetj007qggskbofg1x9n" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/swe-dp-metaphor/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/SWE/">SWE</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/设计模式/">设计模式</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/swe-dp-explain/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          设计模式详解
        
      </div>
    </a>
  
  
    <a href="/2016/swe-dp-principle/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">设计模式七大原则</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/swe-dp-metaphor/" data-title="设计模式形象比喻" data-url="http://snowyying.github.io/2016/swe-dp-metaphor/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">16</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">13</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/网络/">网络</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12.22px;">C</a> <a href="/tags/C/" style="font-size: 12.22px;">C++</a> <a href="/tags/C-C/" style="font-size: 15.56px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11.11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15.56px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 11.11px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11.11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 13.33px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11.11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17.78px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13.33px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12.22px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11.11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 11.11px;">http</a> <a href="/tags/https/" style="font-size: 10px;">https</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11.11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11.11px;">poll</a> <a href="/tags/select/" style="font-size: 13.33px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11.11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16.67px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/性能/" style="font-size: 13.33px;">性能</a> <a href="/tags/成长/" style="font-size: 18.89px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16.67px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 17.78px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 17.78px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14.44px;">设计模式</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 11.11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/os-linux-construct-comic/">漫画趣解 linux 内核构造</a>
          </li>
        
          <li>
            <a href="/2017/gen-programmer-skill-map/">程序员技能图谱</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-simple-web-server/">开源 http(s) 框架 Simple Web Server</a>
          </li>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/net-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT 协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-overview/">理解 RESTful 架构</a>
          </li>
        
          <li>
            <a href="/2017/c-c-cpp-hybird-programming/">C 与 C++ 混合编程</a>
          </li>
        
          <li>
            <a href="/2017/os-io-fast-gpio/">ARM Linux 通过 mmap 操作 GPIO (快速 GPIO)</a>
          </li>
        
          <li>
            <a href="/2017/misc-key-matrix/">GPIO 的矩阵按键扫描电路</a>
          </li>
        
          <li>
            <a href="/2017/misc-fallible-it-words/">中国程序员容易发音错误的计算机相关英文单词</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>