<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：物质驱动与兴趣驱动 编程驱动力是什么？ | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2657 2014&amp;#x5E74;01&amp;#x6708;26&amp;#x65E5;
&amp;#x5728;&amp;#x56FD;&amp;#x5185;&amp;#x666E;&amp;#x904D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F88;&amp;#x7279;&amp;#x522B;&amp;#x7684;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：物质驱动与兴趣驱动 编程驱动力是什么？">
<meta property="og:url" content="http://snowyying.site/2016/gen-programming-guide-7-driving-force/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2657 2014&amp;#x5E74;01&amp;#x6708;26&amp;#x65E5;
&amp;#x5728;&amp;#x56FD;&amp;#x5185;&amp;#x666E;&amp;#x904D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F88;&amp;#x7279;&amp;#x522B;&amp;#x7684;&amp;#x">
<meta property="og:updated_time" content="2017-01-12T02:31:14.048Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：物质驱动与兴趣驱动 编程驱动力是什么？">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2657 2014&amp;#x5E74;01&amp;#x6708;26&amp;#x65E5;
&amp;#x5728;&amp;#x56FD;&amp;#x5185;&amp;#x666E;&amp;#x904D;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F88;&amp;#x7279;&amp;#x522B;&amp;#x7684;&amp;#x">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不破, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.site"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-gen-programming-guide-7-driving-force" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：物质驱动与兴趣驱动 编程驱动力是什么？
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/gen-programming-guide-7-driving-force/" class="article-date">
  <time datetime="2016-08-05T05:38:01.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA; http://www.nowamagic.net/librarys/veda/detail/2657 2014&#x5E74;01&#x6708;26&#x65E5;</code></p>
<p>&#x5728;&#x56FD;&#x5185;&#x666E;&#x904D;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x7279;&#x522B;&#x7684;&#x73B0;&#x8C61;&#xFF1A;&#x9AD8;&#x4E2D;&#x50CF;&#x6253;&#x4E86;&#x9E21;&#x8840;&#x4E00;&#x6837;&#x4F7F;&#x52B2;&#x5B66;&#x4E60;&#x7684;&#x4EBA;&#xFF0C;&#x5230;&#x4E86;&#x5927;&#x5B66;&#x5F80;&#x5F80;&#x4F1A;&#x653E;&#x677E;&#x4E0B;&#x6765;&#xFF0C;&#x8DD1;&#x53BB;&#x4EAB;&#x53D7;&#x751F;&#x6D3B;&#x4E86;&#xFF0C;&#x5927;&#x5B66;&#x91CC;&#x6253;&#x6E38;&#x620F;&#x3001;&#x6253;&#x724C;&#x3001;&#x4E34;&#x8003;&#x51B2;&#x523A;&#x7684;&#x5927;&#x6709;&#x4EBA;&#x5728;&#x3002;</p>
<a id="more"></a>
<p>&#x8FD9;&#x5012;&#x4E5F;&#x5728;&#x60C5;&#x7406;&#x4E4B;&#x4E2D;&#xFF0C;&#x9AD8;&#x4E2D;&#x4E0D;&#x5B66;&#x771F;&#x8003;&#x4E0D;&#x4E0A;&#x5927;&#x5B66;&#xFF0C;&#x8003;&#x4E0D;&#x4E0A;&#x5927;&#x5B66;&#x771F;&#x5C31;&#x5B8C;&#x86CB;&#x4E86;&#xFF1B;&#x5927;&#x5B66;&#x4E0D;&#x5B66;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x6BD5;&#x4E1A;&#xFF0C;&#x5927;&#x81F4;&#x8FD8;&#x80FD;&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x3002;&#x4F46;&#x4EBA;&#x751F;&#x662F;&#x573A;&#x957F;&#x8DD1;&#xFF0C;&#x7A0D;&#x4E00;&#x505C;&#x987F;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x4EBA;&#x5C31;&#x55D6;&#x55D6;&#x7684;&#x7A9C;&#x5230;&#x4F60;&#x524D;&#x9762;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x770B;&#x5F97;&#x5230;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x3002;&#x8FD9;&#x5F88;&#x50CF;&#x9F9F;&#x5154;&#x8D5B;&#x8DD1;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E0D;&#x6210;&#x4E3A;&#x90A3;&#x53EA;&#x5154;&#x5B50;&#xFF0C;&#x5355;&#x9760;&#x53E3;&#x53F7;&#x5C42;&#x6B21;&#x7684;&#x4E3B;&#x89C2;&#x610F;&#x613F;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;</p>
<p>&#x505C;&#x4E0B;&#x6765;&#x7684;&#x4EBA;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x505C;&#x5728;&#x4E86;&#x5927;&#x5B66;&#x91CC;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x505C;&#x5728;&#x4E86;&#x5C0F;&#x6709;&#x6210;&#x7EE9;&#x4E4B;&#x540E;&#xFF0C;&#x800C;&#x4E3A;&#x4E86;&#x6301;&#x7EED;&#x524D;&#x884C;&#x800C;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#xFF0C;&#x90A3;&#x9996;&#x5148;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x4E2A;&#x52A8;&#x529B;&#x6E90;&#xFF0C;&#x800C;&#x8981;&#x60F3;&#x627E;&#x5230;&#x52A8;&#x529B;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x9996;&#x5148;&#x8981;&#x62F7;&#x95EE;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0A;&#x5C71;&#x5B66;&#x827A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x3002;</p>
<p>&#x7EAF;&#x7269;&#x8D28;&#x4E0A;&#x7684;&#x9A71;&#x52A8;&#x529B;</p>
<p>&#x5982;&#x679C;&#x56DE;&#x770B;&#x5386;&#x53F2;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x5386;&#x53F2;&#x8BB0;&#x4E0B;&#x540D;&#x5B57;&#x7684;&#x4EBA;&#xFF08;&#x5B54;&#x5B50;&#x3001;&#x5546;&#x9785;&#x3001;&#x6C49;&#x6B66;&#x5E1D;&#x3001;&#x674E;&#x767D;&#x3001;&#x738B;&#x5B89;&#x77F3;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x5F80;&#x5F80;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x901A;&#x7684;&#x7279;&#x5F81;&#xFF1A;&#x4ED6;&#x4EEC;&#x5177;&#x6709;&#x6F8E;&#x6E43;&#x7684;&#x751F;&#x547D;&#x529B;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x6BCF;&#x5929;&#x6DF7;&#x6DF7;&#x65E5;&#x5B50;&#x7684;&#x4EBA;&#xFF0C;&#x867D;&#x7136;&#x751F;&#x547D;&#x529B;&#x7684;&#x8868;&#x73B0;&#x5F80;&#x5F80;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x8FD9;&#x4F3C;&#x4E4E;&#x548C;&#x597D;&#x4EBA;&#x574F;&#x4EBA;&#xFF0C;&#x7406;&#x60F3;&#x9AD8;&#x5C1A;&#x4E0E;&#x5426;&#x65E0;&#x5173;&#xFF0C;&#x5FC5;&#x987B;&#x7684;&#x53EA;&#x662F;&#x8FD9;&#x4E2A;&#x4EBA;&#x8981;&#x6709;&#x6240;&#x6267;&#x8457;&#xFF0C;&#x5E76;&#x6301;&#x7EED;&#x7684;&#x8FD0;&#x7528;&#x4F60;&#x7684;&#x8111;&#x529B;&#x3001;&#x4F53;&#x529B;&#x53BB;&#x505A;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x800C;&#x4E00;&#x4E2A;&#x4EBA;&#x8981;&#x60F3;&#x6709;&#x6240;&#x6267;&#x8457;&#xFF0C;&#x90A3;&#x5C31;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x79CD;&#x6301;&#x7EED;&#x5B58;&#x5728;&#x7684;&#x9A71;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x91CC;&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x800C;&#x8A00;&#x7B2C;&#x4E00;&#x9A71;&#x52A8;&#x529B;&#x65E0;&#x7591;&#x662F;&#x7269;&#x8D28;&#x53CA;&#x91D1;&#x94B1;&#xFF0C;&#x4F46;&#x8FD9;&#x4F3C;&#x4E4E;&#x53EA;&#x53EF;&#x4EE5;&#x505A;&#x8D77;&#x70B9;&#x800C;&#x4E0D;&#x80FD;&#x505A;&#x7EC8;&#x70B9;&#x3002;&#x8FD9;&#x5C31;&#x548C;&#x6881;&#x5C71;&#x597D;&#x6C49;&#x4E00;&#x6837;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x6CA1;&#x51C6;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5927;&#x7897;&#x559D;&#x9152;&#xFF0C;&#x5927;&#x5757;&#x5403;&#x8089;&#xFF0C;&#x53EF;&#x805A;&#x4E86;&#x4E49;&#x4E4B;&#x540E;&#xFF0C;&#x5219;&#x8981;&#x8003;&#x8651;&#x66FF;&#x5929;&#x884C;&#x9053;&#xFF0C;&#x9664;&#x66B4;&#x5B89;&#x826F;&#x8FD9;&#x7C7B;&#x6BD4;&#x8F83;&#x9AD8;&#x7AEF;&#x4E00;&#x70B9;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</p>
<p>&#x7EC4;&#x7EC7;&#x884C;&#x4E3A;&#x5B66;&#x4E2D;&#x7684;&#x7814;&#x7A76;&#x4F50;&#x8BC1;&#x4E86;&#x8FD9;&#x4E00;&#x7ED3;&#x8BBA;&#xFF0C;&#x7F8E;&#x56FD;&#x4EBA;&#x7684;&#x7814;&#x7A76;&#x663E;&#x793A;&#xFF0C;&#x5F53;&#x5E74;&#x85AA;&#x8D85;&#x8FC7;40000&#x7F8E;&#x5143;&#x540E;&#xFF0C;&#x85AA;&#x8D44;&#x5C06;&#x4E0D;&#x518D;&#x662F;&#x5DE5;&#x4F5C;&#x6EE1;&#x610F;&#x5EA6;&#x7684;&#x6838;&#x5FC3;&#x652F;&#x6491;&#x56E0;&#x7D20;&#x3002;&#x5728;&#x4E2D;&#x56FD;&#x4F30;&#x8BA1;&#x76F8;&#x5DEE;&#x4E0D;&#x5927;&#xFF0C;20&#x4E07;&#x4EE5;&#x4E0A;&#x5E74;&#x85AA;&#x7684;&#x4EBA;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x5BFB;&#x627E;&#x5176;&#x4ED6;&#x7684;&#x9A71;&#x52A8;&#x529B;&#x3002;&#x5426;&#x5219;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x5904;&#x5728;&#x4E00;&#x79CD;&#x74F6;&#x9888;&#x72B6;&#x6001;&#xFF1A;&#x57FA;&#x672C;&#x7269;&#x8D28;&#x9700;&#x6C42;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x4F4F;&#x623F;&#x3001;&#x6C7D;&#x8F66;&#x7B49;&#xFF09;&#xFF0C;&#x4F46;&#x66F4;&#x9AD8;&#x4E00;&#x5C42;&#x7684;&#x7269;&#x8D28;&#x9700;&#x6C42;&#x53C8;&#x5F88;&#x4E0D;&#x73B0;&#x5B9E;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x522B;&#x5885;&#x3001;&#x6E38;&#x6CF3;&#x6C60;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5355;&#x7EAF;&#x7684;&#x7269;&#x8D28;&#x652F;&#x6491;&#x4F1A;&#x8BA9;&#x751F;&#x547D;&#x529B;&#x53D8;&#x7684;&#x840E;&#x9761;&#xFF0C;&#x4EBA;&#x4E5F;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x65E0;&#x53EF;&#x65E0;&#x4E0D;&#x53EF;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E2D;&#x5373;&#x4E0D;&#x4F1A;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F88;&#x4E0D;&#x9AD8;&#x5174;&#xFF0C;&#x6BCF;&#x5929;&#x4E5F;&#x53EA;&#x662F;&#x4F8B;&#x884C;&#x516C;&#x4E8B;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x4EBA;&#x751F;&#x5C31;&#x4F1A;&#x5F00;&#x59CB;&#x4E0B;&#x6ED1;&#xFF0C;&#x5012;&#x9709;&#x7684;&#x8BDD;&#x8FD8;&#x4F1A;&#x5931;&#x4E1A;&#x3002;&#x7B49;&#x5230;&#x56F0;&#x5883;&#x771F;&#x7684;&#x6765;&#x4E86;&#xFF0C;&#x518D;&#x60F3;&#x632F;&#x4F5C;&#xFF0C;&#x5374;&#x6CA1;&#x90A3;&#x4EFD;&#x513F;&#x5FC3;&#x529B;&#x4E86;&#x3002;</p>
<p>&#x5728;2012&#x5E74;11&#x6708;&#xFF0C;&#x65B0;&#x95FB;&#x62A5;&#x5BFC;&#x767E;&#x5EA6;&#x603B;&#x88C1;&#x674E;&#x5F66;&#x5B8F;&#x5728;&#x516C;&#x53F8;&#x5185;&#x547C;&#x5524;&#x72FC;&#x6027;&#xFF0C;&#x6392;&#x65A5;&#x5C0F;&#x8D44;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x547C;&#x5524;&#x7684;&#x662F;&#x654F;&#x9510;&#x7684;&#x55C5;&#x89C9;&#x3001;&#x4E0D;&#x5C48;&#x4E0D;&#x6320;&#x594B;&#x4E0D;&#x987E;&#x8EAB;&#x7684;&#x8FDB;&#x653B;&#x7CBE;&#x795E;&#xFF0C;&#x7FA4;&#x4F53;&#x594B;&#x6597;&#xFF0C;&#x6392;&#x65A5;&#x7684;&#x662F;&#x4FE1;&#x5949;&#x5DE5;&#x4F5C;&#x53EA;&#x662F;&#x4EBA;&#x751F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x601D;&#x8FDB;&#x53D6;&#xFF0C;&#x8FFD;&#x6C42;&#x4E2A;&#x4EBA;&#x751F;&#x6D3B;&#x7684;&#x8212;&#x9002;&#x7684;&#x6001;&#x5EA6;&#x3002;&#x8FD9;&#x4E8B;&#x60C5;&#x7684;&#x662F;&#x975E;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x91CC;&#x7565;&#x8FC7;&#x4E0D;&#x63D0;&#xFF0C;&#x53CD;&#x5012;&#x662F;&#x767E;&#x5EA6;&#x8FD9;&#x4E00;&#x884C;&#x52A8;&#x672C;&#x8EAB;&#x8BF4;&#x660E;&#x516C;&#x53F8;&#x91CC;&#x786E;&#x5B9E;&#x5BB9;&#x6613;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x751F;&#x547D;&#x529B;&#x840E;&#x9761;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x70B9;&#x751A;&#x81F3;&#x8BA9;CEO&#x5FCD;&#x65E0;&#x53EF;&#x5FCD;&#x3002;</p>
<p>&#x5174;&#x8DA3;&#x7684;&#x529B;&#x91CF;</p>
<p>&#x5982;&#x679C;&#x8BF4;&#x7EAF;&#x7269;&#x8D28;&#x4E0A;&#x7684;&#x9A71;&#x52A8;&#x6709;&#x4E00;&#x5B9A;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5174;&#x8DA3;&#x53C8;&#x5982;&#x4F55;&#xFF1F;</p>
<p>&#x5F53;&#x95EE;&#x53CA;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x4EC0;&#x4E48;&#x4ECE;&#x4E8B;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65F6;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x56DE;&#x7B54;&#x662F;&#xFF1A;&#x5174;&#x8DA3;&#x3002;&#x4F46;&#x4EBA;&#x4EEC;&#x8FD9;&#x4E48;&#x8868;&#x8FBE;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x5E38;&#x8BF4;&#x7684;&#x8FD9;&#x79CD;&#x5174;&#x8DA3;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x600E;&#x4E48;&#x9760;&#x5F97;&#x4F4F;&#x7684;&#x9A71;&#x52A8;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x5174;&#x8DA3;&#x5F80;&#x5F80;&#x662F;&#x4E00;&#x79CD;&#x4E00;&#x65F6;&#x7684;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0E;&#x81EA;&#x5DF1;&#x6027;&#x683C;&#x7279;&#x8D28;&#x76F8;&#x5951;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7ED9;&#x751F;&#x547D;&#x89E3;&#x95F7;&#x7684;&#x90A3;&#x79CD;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x770B;&#xFF0C;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5C42;&#x6B21;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x6D45;&#x5C42;&#x6B21;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x6BD4;&#x8F83;&#x9177;&#x53EF;&#x80FD;&#x60F3;&#x73A9;&#x73A9;&#xFF0C;&#x770B;&#x522B;&#x4EBA;&#x5199;&#x535A;&#x5BA2;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x5199;&#x51E0;&#x7BC7;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x5219;&#x662F;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x4F60;&#x4E0D;&#x8BA9;&#x4ED6;&#x601D;&#x8003;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x611F;&#x89C9;&#x6D3B;&#x7740;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x4E86;&#x3002;</p>
<p>&#x627E;&#x5230;&#x540E;&#x4E00;&#x79CD;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x662F;&#x5E78;&#x8FD0;&#x7684;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5E76;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x5E78;&#x8FD0;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x6240;&#x8BF4;&#x7684;&#x5174;&#x8DA3;&#x90FD;&#x662F;&#x524D;&#x4E00;&#x79CD;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5373;&#x5C06;&#x6BD5;&#x4E1A;&#x548C;&#x521A;&#x6BD5;&#x4E1A;&#x4E0D;&#x4E45;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x505A;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7275;&#x6D89;&#x7684;&#x5F80;&#x5F80;&#x662F;&#x5927;&#x91CF;&#x6BD4;&#x8F83;&#x7E41;&#x7410;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5927;&#x591A;&#x65F6;&#x5019;&#x810F;&#x6D3B;&#x3001;&#x7D2F;&#x6D3B;&#x3001;&#x82E6;&#x6D3B;&#x8FDC;&#x6BD4;&#x770B;&#x4E0A;&#x53BB;&#x98CE;&#x5149;&#x7684;&#x6D3B;&#xFF0C;&#x6709;&#x8DA3;&#x7684;&#x6D3B;&#x591A;&#x3002;&#x5177;&#x4F53;&#x4E00;&#x70B9;&#x8BB2;&#x5C31;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x6BD4;&#x8F83;&#x5783;&#x573E;&#x7684;&#x65E2;&#x5B58;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x9762;&#x5BF9;&#x4E0D;&#x600E;&#x4E48;&#x8D1F;&#x8D23;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x65E0;&#x7406;&#x7684;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#xFF0C;&#x5341;&#x5206;&#x7D27;&#x5F20;&#x7684;&#x65E5;&#x7A0B;&#x7B49;&#x3002;&#x9664;&#x975E;&#x4F60;&#x505A;&#x7684;&#x662F;&#x5F88;&#x9AD8;&#x7AEF;&#x7684;&#x7814;&#x7A76;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x672C;&#x8EAB;&#x5E76;&#x975E;&#x662F;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x5F88;&#x5FEB;&#x4F1A;&#x8BA9;&#x521D;&#x59CB;&#x65F6;&#x7684;&#x4E00;&#x70B9;&#x5939;&#x6742;&#x7740;&#x597D;&#x5947;&#x5FC3;&#x7684;&#xFF0C;&#x6D45;&#x5C42;&#x6B21;&#x7684;&#x5174;&#x8DA3;&#x6D88;&#x8017;&#x6B86;&#x5C3D;&#x3002;&#x6700;&#x521D;&#x5370;&#x8C61;&#x548C;&#x5B9E;&#x9645;&#x7684;&#x504F;&#x5DEE;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x9020;&#x6210;&#x67D0;&#x4E9B;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x524D;&#x9000;&#x573A;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x539F;&#x751F;&#x6001;&#x7684;&#x5174;&#x8DA3;&#x6D88;&#x5931;&#x540E;&#xFF0C;&#x53C8;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x652F;&#x6491;&#x70B9;&#x7684;&#x8BDD;&#xFF0C;&#x4EBA;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x4F1A;&#x50CF;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x4F1A;&#x538C;&#x6076;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x56E0;&#x4E3A;&#x6BCF;&#x5929;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x82B1;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x800C;&#x5DE5;&#x4F5C;&#x672C;&#x8EAB;&#x53C8;&#x662F;&#x5982;&#x6B64;&#x7684;&#x65E0;&#x804A;&#x3002;&#x6240;&#x4EE5;&#x6545;&#x4E8B;&#x5230;&#x5174;&#x8DA3;&#x8FD9;&#x91CC;&#x5E76;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x7EE7;&#x7EED;&#x627E;&#x5BFB;&#x9A71;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x5F88;&#x53EF;&#x80FD;&#x4EE5;&#x5174;&#x8DA3;&#x4E3A;&#x51FA;&#x53D1;&#x70B9;&#x800C;&#x627E;&#x5BFB;&#x5176;&#x4ED6;&#xFF0C;&#x6700;&#x7EC8;&#x53CD;&#x5012;&#x53C8;&#x56DE;&#x5230;&#x8D77;&#x70B9;&#xFF0C;&#x8FD9;&#x662F;&#x4EBA;&#x751F;&#x5E38;&#x6001;&#xFF0C;&#x5012;&#x4E0D;&#x503C;&#x5F97;&#x60CA;&#x8BB6;&#x3002;</p>
<p>&#x5174;&#x8DA3;&#x3001;&#x4F53;&#x529B;&#x4E0E;&#x667A;&#x529B;</p>
<p>&#x4EBA;&#x548C;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4F53;&#x529B;&#x5F80;&#x5F80;&#x76F8;&#x5DEE;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x667A;&#x529B;&#x7684;&#x5DEE;&#x5F02;&#x5374;&#x5F80;&#x5F80;&#x4E0D;&#x53EF;&#x4EE5;&#x9053;&#x91CC;&#x8BA1;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x8001;&#x519C;&#x534A;&#x5929;&#x79CD;&#x4E00;&#x4EA9;&#x5730;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x719F;&#x7EC3;&#x7684;&#x5FD9;&#x548C;&#x4E00;&#x5929;&#x5927;&#x81F4;&#x4E5F;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x4E00;&#x4EA9;&#x5730;&#x3002;</p>
<p>&#x7EAF;&#x4F53;&#x529B;&#x4E0A;&#x4E0D;&#x592A;&#x62C9;&#x5F97;&#x5F00;&#x4EBA;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x800C;&#x667A;&#x529B;&#x5219;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4EBA;&#x7684;&#x667A;&#x529B;&#x5BB9;&#x6613;&#x6709;&#x6570;&#x91CF;&#x7EA7;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x524D;&#x82CF;&#x8054;&#x8457;&#x540D;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x3001;&#x8BFA;&#x8D1D;&#x5C14;&#x83B7;&#x5F97;&#x8005;&#x6717;&#x9053;&#x5C06;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x4ECE;&#x4E00;&#x7EA7;&#x5230;&#x4E94;&#x7EA7;&#x5206;&#x4E3A;5&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x8D21;&#x732E;&#x5DEE;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;&#x6717;&#x9053;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;2.5&#x7EA7;&#xFF0C;&#x83B7;&#x5F97;&#x8BFA;&#x8D1D;&#x5C14;&#x5956;&#x540E;&#xFF0C;&#x624D;&#x628A;&#x81EA;&#x5DF1;&#x751F;&#x4E3A;1.5&#x7EA7;&#x3002;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x8003;&#x8651;5&#x7EA7;&#x7684;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x548C;&#x666E;&#x901A;&#x4EBA;&#x7684;&#x5DEE;&#x5F02;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#xFF0C;&#x8D8A;&#x662F;&#x9760;&#x8FD1;&#x4F53;&#x529B;&#x4E00;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;&#x8D8A;&#x4E0D;&#x53EF;&#x80FD;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#xFF0C;&#x800C;&#x8D8A;&#x9760;&#x8FD1;&#x667A;&#x529B;&#x4E00;&#x7AEF;&#x7684;&#x5DE5;&#x4F5C;&#x8D8A;&#x53EF;&#x80FD;&#x662F;&#x7EAF;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#x3002;&#x6070;&#x5982;&#x6211;&#x5F88;&#x96BE;&#x76F8;&#x4FE1;&#x5E72;&#x91CD;&#x4F53;&#x529B;&#x6D3B;&#x7684;&#x4EBA;&#x662F;&#x56E0;&#x4E3A;&#x5174;&#x8DA3;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4E5F;&#x5F88;&#x96BE;&#x76F8;&#x4FE1;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x4E0D;&#x53BB;&#x505A;&#x4EE5;&#x8272;&#x5217;&#x603B;&#x7EDF;&#x800C;&#x9009;&#x62E9;&#x7EE7;&#x7EED;&#x7814;&#x7A76;&#x7269;&#x7406;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x6781;&#x7AEF;&#x95F4;&#xFF0C;&#x6240;&#x5360;&#x8DE8;&#x5EA6;&#x8F83;&#x5927;&#xFF0C;&#x4F46;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x4E5F;&#x8BB8;&#x662F;&#x4E2D;&#x95F4;&#x504F;&#x5DE6;&#xFF0C;&#x5B8C;&#x5168;&#x7684;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#x4F30;&#x8BA1;&#x5F88;&#x96BE;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x559C;&#x6B22;&#x6E38;&#x6CF3;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x5403;&#x5C0F;&#x7B3C;&#x5305;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x7684;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x7269;&#x8D28;&#x9A71;&#x52A8;&#x548C;&#x5174;&#x8DA3;&#x9A71;&#x52A8;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x8C8C;&#x4F3C;&#x90FD;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x9760;&#x8C31;&#xFF0C;&#x90A3;&#x4E48;&#x4EC0;&#x4E48;&#x9A71;&#x52A8;&#x529B;&#x624D;&#x80FD;&#x4F7F;&#x4EBA;&#x751F;&#x6C38;&#x52A8;&#x5462;&#xFF1F;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.site/2016/gen-programming-guide-7-driving-force/" data-id="cj0iybwho00266wskqjt5dicf" class="article-share-link">Share</a>
      
        <a href="http://snowyying.site/2016/gen-programming-guide-7-driving-force/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/gen-programming-guide-8-dream/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：保持内心的青春与理想 理想驱动编程
        
      </div>
    </a>
  
  
    <a href="/2016/gen-programming-guide-6-golden-time/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：别错过人生中学习的黄金时期 保持知识更新</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/gen-programming-guide-7-driving-force/" data-title="码路指南：物质驱动与兴趣驱动 编程驱动力是什么？" data-url="http://snowyying.site/2016/gen-programming-guide-7-driving-force/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">17</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">24</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">13</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/ARP/" style="font-size: 10px;">ARP</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 10.91px;">C</a> <a href="/tags/C/" style="font-size: 10.91px;">C++</a> <a href="/tags/C-C/" style="font-size: 15.45px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 10.91px;">CMMI</a> <a href="/tags/DNS/" style="font-size: 10px;">DNS</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GPIO/" style="font-size: 10.91px;">GPIO</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 14.55px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/ICMP/" style="font-size: 10px;">ICMP</a> <a href="/tags/IGMP/" style="font-size: 10px;">IGMP</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IP/" style="font-size: 10px;">IP</a> <a href="/tags/IP-协议/" style="font-size: 10px;">IP 协议</a> <a href="/tags/IT/" style="font-size: 19.09px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Key/" style="font-size: 10px;">Key</a> <a href="/tags/Linux/" style="font-size: 10.91px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 10.91px;">NTP</a> <a href="/tags/OS/" style="font-size: 12.73px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RARP/" style="font-size: 10px;">RARP</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 10.91px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SNMP/" style="font-size: 10px;">SNMP</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 16.36px;">SWE</a> <a href="/tags/TCP/" style="font-size: 10px;">TCP</a> <a href="/tags/TCP-协议/" style="font-size: 10px;">TCP 协议</a> <a href="/tags/TCP-IP/" style="font-size: 10.91px;">TCP/IP</a> <a href="/tags/TCP-IP-协议/" style="font-size: 18.18px;">TCP/IP 协议</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UDP-协议/" style="font-size: 10px;">UDP 协议</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 11.82px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 10.91px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 10.91px;">http</a> <a href="/tags/https/" style="font-size: 10.91px;">https</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 10.91px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 10.91px;">poll</a> <a href="/tags/select/" style="font-size: 12.73px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 10.91px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/勘误/" style="font-size: 10px;">勘误</a> <a href="/tags/勘误表/" style="font-size: 10px;">勘误表</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 15.45px;">发展</a> <a href="/tags/发音/" style="font-size: 10px;">发音</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/快速-GPIO/" style="font-size: 10px;">快速 GPIO</a> <a href="/tags/性能/" style="font-size: 12.73px;">性能</a> <a href="/tags/成长/" style="font-size: 18.18px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/技术图谱/" style="font-size: 10px;">技术图谱</a> <a href="/tags/技术路线/" style="font-size: 10px;">技术路线</a> <a href="/tags/技能/" style="font-size: 10px;">技能</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 15.45px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/按键扫描/" style="font-size: 10px;">按键扫描</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/数据链路层/" style="font-size: 10px;">数据链路层</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 10.91px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/矩阵按键/" style="font-size: 10px;">矩阵按键</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 17.27px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 20px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 13.64px;">设计模式</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 10.91px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/选路/" style="font-size: 10px;">选路</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/os-linux-construct-comic/">漫画趣解 linux 内核构造</a>
          </li>
        
          <li>
            <a href="/2017/gen-programmer-skill-map/">程序员技能图谱</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-simple-web-server/">开源 http(s) 框架 Simple Web Server</a>
          </li>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/net-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT 协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-overview/">理解 RESTful 架构</a>
          </li>
        
          <li>
            <a href="/2017/c-c-cpp-hybird-programming/">C 与 C++ 混合编程</a>
          </li>
        
          <li>
            <a href="/2017/os-io-fast-gpio/">ARM Linux 通过 mmap 操作 GPIO (快速 GPIO)</a>
          </li>
        
          <li>
            <a href="/2017/misc-key-matrix/">GPIO 的矩阵按键扫描电路</a>
          </li>
        
          <li>
            <a href="/2017/misc-fallible-it-words/">中国程序员容易发音错误的计算机相关英文单词</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>