<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>设计模式七大原则 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="1. &amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; (SRP)
&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D23;&amp;#x4E00;&amp;#x4E2A;&amp;#x529F;&amp;#x80FD;&amp;#x9886;&amp;#x57DF;&amp;#x4E2D;&amp;#x7684;&amp;#x76F8;&amp;#x5E94;&amp;#x804C;&amp;#x8D">
<meta property="og:type" content="article">
<meta property="og:title" content="设计模式七大原则">
<meta property="og:url" content="http://snowyying.github.io/2016/swe-dp-principle/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="1. &amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; (SRP)
&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D23;&amp;#x4E00;&amp;#x4E2A;&amp;#x529F;&amp;#x80FD;&amp;#x9886;&amp;#x57DF;&amp;#x4E2D;&amp;#x7684;&amp;#x76F8;&amp;#x5E94;&amp;#x804C;&amp;#x8D">
<meta property="og:image" content="http://snowyying.github.io/2016/swe-dp-principle/Design-principles.png">
<meta property="og:updated_time" content="2017-02-08T06:50:13.960Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="设计模式七大原则">
<meta name="twitter:description" content="1. &amp;#x5355;&amp;#x4E00;&amp;#x804C;&amp;#x8D23;&amp;#x539F;&amp;#x5219; (SRP)
&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x53EA;&amp;#x8D1F;&amp;#x8D23;&amp;#x4E00;&amp;#x4E2A;&amp;#x529F;&amp;#x80FD;&amp;#x9886;&amp;#x57DF;&amp;#x4E2D;&amp;#x7684;&amp;#x76F8;&amp;#x5E94;&amp;#x804C;&amp;#x8D">
<meta name="twitter:image" content="http://snowyying.github.io/2016/swe-dp-principle/Design-principles.png">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不破, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-swe-dp-principle" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      设计模式七大原则
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/swe-dp-principle/" class="article-date">
  <time datetime="2016-11-07T03:45:25.000Z" itemprop="datePublished">2016-11-07</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Software-Engineering/">Software Engineering</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><img src="/2016/swe-dp-principle/Design-principles.png" alt="&#x8BBE;&#x8BA1;&#x539F;&#x5219;"></p>
<h2 id="1-&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;-SRP"><a href="#1-&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;-SRP" class="headerlink" title="1. &#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219; (SRP)"></a>1. &#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219; (SRP)</h2><blockquote>
<p>&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x76F8;&#x5E94;&#x804C;&#x8D23;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;&#x5C31;&#x4E00;&#x4E2A;&#x7C7B;&#x800C;&#x8A00;&#xFF0C;&#x5E94;&#x8BE5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5F15;&#x8D77;&#x5B83;&#x53D8;&#x5316;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
</blockquote>
<p>&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x7C7B;(&#x65B9;&#x6CD5;/&#x6A21;&#x5757;)&#x7684;&#x7C92;&#x5EA6;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7C7B;(&#x5927;&#x5230;&#x6A21;&#x5757;&#xFF0C;&#x5C0F;&#x5230;&#x65B9;&#x6CD5;)&#x627F;&#x62C5;&#x7684;&#x804C;&#x8D23;&#x8D8A;&#x591A;&#xFF0C;&#x5B83;&#x88AB;&#x590D;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x4E2A;&#x7C7B;&#x627F;&#x62C5;&#x7684;&#x804C;&#x8D23;&#x8FC7;&#x591A;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x5C06;&#x8FD9;&#x4E9B;&#x804C;&#x8D23;&#x8026;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F53;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x804C;&#x8D23;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x804C;&#x8D23;&#x7684;&#x8FD0;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x804C;&#x8D23;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#xFF0C;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x804C;&#x8D23;&#x5C01;&#x88C5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x5373;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x5316;&#x539F;&#x56E0;&#x5C01;&#x88C5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x804C;&#x8D23;&#x603B;&#x662F;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x5219;&#x53EF;&#x5C06;&#x5B83;&#x4EEC;&#x5C01;&#x88C5;&#x5728;&#x540C;&#x4E00;&#x7C7B;&#x4E2D;&#x3002;</p>
<p>&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x662F;&#x5B9E;&#x73B0;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#x7684;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#xFF0C;&#x5B83;&#x662F;&#x6700;&#x7B80;&#x5355;&#x4F46;&#x53C8;&#x6700;&#x96BE;&#x8FD0;&#x7528;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#x7C7B;&#x7684;&#x4E0D;&#x540C;&#x804C;&#x8D23;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x79BB;&#xFF0C;&#x800C;&#x53D1;&#x73B0;&#x7C7B;&#x7684;&#x591A;&#x91CD;&#x804C;&#x8D23;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x5177;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x5206;&#x6790;&#x8BBE;&#x8BA1;&#x80FD;&#x529B;&#x548C;&#x76F8;&#x5173;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x7531;&#x6765;&#xFF1A;&#x7C7B;T&#x8D1F;&#x8D23;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x804C;&#x8D23;&#xFF1A;&#x804C;&#x8D23;P1&#xFF0C;&#x804C;&#x8D23;P2&#x3002;&#x5F53;&#x7531;&#x4E8E;&#x804C;&#x8D23;P1&#x9700;&#x6C42;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x800C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7C7B;T&#x65F6;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x539F;&#x672C;&#x8FD0;&#x884C;&#x6B63;&#x5E38;&#x7684;&#x804C;&#x8D23;P2&#x529F;&#x80FD;&#x53D1;&#x751F;&#x6545;&#x969C;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x9075;&#x5FAA;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x3002;&#x5206;&#x522B;&#x5EFA;&#x7ACB;&#x4E24;&#x4E2A;&#x7C7B;T1&#x3001;T2&#xFF0C;&#x4F7F;T1&#x5B8C;&#x6210;&#x804C;&#x8D23;P1&#x529F;&#x80FD;&#xFF0C;T2&#x5B8C;&#x6210;&#x804C;&#x8D23;P2&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5F53;&#x4FEE;&#x6539;&#x7C7B;T1&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x4F7F;&#x804C;&#x8D23;P2&#x53D1;&#x751F;&#x6545;&#x969C;&#x98CE;&#x9669;&#xFF1B;&#x540C;&#x7406;&#xFF0C;&#x5F53;&#x4FEE;&#x6539;T2&#x65F6;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x804C;&#x8D23;P1&#x53D1;&#x751F;&#x6545;&#x969C;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x9002;&#x7528;&#x8303;&#x56F4;&#xFF1A;&#x65B9;&#x6CD5;&#x3001;&#x7C7B;&#x3001;&#x6A21;&#x5757; &#x2026;</p>
<p><em>* &#x6269;&#x5C55;: &#x804C;&#x8D23;&#x6269;&#x6563;</em></p>
<h2 id="2-&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;-LSP"><a href="#2-&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;-LSP" class="headerlink" title="2. &#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219; (LSP)"></a>2. &#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219; (LSP)</h2><blockquote>
<p>&#x53EA;&#x8981;&#x7236;&#x7C7B;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x5B50;&#x7C7B;&#x5C31;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x66FF;&#x6362;&#x4E3A;&#x5B50;&#x7C7B;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x6216;&#x5F02;&#x5E38;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#x5C06;&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#x5BF9;&#x8C61;&#x66FF;&#x6362;&#x6210;&#x5B83;&#x7684;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C06;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x548C;&#x5F02;&#x5E38;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x5219;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x57FA;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#x662F;&#x5B9E;&#x73B0;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x91CD;&#x8981;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;&#xFF0C;&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x57FA;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x57FA;&#x7C7B;&#x7C7B;&#x578B;&#x6765;&#x5BF9;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x786E;&#x5B9A;&#x5176;&#x5B50;&#x7C7B;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x6765;&#x66FF;&#x6362;&#x7236;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x901A;&#x8FC7;&#x91CD;&#x5199;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5B8C;&#x6210;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x5199;&#x8D77;&#x6765;&#x867D;&#x7136;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x7EE7;&#x627F;&#x4F53;&#x7CFB;&#x7684;&#x53EF;&#x590D;&#x7528;&#x6027;&#x4F1A;&#x6BD4;&#x8F83;&#x5DEE;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8FD0;&#x7528;&#x591A;&#x6001;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x51FA;&#x9519;&#x7684;&#x51E0;&#x7387;&#x975E;&#x5E38;&#x5927;&#x3002;&#x5982;&#x679C;&#x975E;&#x8981;&#x91CD;&#x5199;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x8F83;&#x901A;&#x7528;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF1A;&#x539F;&#x6765;&#x7684;&#x7236;&#x7C7B;&#x548C;&#x5B50;&#x7C7B;&#x90FD;&#x7EE7;&#x627F;&#x4E00;&#x4E2A;&#x66F4;&#x901A;&#x4FD7;&#x7684;&#x57FA;&#x7C7B;&#xFF0C;&#x539F;&#x6709;&#x7684;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x53BB;&#x6389;&#xFF0C;&#x91C7;&#x7528;&#x4F9D;&#x8D56;&#x3001;&#x805A;&#x5408;&#xFF0C;&#x7EC4;&#x5408;&#x7B49;&#x5173;&#x7CFB;&#x4EE3;&#x66FF;&#x3002;</p>
<p>&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x901A;&#x4FD7;&#x7684;&#x6765;&#x8BB2;&#x5C31;&#x662F;&#xFF1A;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x7236;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x7236;&#x7C7B;&#x539F;&#x6709;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4EE5;&#x4E0B;4&#x5C42;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x8986;&#x76D6;&#x7236;&#x7C7B;&#x7684;&#x975E;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5B50;&#x7C7B;&#x4E2D;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x7279;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5F53;&#x5B50;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#xFF08;&#x5373;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#x53C2;&#xFF09;&#x8981;&#x6BD4;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x66F4;&#x5BBD;&#x677E;&#x3002;</li>
<li>&#x5F53;&#x5B50;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#xFF08;&#x5373;&#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF09;&#x8981;&#x6BD4;&#x7236;&#x7C7B;&#x66F4;&#x4E25;&#x683C;&#x3002;</li>
</ul>
<p>&#x5728;&#x4F7F;&#x7528;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#x65F6;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li><p>&#x5B50;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x5728;&#x7236;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#xFF0C;&#x6216;&#x5B50;&#x7C7B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x7236;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x3002;&#x6839;&#x636E;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x7236;&#x7C7B;&#x6765;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x53EA;&#x5B58;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#xFF0C;&#x5728;&#x7236;&#x7C7B;&#x4E2D;&#x4E0D;&#x63D0;&#x4F9B;&#x76F8;&#x5E94;&#x7684;&#x58F0;&#x660E;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x5728;&#x4EE5;&#x7236;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x4F7F;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x6211;&#x4EEC;&#x5728;&#x8FD0;&#x7528;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#x65F6;&#xFF0C;&#x5C3D;&#x91CF;&#x628A;&#x7236;&#x7C7B;&#x8BBE;&#x8BA1;&#x4E3A;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x8005;&#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x6216;&#x5B9E;&#x73B0;&#x7236;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x5728;&#x7236;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B50;&#x7C7B;&#x5B9E;&#x4F8B;&#x66FF;&#x6362;&#x7236;&#x7C7B;&#x5B9E;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x6269;&#x5C55;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x540C;&#x65F6;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x5B50;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B50;&#x7C7B;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#x662F;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x624B;&#x6BB5;&#x4E4B;&#x4E00;&#x3002;</p>
</li>
</ul>
<p>&#x95EE;&#x9898;&#x7531;&#x6765;&#xFF1A;&#x6709;&#x4E00;&#x529F;&#x80FD;P1&#xFF0C;&#x7531;&#x7C7B;A&#x5B8C;&#x6210;&#x3002;&#x73B0;&#x9700;&#x8981;&#x5C06;&#x529F;&#x80FD;P1&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x6269;&#x5C55;&#x540E;&#x7684;&#x529F;&#x80FD;&#x4E3A;P&#xFF0C;&#x5176;&#x4E2D;P&#x7531;&#x539F;&#x6709;&#x529F;&#x80FD;P1&#x4E0E;&#x65B0;&#x529F;&#x80FD;P2&#x7EC4;&#x6210;&#x3002;&#x65B0;&#x529F;&#x80FD;P&#x7531;&#x7C7B;A&#x7684;&#x5B50;&#x7C7B;B&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x5B50;&#x7C7B;B&#x5728;&#x5B8C;&#x6210;&#x65B0;&#x529F;&#x80FD;P2&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x539F;&#x6709;&#x529F;&#x80FD;P1&#x53D1;&#x751F;&#x6545;&#x969C;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x5F53;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x65F6;&#xFF0C;&#x9075;&#x5FAA;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x3002;&#x7C7B;B&#x7EE7;&#x627F;&#x7C7B;A&#x65F6;&#xFF0C;&#x9664;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x5B8C;&#x6210;&#x65B0;&#x589E;&#x529F;&#x80FD;P2&#x5916;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x91CD;&#x5199;&#x7236;&#x7C7B;A&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x91CD;&#x8F7D;&#x7236;&#x7C7B;A&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x76EE;&#x7684;: &#x589E;&#x5F3A;&#x7A0B;&#x5E8F;&#x7684;&#x5065;&#x58EE;&#x6027;, &#x7248;&#x672C;&#x5347;&#x7EA7;&#x4E5F;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x597D;&#x7684;&#x517C;&#x5BB9;&#x6027;.</p>
<p><em>Overload &#x91CD;&#x8F7D;; Override &#x8986;&#x5199;; Design by Contract &#x5951;&#x7EA6;&#x8BBE;&#x8BA1;.</em></p>
<h2 id="3-&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;-DIP"><a href="#3-&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;-DIP" class="headerlink" title="3. &#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219; (DIP)"></a>3. &#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219; (DIP)</h2><blockquote>
<p>&#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x4E8E;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x5F53;&#x4F9D;&#x8D56;&#x4E8E;&#x62BD;&#x8C61;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x8981;&#x9488;&#x5BF9;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9488;&#x5BF9;&#x5B9E;&#x73B0;&#x7F16;&#x7A0B;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x8BF4;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x6807;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219;&#x5C31;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x662F;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x65F6;&#x6216;&#x5728;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x5C3D;&#x91CF;&#x5F15;&#x7528;&#x5C42;&#x6B21;&#x9AD8;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x7C7B;&#xFF0C;&#x5373;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x548C;&#x62BD;&#x8C61;&#x7C7B;&#x8FDB;&#x884C;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3001;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3001;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#xFF0C;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x8F6C;&#x6362;&#x7B49;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x7528;&#x5177;&#x4F53;&#x7C7B;&#x6765;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x8BE5;&#x539F;&#x5219;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7C7B;&#x5E94;&#x5F53;&#x53EA;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x6216;&#x62BD;&#x8C61;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x8FC7;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x7ED9;&#x51FA;&#x591A;&#x4F59;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x65E0;&#x6CD5;&#x8C03;&#x7528;&#x5230;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x589E;&#x52A0;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x5F15;&#x5165;&#x62BD;&#x8C61;&#x5C42;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x5C42;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x5C06;&#x5177;&#x4F53;&#x7C7B;&#x5199;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x62BD;&#x8C61;&#x5C42;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x5E76;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6765;&#x6269;&#x5C55;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6EE1;&#x8DB3;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x73B0;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x62BD;&#x8C61;&#x5C42;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x5C06;&#x5177;&#x4F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x901A;&#x8FC7;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;(DependencyInjection, DI)&#x7684;&#x65B9;&#x5F0F;&#x6CE8;&#x5165;&#x5230;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x662F;&#x6307;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x53D1;&#x751F;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x62BD;&#x8C61;&#x6765;&#x6CE8;&#x5165;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5E38;&#x7528;&#x7684;&#x6CE8;&#x5165;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;&#xFF0C;&#x5206;&#x522B;&#x662F;&#xFF1A;&#x6784;&#x9020;&#x6CE8;&#x5165;&#xFF0C;&#x8BBE;&#x503C;&#x6CE8;&#x5165;&#xFF08;Setter&#x6CE8;&#x5165;&#xFF09;&#x548C;&#x63A5;&#x53E3;&#x6CE8;&#x5165;&#x3002;&#x6784;&#x9020;&#x6CE8;&#x5165;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x4F20;&#x5165;&#x5177;&#x4F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8BBE;&#x503C;&#x6CE8;&#x5165;&#x662F;&#x6307;&#x901A;&#x8FC7;Setter&#x65B9;&#x6CD5;&#x6765;&#x4F20;&#x5165;&#x5177;&#x4F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x63A5;&#x53E3;&#x6CE8;&#x5165;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x4E1A;&#x52A1;&#x65B9;&#x6CD5;&#x6765;&#x4F20;&#x5165;&#x5177;&#x4F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x4F20;&#x5165;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7531;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x6765;&#x8986;&#x76D6;&#x7236;&#x7C7B;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4F20;&#x9012;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x63A5;&#x53E3;&#x4F20;&#x9012;&#x3001;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x548C;setter&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#xFF0C;&#x76F8;&#x4FE1;&#x7528;&#x8FC7;Spring&#x6846;&#x67B6;&#x7684;&#xFF0C;&#x5BF9;&#x4F9D;&#x8D56;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x9700;&#x8981;&#x505A;&#x5230;&#x5982;&#x4E0B;3&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#x5C3D;&#x91CF;&#x90FD;&#x8981;&#x6709;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x3002;</li>
<li>&#x53D8;&#x91CF;&#x7684;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x5C3D;&#x91CF;&#x662F;&#x62BD;&#x8C61;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x65F6;&#x9075;&#x5FAA;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#x3002;</li>
</ul>
<p>&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x8981;&#x6211;&#x4EEC;<strong>&#x9762;&#x5411;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;</strong>&#xFF0C;&#x7406;&#x89E3;&#x4E86;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x7406;&#x89E3;&#x4E86;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x7531;&#x6765;&#xFF1A;&#x7C7B;A&#x76F4;&#x63A5;&#x4F9D;&#x8D56;&#x7C7B;B&#xFF0C;&#x5047;&#x5982;&#x8981;&#x5C06;&#x7C7B;A&#x6539;&#x4E3A;&#x4F9D;&#x8D56;&#x7C7B;C&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x7C7B;A&#x7684;&#x4EE3;&#x7801;&#x6765;&#x8FBE;&#x6210;&#x3002;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x7C7B;A&#x4E00;&#x822C;&#x662F;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x8D1F;&#x8D23;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF1B;&#x7C7B;B&#x548C;&#x7C7B;C&#x662F;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x8D1F;&#x8D23;&#x57FA;&#x672C;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF1B;&#x5047;&#x5982;&#x4FEE;&#x6539;&#x7C7B;A&#xFF0C;&#x4F1A;&#x7ED9;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x5C06;&#x7C7B;A&#x4FEE;&#x6539;&#x4E3A;&#x4F9D;&#x8D56;&#x63A5;&#x53E3;I&#xFF0C;&#x7C7B;B&#x548C;&#x7C7B;C&#x5404;&#x81EA;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;I&#xFF0C;&#x7C7B;A&#x901A;&#x8FC7;&#x63A5;&#x53E3;I&#x95F4;&#x63A5;&#x4E0E;&#x7C7B;B&#x6216;&#x8005;&#x7C7B;C&#x53D1;&#x751F;&#x8054;&#x7CFB;&#xFF0C;&#x5219;&#x4F1A;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4FEE;&#x6539;&#x7C7B;A&#x7684;&#x51E0;&#x7387;&#x3002;</p>
<p>&#x672C;&#x8D28;: &#x901A;&#x8FC7;&#x62BD;&#x8C61;(&#x63A5;&#x53E3;&#x6216;&#x62BD;&#x8C61;&#x7C7B;)&#x4F7F;&#x5404;&#x4E2A;&#x7C7B;&#x6216;&#x6A21;&#x5757;&#x7684;&#x5B9E;&#x73B0;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#xFF0C;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x677E;&#x8026;&#x5408;&#x3002;</p>
<p><em>&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F;&#x76EE;&#x6807;&#xFF0C;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#x662F;&#x57FA;&#x7840;&#xFF0C;&#x4F9D;&#x8D56;&#x5012;&#x8F6C;&#x539F;&#x5219;&#x662F;&#x624B;&#x6BB5;&#xFF0C;&#x5B83;&#x4EEC;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x76F8;&#x4E92;&#x8865;&#x5145;&#xFF0C;&#x76EE;&#x6807;&#x4E00;&#x81F4;&#xFF0C;&#x53EA;&#x662F;&#x5206;&#x6790;&#x95EE;&#x9898;&#x65F6;&#x6240;&#x7AD9;&#x89D2;&#x5EA6;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#x3002;</em></p>
<h2 id="4-&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;-ISP"><a href="#4-&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;-ISP" class="headerlink" title="4. &#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219; (ISP)"></a>4. &#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219; (ISP)</h2><blockquote>
<p>&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x7684;&#x603B;&#x63A5;&#x53E3;&#xFF0C;&#x5373;&#x4E0D;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x90A3;&#x4E9B;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x63A5;&#x53E3;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x592A;&#x5927;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x5206;&#x5272;&#x6210;&#x4E00;&#x4E9B;&#x66F4;&#x7EC6;&#x5C0F;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x63A5;&#x53E3;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4EC5;&#x9700;&#x77E5;&#x9053;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x627F;&#x62C5;&#x4E00;&#x79CD;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4E0D;&#x5E72;&#x4E0D;&#x8BE5;&#x5E72;&#x7684;&#x4E8B;&#xFF0C;&#x8BE5;&#x5E72;&#x7684;&#x4E8B;&#x90FD;&#x8981;&#x5E72;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x63A5;&#x53E3;&#x201D;&#x5F80;&#x5F80;&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#xFF1A;&#x4E00;&#x79CD;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x6240;&#x5177;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x7279;&#x5F81;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x79CD;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x662F;&#x6307;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#x5177;&#x4F53;&#x7684;&#x201C;&#x63A5;&#x53E3;&#x201D;&#x5B9A;&#x4E49;&#xFF0C;&#x6709;&#x4E25;&#x683C;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;Java&#x8BED;&#x8A00;&#x4E2D;&#x7684;interface&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#xFF0C;ISP&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x542B;&#x4E49;&#x90FD;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;</p>
<p>(1) &#x5F53;&#x628A;&#x201C;&#x63A5;&#x53E3;&#x201D;&#x7406;&#x89E3;&#x6210;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x7279;&#x5F81;&#x7684;&#x96C6;&#x5408;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x63A5;&#x53E3;&#x7684;&#x5212;&#x5206;&#x5C06;&#x76F4;&#x63A5;&#x5E26;&#x6765;&#x7C7B;&#x578B;&#x7684;&#x5212;&#x5206;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x63A5;&#x53E3;&#x7406;&#x89E3;&#x6210;&#x89D2;&#x8272;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x53EA;&#x80FD;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x90FD;&#x6709;&#x5B83;&#x7279;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x201C;&#x89D2;&#x8272;&#x9694;&#x79BB;&#x539F;&#x5219;&#x201D;&#x3002;</p>
<p>(2) &#x5982;&#x679C;&#x628A;&#x201C;&#x63A5;&#x53E3;&#x201D;&#x7406;&#x89E3;&#x6210;&#x72ED;&#x4E49;&#x7684;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;ISP&#x8868;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#x6307;&#x63A5;&#x53E3;&#x4EC5;&#x4EC5;&#x63D0;&#x4F9B;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x884C;&#x4E3A;&#x5219;&#x9690;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x5E94;&#x5F53;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4F9B;&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x7684;&#x5355;&#x72EC;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x63D0;&#x4F9B;&#x5927;&#x7684;&#x603B;&#x63A5;&#x53E3;&#x3002;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x5C31;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x8BE5;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5927;&#x7684;&#x603B;&#x63A5;&#x53E3;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x4E0D;&#x4E00;&#x5B9A;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x63A5;&#x53E3;&#x7684;&#x804C;&#x8D23;&#x5355;&#x4E00;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x5927;&#x63A5;&#x53E3;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x6839;&#x636E;&#x5176;&#x804C;&#x8D23;&#x4E0D;&#x540C;&#x5206;&#x522B;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x63A5;&#x53E3;&#x4E2D;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x63A5;&#x53E3;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x90FD;&#x8F83;&#x4E3A;&#x65B9;&#x4FBF;&#xFF0C;&#x5E76;&#x90FD;&#x627F;&#x62C5;&#x67D0;&#x4E00;&#x5355;&#x4E00;&#x89D2;&#x8272;&#x3002;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x7EC6;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x63A5;&#x53E3;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x5C11;&#xFF0C;&#x6BCF;&#x4E2A;&#x63A5;&#x53E3;&#x4E2D;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x5982;&#x5B50;&#x6A21;&#x5757;&#x6216;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7C7B;&#xFF09;&#x6240;&#x9700;&#x7684;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x4E5F;&#x79F0;&#x4E3A;&#x201C;&#x5B9A;&#x5236;&#x670D;&#x52A1;&#x201D;&#xFF0C;&#x5373;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4F9B;&#x5BBD;&#x7A84;&#x4E0D;&#x540C;&#x7684;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x5EFA;&#x7ACB;&#x5355;&#x4E00;&#x63A5;&#x53E3;&#xFF0C;&#x4E0D;&#x8981;&#x5EFA;&#x7ACB;&#x5E9E;&#x5927;&#x81C3;&#x80BF;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5C3D;&#x91CF;&#x7EC6;&#x5316;&#x63A5;&#x53E3;&#xFF0C;&#x63A5;&#x53E3;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x5C3D;&#x91CF;&#x5C11;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4E3A;&#x5404;&#x4E2A;&#x7C7B;&#x5EFA;&#x7ACB;&#x4E13;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x53BB;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5F88;&#x5E9E;&#x5927;&#x7684;&#x63A5;&#x53E3;&#x4F9B;&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x5B83;&#x7684;&#x7C7B;&#x53BB;&#x8C03;&#x7528;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x4F9D;&#x8D56;&#x51E0;&#x4E2A;&#x4E13;&#x7528;&#x7684;&#x63A5;&#x53E3;&#x8981;&#x6BD4;&#x4F9D;&#x8D56;&#x4E00;&#x4E2A;&#x7EFC;&#x5408;&#x7684;&#x63A5;&#x53E3;&#x66F4;&#x7075;&#x6D3B;&#x3002;&#x63A5;&#x53E3;&#x662F;&#x8BBE;&#x8BA1;&#x65F6;&#x5BF9;&#x5916;&#x90E8;&#x8BBE;&#x5B9A;&#x7684;&#x201C;&#x5951;&#x7EA6;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x6563;&#x5B9A;&#x4E49;&#x591A;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x9884;&#x9632;&#x5916;&#x6765;&#x53D8;&#x66F4;&#x7684;&#x6269;&#x6563;&#xFF0C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x89C9;&#x7684;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x8DDF;&#x4E4B;&#x524D;&#x7684;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x5176;&#x4E00;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x539F;&#x6CE8;&#x91CD;&#x7684;&#x662F;&#x804C;&#x8D23;&#xFF1B;&#x800C;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x6CE8;&#x91CD;&#x5BF9;&#x63A5;&#x53E3;&#x4F9D;&#x8D56;&#x7684;&#x9694;&#x79BB;&#x3002;&#x5176;&#x4E8C;&#xFF0C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x4E3B;&#x8981;&#x662F;&#x7EA6;&#x675F;&#x7C7B;&#xFF0C;&#x5176;&#x6B21;&#x624D;&#x662F;&#x63A5;&#x53E3;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x548C;&#x7EC6;&#x8282;&#xFF1B;&#x800C;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x4E3B;&#x8981;&#x7EA6;&#x675F;&#x63A5;&#x53E3;&#x63A5;&#x53E3;&#xFF0C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x62BD;&#x8C61;&#xFF0C;&#x9488;&#x5BF9;&#x7A0B;&#x5E8F;&#x6574;&#x4F53;&#x6846;&#x67B6;&#x7684;&#x6784;&#x5EFA;&#x3002;</p>
<p>&#x91C7;&#x7528;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x5BF9;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x7EA6;&#x675F;&#x65F6;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x63A5;&#x53E3;&#x5C3D;&#x91CF;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6709;&#x9650;&#x5EA6;&#x3002;&#x5BF9;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x7EC6;&#x5316;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7075;&#x6D3B;&#x6027;&#x662F;&#x4E0D;&#x6323;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FC7;&#x5C0F;&#xFF0C;&#x5219;&#x4F1A;&#x9020;&#x6210;&#x63A5;&#x53E3;&#x6570;&#x91CF;&#x8FC7;&#x591A;&#xFF0C;&#x4F7F;&#x8BBE;&#x8BA1;&#x590D;&#x6742;&#x5316;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x8981;&#x9002;&#x5EA6;&#x3002;</li>
<li>&#x4E3A;&#x4F9D;&#x8D56;&#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x5B9A;&#x5236;&#x670D;&#x52A1;&#xFF0C;&#x53EA;&#x66B4;&#x9732;&#x7ED9;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x5B83;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x5219;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;&#x53EA;&#x6709;&#x4E13;&#x6CE8;&#x5730;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x5B9A;&#x5236;&#x670D;&#x52A1;&#xFF0C;&#x624D;&#x80FD;&#x5EFA;&#x7ACB;&#x6700;&#x5C0F;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x5185;&#x805A;&#xFF0C;&#x51CF;&#x5C11;&#x5BF9;&#x5916;&#x4EA4;&#x4E92;&#x3002;&#x4F7F;&#x63A5;&#x53E3;&#x7528;&#x6700;&#x5C11;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x5B8C;&#x6210;&#x6700;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
</ul>
<p>&#x8FD0;&#x7528;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x9002;&#x5EA6;&#xFF0C;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x5927;&#x6216;&#x8FC7;&#x5C0F;&#x90FD;&#x4E0D;&#x597D;&#x3002;&#x8BBE;&#x8BA1;&#x63A5;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x6709;&#x591A;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x53BB;&#x601D;&#x8003;&#x548C;&#x7B79;&#x5212;&#xFF0C;&#x624D;&#x80FD;&#x51C6;&#x786E;&#x5730;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x7531;&#x6765;&#xFF1A;&#x7C7B;A&#x901A;&#x8FC7;&#x63A5;&#x53E3;I&#x4F9D;&#x8D56;&#x7C7B;B&#xFF0C;&#x7C7B;C&#x901A;&#x8FC7;&#x63A5;&#x53E3;I&#x4F9D;&#x8D56;&#x7C7B;D&#xFF0C;&#x5982;&#x679C;&#x63A5;&#x53E3;I&#x5BF9;&#x4E8E;&#x7C7B;A&#x548C;&#x7C7B;B&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x6700;&#x5C0F;&#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x7C7B;B&#x548C;&#x7C7B;D&#x5FC5;&#x987B;&#x53BB;&#x5B9E;&#x73B0;&#x4ED6;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x5C06;&#x81C3;&#x80BF;&#x7684;&#x63A5;&#x53E3;I&#x62C6;&#x5206;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x51E0;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x7C7B;A&#x548C;&#x7C7B;C&#x5206;&#x522B;&#x4E0E;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x63A5;&#x53E3;&#x5EFA;&#x7ACB;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x91C7;&#x7528;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x3002;</p>
<p><em>&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#x548C;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x539F;&#x5219;&#x7684;&#x5BA1;&#x89C6;&#x89D2;&#x5EA6;&#x4E0D;&#x540C;</em></p>
<h2 id="5-&#x5408;&#x6210;-&#x805A;&#x5408;&#x590D;&#x7528;&#x539F;&#x5219;-CARP"><a href="#5-&#x5408;&#x6210;-&#x805A;&#x5408;&#x590D;&#x7528;&#x539F;&#x5219;-CARP" class="headerlink" title="5. &#x5408;&#x6210;/&#x805A;&#x5408;&#x590D;&#x7528;&#x539F;&#x5219; (CARP)"></a>5. &#x5408;&#x6210;/&#x805A;&#x5408;&#x590D;&#x7528;&#x539F;&#x5219; (CARP)</h2><blockquote>
<p>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x7EC4;&#x5408;&#x548C;&#x805A;&#x5408;&#x5C11;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x8FBE;&#x5230;&#x590D;&#x7528;&#x7684;&#x539F;&#x5219;&#x3002;</p>
</blockquote>
<p><em>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x5408;&#x6210;/&#x805A;&#x5408;, &#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x7C7B;&#x7EE7;&#x627F;</em></p>
<h2 id="6-&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;-LoD-&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;-LKP"><a href="#6-&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;-LoD-&#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219;-LKP" class="headerlink" title="6. &#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219; (LoD) / &#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219; (LKP)"></a>6. &#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219; (LoD) / &#x6700;&#x5C11;&#x77E5;&#x8BC6;&#x539F;&#x5219; (LKP)</h2><blockquote>
<p>&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5F53;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x4E0E;&#x5176;&#x4ED6;&#x5B9E;&#x4F53;&#x53D1;&#x751F;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7B26;&#x5408;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x5176;&#x4E2D;&#x67D0;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x53D1;&#x751F;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x5C3D;&#x91CF;&#x5C11;&#x5730;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#xFF0C;&#x6269;&#x5C55;&#x4F1A;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x8981;&#x6C42;&#x9650;&#x5236;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x6DF1;&#x5EA6;&#x3002;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x53EF;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x7684;&#x8026;&#x5408;&#x5EA6;&#xFF0C;&#x4F7F;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x4FDD;&#x6301;&#x677E;&#x6563;&#x7684;&#x8026;&#x5408;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x8FD8;&#x6709;&#x51E0;&#x79CD;&#x5B9A;&#x4E49;&#x5F62;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x4E0D;&#x8981;&#x548C;&#x201C;&#x964C;&#x751F;&#x4EBA;&#x201D;&#x8BF4;&#x8BDD;&#x3001;&#x53EA;&#x4E0E;&#x4F60;&#x7684;&#x76F4;&#x63A5;&#x670B;&#x53CB;&#x901A;&#x4FE1;&#x7B49;&#xFF0C;&#x5728;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x670B;&#x53CB;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x7C7B;&#xFF1A;</p>
<p>(1) &#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;(this)&#xFF1B;<br>(2) &#x4EE5;&#x53C2;&#x6570;&#x5F62;&#x5F0F;&#x4F20;&#x5165;&#x5230;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;<br>(3) &#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x5BF9;&#x8C61;&#xFF1B;<br>(4) &#x5982;&#x679C;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x90A3;&#x4E48;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4E5F;&#x90FD;&#x662F;&#x670B;&#x53CB;&#xFF1B;<br>(5) &#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x4E0A;&#x9762;&#x7684;&#x6761;&#x4EF6;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x7684;&#x201C;&#x670B;&#x53CB;&#x201D;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x201C;&#x964C;&#x751F;&#x4EBA;&#x201D;&#x3002;&#x5728;&#x5E94;&#x7528;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x4E0E;&#x76F4;&#x63A5;&#x670B;&#x53CB;&#x53D1;&#x751F;&#x4EA4;&#x4E92;&#xFF0C;&#x4E0D;&#x8981;&#x4E0E;&#x201C;&#x964C;&#x751F;&#x4EBA;&#x201D;&#x53D1;&#x751F;&#x76F4;&#x63A5;&#x4EA4;&#x4E92;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x7684;&#x8026;&#x5408;&#x5EA6;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6539;&#x53D8;&#x4E0D;&#x4F1A;&#x7ED9;&#x592A;&#x591A;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x5E26;&#x6765;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x4E0D;&#x5FC5;&#x5F7C;&#x6B64;&#x76F4;&#x63A5;&#x901A;&#x4FE1;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x4E0D;&#x5E94;&#x5F53;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x76F4;&#x63A5;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x8005;&#x8F6C;&#x53D1;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x3002;&#x7B80;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x7B2C;&#x4E09;&#x8005;&#x6765;&#x964D;&#x4F4E;&#x73B0;&#x6709;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x5C06;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x8FD0;&#x7528;&#x5230;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E2D;&#x65F6;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4E0B;&#x9762;&#x7684;&#x51E0;&#x70B9;&#xFF1A;&#x5728;&#x7C7B;&#x7684;&#x5212;&#x5206;&#x4E0A;&#xFF0C;&#x5E94;&#x5F53;&#x5C3D;&#x91CF;&#x521B;&#x5EFA;&#x677E;&#x8026;&#x5408;&#x7684;&#x7C7B;&#xFF0C;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x8D8A;&#x4F4E;&#xFF0C;&#x5C31;&#x8D8A;&#x6709;&#x5229;&#x4E8E;&#x590D;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x5904;&#x5728;&#x677E;&#x8026;&#x5408;&#x4E2D;&#x7684;&#x7C7B;&#x4E00;&#x65E6;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5173;&#x8054;&#x7684;&#x7C7B;&#x9020;&#x6210;&#x592A;&#x5927;&#x6CE2;&#x53CA;&#xFF1B;&#x5728;&#x7C7B;&#x7684;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x90FD;&#x5E94;&#x5F53;&#x5C3D;&#x91CF;&#x964D;&#x4F4E;&#x5176;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x548C;&#x6210;&#x5458;&#x51FD;&#x6570;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF1B;&#x5728;&#x7C7B;&#x7684;&#x8BBE;&#x8BA1;&#x4E0A;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x5E94;&#x5F53;&#x8BBE;&#x8BA1;&#x6210;&#x4E0D;&#x53D8;&#x7C7B;&#xFF1B;&#x5728;&#x5BF9;&#x5176;&#x4ED6;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5BF9;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x5E94;&#x5F53;&#x964D;&#x5230;&#x6700;&#x4F4E;&#x3002;</p>
<p>&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x7684;&#x521D;&#x8877;&#x662F;&#x964D;&#x4F4E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x51CF;&#x5C11;&#x4E86;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x6B64;&#x7684;&#x786E;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x8026;&#x5408;&#x5173;&#x7CFB;&#x3002;&#x4F46;&#x662F;&#x51E1;&#x4E8B;&#x90FD;&#x6709;&#x5EA6;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E0E;&#x975E;&#x76F4;&#x63A5;&#x7684;&#x7C7B;&#x901A;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x901A;&#x4FE1;&#xFF0C;&#x5FC5;&#x7136;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x201C;&#x4E2D;&#x4ECB;&#x201D;&#x6765;&#x53D1;&#x751F;&#x8054;&#x7CFB;&#xFF0C;&#x8FC7;&#x5206;&#x7684;&#x4F7F;&#x7528;&#x8FEA;&#x7C73;&#x7279;&#x539F;&#x5219;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x91CF;&#x8FD9;&#x6837;&#x7684;&#x4E2D;&#x4ECB;&#x548C;&#x4F20;&#x9012;&#x7C7B;&#xFF0C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x5EA6;&#x53D8;&#x5927;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x91C7;&#x7528;&#x8FEA;&#x7C73;&#x7279;&#x6CD5;&#x5219;&#x65F6;&#x8981;&#x53CD;&#x590D;&#x6743;&#x8861;&#xFF0C;&#x65E2;&#x505A;&#x5230;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#xFF0C;&#x53C8;&#x8981;<strong>&#x9AD8;&#x5185;&#x805A;&#x4F4E;&#x8026;&#x5408;</strong>&#x3002;</p>
<p>&#x95EE;&#x9898;&#x7531;&#x6765;&#xFF1A;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x8D8A;&#x5BC6;&#x5207;&#xFF0C;&#x8026;&#x5408;&#x5EA6;&#x8D8A;&#x5927;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7C7B;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5F71;&#x54CD;&#x4E5F;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x5C3D;&#x91CF;&#x964D;&#x4F4E;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x3002;</p>
<h2 id="7-&#x5F00;&#x95ED;&#x539F;&#x5219;"><a href="#7-&#x5F00;&#x95ED;&#x539F;&#x5219;" class="headerlink" title="7. &#x5F00;&#x95ED;&#x539F;&#x5219;"></a>7. &#x5F00;&#x95ED;&#x539F;&#x5219;</h2><blockquote>
<p>&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5F53;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x5173;&#x95ED;&#x3002;&#x5373;&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x5E94;&#x5C3D;&#x91CF;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;</p>
</blockquote>
<p>&#x524D;6&#x4E2A;&#x90FD;&#x662F;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5177;&#x4F53;&#x5F62;&#x6001;&#xFF0C;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x662F;&#x5176;&#x7CBE;&#x795E;&#x9886;&#x8896;&#x3002;</p>
<p>&#x5F00;&#x95ED;&#x539F;&#x5219;&#x5177;&#x6709;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x7684;&#x8272;&#x5F69;&#xFF0C;&#x5B83;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x7EC8;&#x6781;&#x76EE;&#x6807;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9488;&#x5BF9;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x6709;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x7684;&#x5927;&#x5E08;&#x8D39;&#x5C3D;&#x5FC3;&#x673A;&#xFF0C;&#x7814;&#x7A76;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x91CC;&#x6C0F;&#x66FF;&#x6362;&#x539F;&#x5219;&#xFF08;LSP&#xFF09;&#x3001;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#xFF08;DIP&#xFF09;&#x3001;&#x63A5;&#x53E3;&#x9694;&#x79BB;&#x539F;&#x5219;&#xFF08;ISP&#xFF09;&#x4EE5;&#x53CA;&#x62BD;&#x8C61;&#x7C7B;&#xFF08;Abstract Class&#xFF09;&#x3001;&#x63A5;&#x53E3;(Interface)&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x6307;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x6A21;&#x5757;&#x3001;&#x4E00;&#x4E2A;&#x7531;&#x591A;&#x4E2A;&#x7C7B;&#x7EC4;&#x6210;&#x7684;&#x5C40;&#x90E8;&#x7ED3;&#x6784;&#x6216;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7C7B;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x90FD;&#x9700;&#x8981;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5B83;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x4F1A;&#x968F;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x65B0;&#x7684;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x6846;&#x67B6;&#x662F;&#x7A33;&#x5B9A;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7B26;&#x5408;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x5730;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6269;&#x5C55;&#x65F6;&#x65E0;&#x987B;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5F97;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5728;&#x62E5;&#x6709;&#x9002;&#x5E94;&#x6027;&#x548C;&#x7075;&#x6D3B;&#x6027;&#x7684;&#x540C;&#x65F6;&#x5177;&#x5907;&#x8F83;&#x597D;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x5EF6;&#x7EED;&#x6027;&#x3002;&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x89C4;&#x6A21;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x8F6F;&#x4EF6;&#x5BFF;&#x547D;&#x8D8A;&#x6765;&#x8D8A;&#x957F;&#xFF0C;&#x8F6F;&#x4EF6;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x8BBE;&#x8BA1;&#x6EE1;&#x8DB3;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E5F;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5F00;&#x95ED;&#x539F;&#x5219;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#x5316;&#x8BBE;&#x8BA1;&#xFF0C;&#x62BD;&#x8C61;&#x5316;&#x662F;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x5173;&#x952E;&#x3002;&#x5728;Java&#x3001;C#&#x7B49;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x7CFB;&#x7EDF;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#xFF0C;&#x800C;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x884C;&#x4E3A;&#x79FB;&#x81F3;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x5C42;&#x4E2D;&#x5B8C;&#x6210;&#x3002;&#x5728;&#x5F88;&#x591A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x63A5;&#x53E3;&#x3001;&#x62BD;&#x8C61;&#x7C7B;&#x7B49;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x5B9A;&#x4E49;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x5177;&#x4F53;&#x7C7B;&#x6765;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x65E0;&#x987B;&#x5BF9;&#x62BD;&#x8C61;&#x5C42;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x5177;&#x4F53;&#x7C7B;&#x6765;&#x5B9E;&#x73B0;&#x65B0;&#x7684;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x5373;&#x53EF;&#xFF0C;&#x5B9E;&#x73B0;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x5DF2;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6269;&#x5C55;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FBE;&#x5230;&#x5F00;&#x95ED;&#x539F;&#x5219;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p><code>&#x53C2;&#x8003;: http://blog.jobbole.com/85542/</code><br><code>&#x53C2;&#x8003;: http://www.cnblogs.com/dolphin0520/</code></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/swe-dp-principle/" data-id="cj0hs2v6400es8wskw7quf9pk" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/swe-dp-principle/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/SWE/">SWE</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/设计原则/">设计原则</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/设计模式/">设计模式</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/swe-dp-metaphor/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          设计模式形象比喻
        
      </div>
    </a>
  
  
    <a href="/2016/swe-dp-overview/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">设计模式概览</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/swe-dp-principle/" data-title="设计模式七大原则" data-url="http://snowyying.github.io/2016/swe-dp-principle/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">16</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">20</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">13</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/网络/">网络</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12.22px;">C</a> <a href="/tags/C/" style="font-size: 12.22px;">C++</a> <a href="/tags/C-C/" style="font-size: 15.56px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11.11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15.56px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 11.11px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11.11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 13.33px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11.11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17.78px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13.33px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12.22px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11.11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 11.11px;">http</a> <a href="/tags/https/" style="font-size: 10px;">https</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11.11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11.11px;">poll</a> <a href="/tags/select/" style="font-size: 13.33px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11.11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16.67px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/性能/" style="font-size: 13.33px;">性能</a> <a href="/tags/成长/" style="font-size: 18.89px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16.67px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/短信/" style="font-size: 10px;">短信</a> <a href="/tags/程序员/" style="font-size: 17.78px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 17.78px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14.44px;">设计模式</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 11.11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/os-linux-construct-comic/">漫画趣解 linux 内核构造</a>
          </li>
        
          <li>
            <a href="/2017/gen-programmer-skill-map/">程序员技能图谱</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-simple-web-server/">开源 http(s) 框架 Simple Web Server</a>
          </li>
        
          <li>
            <a href="/2017/it-pay-platform-weixin/">支付平台 - APP 微信支付</a>
          </li>
        
          <li>
            <a href="/2017/net-curl-ubuntu/">Ubuntu 安装使用 curl</a>
          </li>
        
          <li>
            <a href="/2017/it-sms-platform-alidayu/">短信平台 - 阿里大于</a>
          </li>
        
          <li>
            <a href="/2017/iot-push-mqtt-protocol/">物联网 - MQTT 协议与应用</a>
          </li>
        
          <li>
            <a href="/2017/net-restful-overview/">理解 RESTful 架构</a>
          </li>
        
          <li>
            <a href="/2017/c-c-cpp-hybird-programming/">C 与 C++ 混合编程</a>
          </li>
        
          <li>
            <a href="/2017/os-io-fast-gpio/">ARM Linux 通过 mmap 操作 GPIO (快速 GPIO)</a>
          </li>
        
          <li>
            <a href="/2017/misc-key-matrix/">GPIO 的矩阵按键扫描电路</a>
          </li>
        
          <li>
            <a href="/2017/misc-fallible-it-words/">中国程序员容易发音错误的计算机相关英文单词</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>