<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：怎样才算是编程高手？ 高手的定义 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2659 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;
&amp;#x4E00;&amp;#x65E6;&amp;#x5EA6;&amp;#x8FC7;&amp;#x4E86;&amp;#x521D;&amp;#x59CB;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x505A;&amp;#x8FC7;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：怎样才算是编程高手？ 高手的定义">
<meta property="og:url" content="http://snowyying.github.io/2016/g-programming-guide-2-the-master/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2659 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;
&amp;#x4E00;&amp;#x65E6;&amp;#x5EA6;&amp;#x8FC7;&amp;#x4E86;&amp;#x521D;&amp;#x59CB;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x505A;&amp;#x8FC7;&amp;#">
<meta property="og:updated_time" content="2017-01-12T02:31:14.107Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：怎样才算是编程高手？ 高手的定义">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2659 2014&amp;#x5E74;01&amp;#x6708;18&amp;#x65E5;
&amp;#x4E00;&amp;#x65E6;&amp;#x5EA6;&amp;#x8FC7;&amp;#x4E86;&amp;#x521D;&amp;#x59CB;&amp;#x9636;&amp;#x6BB5;&amp;#xFF0C;&amp;#x505A;&amp;#x8FC7;&amp;#">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Learn and live.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-g-programming-guide-2-the-master" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：怎样才算是编程高手？ 高手的定义
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/g-programming-guide-2-the-master/" class="article-date">
  <time datetime="2016-08-05T05:13:08.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: http://www.nowamagic.net/librarys/veda/detail/2659 2014&#x5E74;01&#x6708;18&#x65E5;</code></p>
<p>&#x4E00;&#x65E6;&#x5EA6;&#x8FC7;&#x4E86;&#x521D;&#x59CB;&#x9636;&#x6BB5;&#xFF0C;&#x505A;&#x8FC7;&#x4E86;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x4EBA;&#x7B97;&#x662F;&#x57FA;&#x672C;&#x5165;&#x884C;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x8981;&#x5728;&#x9009;&#x5B9A;&#x65B9;&#x5411;&#x4E0A;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x3002;&#x9AD8;&#x624B;&#x610F;&#x5473;&#x7740;&#x4E13;&#x4E1A;&#xFF0C;&#x800C;&#x5728;&#x5206;&#x5DE5;&#x65E0;&#x9650;&#x7EC6;&#x5316;&#x7684;&#x5E74;&#x4EE3;&#x91CC;&#xFF0C;&#x4E13;&#x4E1A;&#x5219;&#x662F;&#x751F;&#x5B58;&#x3001;&#x53D1;&#x5C55;&#x597D;&#x6700;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x524D;&#x63D0;&#x3002;</p>
<p><strong>&#x9AD8;&#x624B;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x517B;&#x6210;&#x5173;&#x952E;</strong></p>
<p>&#x6211;&#x4F30;&#x8BA1;&#x5982;&#x679C;&#x95EE;100&#x4E2A;&#x4EBA;&#x201C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x9AD8;&#x624B;&#xFF1F;&#x201D;&#xFF0C;&#x90A3;&#x7B54;&#x6848;&#x4F1A;&#x6709;100&#x591A;&#x4E2A;&#x3002;&#x56E0;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x8FD8;&#x53EF;&#x80FD;&#x7ED9;&#x9AD8;&#x624B;&#x4E0B;&#x4E0D;&#x540C;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x5728;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x91CC;&#x80FD;&#x641E;&#x5B9A;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x641E;&#x4E0D;&#x5B9A;&#x4E8B;&#x60C5;&#x7684;&#x5C31;&#x662F;&#x9AD8;&#x624B;&#x3002;&#x4ECE;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x51FA;&#x53D1;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x5728;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x548C;&#x9500;&#x552E;&#x4EBA;&#x5458;&#x773C;&#x91CC;&#xFF0C;&#x9AD8;&#x624B;&#x7684;&#x5185;&#x6DB5;&#x662F;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x5F02;&#x7684;&#x3002;</p>
<p>&#x7EAF;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x66F4;&#x591A;&#x7684;&#x5173;&#x6CE8;&#x6027;&#x80FD;&#x80FD;&#x4E0D;&#x80FD;&#x63D0;&#x5230;&#x6781;&#x81F4;&#xFF0C;&#x5E76;&#x53D1;&#x80FD;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x5185;&#x5B58;&#x6EA2;&#x51FA;Bug&#x80FD;&#x4E0D;&#x80FD;&#x5F88;&#x5FEB;&#x641E;&#x5B9A;&#xFF0C;&#x7C7B;&#x5E93;&#x7684;&#x673A;&#x7406;&#x719F;&#x6089;&#x4E0D;&#x719F;&#x6089;&#x7B49;&#x7B49;&#x3002;&#x800C;&#x5728;&#x9500;&#x552E;&#x4EBA;&#x5458;&#x7684;&#x773C;&#x91CC;&#xFF0C;&#x5219;&#x5728;&#x6280;&#x672F;&#x5916;&#x8FD8;&#x591A;&#x770B;&#x4E86;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x719F;&#x4E0D;&#x719F;&#x6089;&#x3001;&#x4F7F;&#x7528;&#x6027;&#x597D;&#x4E0D;&#x597D;&#x3001;&#x80FD;&#x5426;&#x8FC5;&#x901F;&#x5BF9;&#x5E94;&#x53D8;&#x5316;&#x3001;&#x80FD;&#x5426;&#x5728;&#x9650;&#x5B9A;&#x5DE5;&#x671F;&#x548C;&#x9884;&#x7B97;&#x4E0B;&#x641E;&#x5B9A;&#x4EFB;&#x52A1;&#x7B49;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x804C;&#x573A;&#x548C;&#x4EA7;&#x54C1;&#x9500;&#x552E;&#x6709;&#x7740;&#x975E;&#x5E38;&#x7D27;&#x5BC6;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x540E;&#x4E00;&#x4E2A;&#x89C6;&#x89D2;&#xFF0C;&#x800C;&#x975E;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x6280;&#x672F;&#x89C6;&#x89D2;&#x3002;</p>
<p>&#x6709;&#x51E0;&#x7C7B;&#x672C;&#x8D28;&#x4E0A;&#x5F88;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x88AB;&#x89C6;&#x4E3A;&#x9AD8;&#x624B;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<ul>
<li>&#x80FD;&#x5199;&#x51FA;&#x5F88;&#x725B;&#x7684;&#x75C5;&#x6BD2;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x4F46;&#x5F53;&#x5E74;&#x8BFB;&#x8FC7;CIH&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x662F;&#x88AB;&#x5176;&#x7CBE;&#x5DE7;&#x7ED9;&#x9707;&#x4F4F;&#x4E86;&#x3002;&#x6B64;&#x5916;&#x4E5F;&#x8BB8;&#x641E;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x7684;&#x4E5F;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x7C7B;&#x522B;&#x91CC;&#x3002;</li>
<li>&#x80FD;&#x628A;&#x4E00;&#x5806;3D&#x56FE;&#x5F62;&#x653E;&#x5230;64K&#x7684;&#x3002;&#x4EE5;&#x524D;&#x4E13;&#x95E8;&#x6709;&#x4E2A;&#x6BD4;&#x8D5B;&#x662F;&#x5E72;&#x8FD9;&#x4E2A;&#x7684;&#xFF0C;64K&#x5927;&#x5C0F;&#x7684;EXE&#x80FD;&#x7ED9;&#x4F60;&#x653E;10&#x51E0;&#x5206;&#x949F;&#x5F88;&#x9177;&#x7684;3D&#x52A8;&#x753B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x89C1;&#x7EDD;&#x5BF9;&#x4F1A;&#x5F88;&#x9707;&#x60CA;&#x3002;</li>
<li>&#x80FD;&#x8FC5;&#x901F;&#x8C03;&#x8BD5;&#x51FA;&#x95EE;&#x9898;&#x6240;&#x5728;&#x7684;&#x3002;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x8BA9;&#x4EBA;&#x7EA0;&#x7F20;&#x5F88;&#x4E45;&#x4E5F;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x6709;&#x4EBA;&#x80FD;&#x5F88;&#x5FEB;&#x7684;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x80FD;&#x4EC5;&#x9760;&#x51E0;&#x4E2A;&#x4EBA;&#x5C31;&#x67B6;&#x8D77;&#x9AD8;&#x5E76;&#x53D1;&#x7F51;&#x7AD9;&#x7684;&#x3002;&#x65B0;&#x5174;Web2.0&#x7F51;&#x7AD9;&#x5982;&#xFF1A;Flickr&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x53EF;&#x4EE5;&#x5305;&#x62EC;Google&#xFF0C;&#x5728;&#x521D;&#x671F;&#x5F80;&#x5F80;&#x662F;&#x51E0;&#x4E2A;&#x4EBA;&#x641E;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x540D;&#x58F0;&#x4E0D;&#x663E;&#xFF0C;&#x4F46;&#x7EDD;&#x5BF9;&#x662F;&#x9AD8;&#x624B;&#x3002;</li>
<li>&#x80FD;&#x4E3B;&#x5BFC;&#x5F00;&#x53D1;&#x51FA;&#x5F88;&#x725B;&#x7684;&#x4EA7;&#x54C1;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x4E0A;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;Unix&#x548C;Linux&#x7684;&#x4F5C;&#x8005;&#x7B49;&#x3002;</li>
<li>&#x80FD;&#x4E3B;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5F80;&#x5F80;&#x66F4;&#x6709;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;Martin Fowler&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x7B97;&#x5728;&#x8FD9;&#x4E2A;&#x7C7B;&#x522B;&#x3002;</li>
<li>&#x80FD;&#x628A;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7814;&#x7A76;&#x7684;&#x7279;&#x522B;&#x725B;&#x7684;&#x3002;&#x60F3;&#x60F3;&#x5404;&#x4E2A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x521B;&#x5EFA;&#x8005;&#xFF0C;&#x60F3;&#x60F3;C++&#x7684;&#x5927;&#x725B;&#x4EEC;&#x3002;&#x5F53;&#x7136;&#x521B;&#x5EFA;&#x67D0;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x4E5F;&#x53EF;&#x4EE5;&#x5F52;&#x5230;&#x8FD9;&#x4E2A;&#x7C7B;&#x522B;&#x91CC;&#x3002;</li>
<li>&#x80FD;&#x5F00;&#x8F9F;&#x81EA;&#x5DF1;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x641E;CMMI&#x7684;Watts S. Humphrey&#x3002;</li>
<li>&#x80FD;&#x5199;&#x51FA;&#x5F88;&#x725B;&#x7684;&#x4E66;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;Windows&#x5E73;&#x53F0;&#x4E0B;&#x5199;&#x4E86;Windows&#x6838;&#x5FC3;&#x7F16;&#x7A0B;&#x7684;Jeffry Richard&#x3002;</li>
<li>&#x80FD;&#x5199;&#x51FA;&#x5F88;&#x725B;&#x7684;&#x7B97;&#x6CD5;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;Donald Knuth&#x3002;</li>
</ul>
<p>&#x2026;&#x2026;</p>
<a id="more"></a>
<p>&#x8FD9;&#x4E2A;&#x8868;&#x5E94;&#x8BE5;&#x8FD8;&#x53EF;&#x4EE5;&#x52A0;&#x957F;&#x5F88;&#x591A;&#xFF0C;&#x5355;&#x4EE5;&#x5927;&#x5BB6;&#x8BA4;&#x53EF;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x786E;&#x5B9E;&#x9AD8;&#x624B;&#x53EF;&#x4EE5;&#x4ECE;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#x5192;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x5728;&#x90A3;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8981;&#x60F3;&#x6210;&#x4E3A;&#x4E0A;&#x9762;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x9AD8;&#x624B;&#x603B;&#x662F;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x3001;&#x601D;&#x8003;&#x3001;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E9B;&#x73AF;&#x8282;&#xFF0C;&#x8FD9;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x8BF4;&#x7684;&#x3002;&#x4F46;&#x548C;&#x8F6F;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x5176;&#x5B9E;&#x591A;&#x5982;&#x725B;&#x6BDB;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x50CF;&#x5C0F;&#x8BF4;&#x91CC;&#x6B66;&#x529F;&#x79D8;&#x7C4D;&#x90A3;&#x4E48;&#x7A00;&#x7F3A;&#xFF0C;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x8BB2;&#x6EE1;&#x5730;&#x90FD;&#x662F;&#x3002;&#x8FD9;&#x5C31;&#x4F7F;&#x9009;&#x62E9;&#x548C;&#x96C6;&#x4E2D;&#x6210;&#x4E3A;&#x96BE;&#x9898;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x5F81;&#xFF08;&#x6280;&#x672F;&#x66F4;&#x8FED;&#x5FEB;&#x3001;&#x4F4E;&#x4ECB;&#x5165;&#x95E8;&#x69DB;&#x3001;&#x591A;&#x5185;&#x90E8;&#x5206;&#x91CE;&#xFF09;&#x5C31;&#x50CF;&#x94E1;&#x5200;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x65E6;&#x9009;&#x62E9;&#x51FA;&#x9519;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x4E2A;&#x4EBA;&#x7684;&#x52AA;&#x529B;&#x5207;&#x7684;&#x7C89;&#x788E;&#xFF0C;&#x4E00;&#x70B9;&#x4EF7;&#x503C;&#x4E5F;&#x7559;&#x4E0D;&#x4E0B;&#x6765;&#x3002;&#x800C;&#x4E0E;&#x6B64;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x5219;&#x662F;&#x4EBA;&#x7684;&#x9EC4;&#x91D1;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x591A; &#x2014;&#x2014; &#x4E0D;&#x8FC7;&#x662F;&#x6BD5;&#x4E1A;&#x540E;&#x7684;10&#x5E74;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x66FE;&#x7ECF;&#x6709;&#x4EBA;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x4ECE;&#x4E8B;&#x5D4C;&#x5165;&#x5F0F;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x6B64;&#x7ED9;&#x81EA;&#x5DF1;&#x4E70;&#x4E86;ARM&#x677F;&#xFF0C;&#x81EA;&#x5DF1;&#x5728;&#x5BB6;&#x91CC;&#x82B1;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x5E76;&#x5B9E;&#x8DF5;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x6700;&#x7EC8;&#x5374;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x7684;&#x539F;&#x56E0;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x5BB6;&#x505A;&#x7F51;&#x7EDC;&#x7684;&#x516C;&#x53F8;&#x3002;&#x8FD9;&#x4E2A;&#x4EBA;&#x7B49;&#x4EF7;&#x4E8E;&#x88AB;&#x8F6F;&#x4EF6;&#x7684;&#x5185;&#x90E8;&#x5206;&#x91CE;&#x8F83;&#x591A;&#xFF0C;&#x800C;&#x5F7C;&#x6B64;&#x95F4;&#x6280;&#x80FD;&#x6D41;&#x52A8;&#x6027;&#x8F83;&#x5DEE;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x8D28;&#x65A9;&#x4E86;&#x4E00;&#x5200;&#xFF0C;&#x88AB;&#x65A9;&#x6389;&#x7684;&#x5012;&#x4E0D;&#x662F;ARM&#x677F;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x5DF1;&#x4E00;&#x5E74;&#x591A;&#x7684;&#x8F9B;&#x82E6;&#x6295;&#x5165;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5F3A;&#x8C03;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#x5C06;&#x6765;&#x6709;&#x7528;&#x662F;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD8;&#x6709;&#x4E24;&#x5200;&#x5728;&#x7B49;&#x7740;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4E09;&#x5E74;&#x90FD;&#x4E0D;&#x505A;&#x8FD9;&#x4E2A;&#xFF0C;&#x4F60;&#x4ECA;&#x5929;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x66F4;&#x8FED;&#x6389;&#x4E86;&#xFF0C;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x4F60;&#x5E74;&#x7EAA;&#x589E;&#x957F;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x4E0E;&#x5927;&#x6279;&#x65B0;&#x4ECB;&#x5165;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x8FD9;&#x7C7B;&#x4E8B;&#x60C5;&#x4F7F;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x4E2D;&#x7684;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x8FD9;&#x4E8B;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x8FD9;&#x6761;&#x8DEF;&#x4E0A;&#x8D70;&#x7684;&#x987A;&#x7545;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6709;&#x4E09;&#x4E2A;<strong>&#x5173;&#x952E;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x662F;&#x8981;&#x6709;&#x4E00;&#x5F20;&#x5168;&#x5C40;&#x6027;&#x7684;&#x5730;&#x56FE;&#xFF0C;&#x4EE5;&#x4FBF;&#x9009;&#x597D;&#x65B9;&#x5411;&#xFF1B;</li>
<li>&#x4E8C;&#x662F;&#x8981;&#x77E5;&#x9053;&#x90FD;&#x6709;&#x90A3;&#x4E9B;&#x5751;&#xFF0C;&#x597D;&#x7ED5;&#x5F00;&#x5B83;&#xFF0C;&#x514D;&#x5F97;&#x6389;&#x8FDB;&#x53BB;&#x3002;</li>
<li>&#x4E09;&#x662F;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x70ED;&#x60C5;&#x548C;&#x52A8;&#x529B;&#xFF0C;&#x80FD;&#x575A;&#x6301;&#x8D70;&#x4E0B;&#x53BB;&#x3002;</li>
</ul>
<p>&#x4E0B;&#x9762;&#x5C06;&#x5206;&#x522B;&#x4ECE;&#x8FD9;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x8BF4;&#x660E;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x9014;&#x5F84;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x8FD9;&#x79CD;&#x9014;&#x5F84;&#x548C;&#x65B9;&#x6CD5;&#x4F1A;&#x56E0;&#x4E3A;&#x5177;&#x4F53;&#x76EE;&#x6807;&#x4E0D;&#x540C;&#x800C;&#x6709;&#x6240;&#x5FAE;&#x8C03;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/g-programming-guide-2-the-master/" data-id="ciyv7csft001rfwsk3fimhwm9" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/g-programming-guide-2-the-master/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/g-programming-guide-3-direction/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：程序员的几个职场发展方向 职场该如何走？
        
      </div>
    </a>
  
  
    <a href="/2016/g-programming-guide-1-origin/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：缘起 专治各种迷茫</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/g-programming-guide-2-the-master/" data-title="码路指南：怎样才算是编程高手？ 高手的定义" data-url="http://snowyying.github.io/2016/g-programming-guide-2-the-master/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0] 
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">14</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">19</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">10</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 11.67px;">C</a> <a href="/tags/C/" style="font-size: 11.67px;">C++</a> <a href="/tags/C-C/" style="font-size: 15px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 10.83px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 14.17px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 10.83px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 11.67px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 10.83px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17.5px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 12.5px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 11.67px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 10.83px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 10.83px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 10.83px;">poll</a> <a href="/tags/select/" style="font-size: 12.5px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 10.83px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 15.83px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/性能/" style="font-size: 12.5px;">性能</a> <a href="/tags/成长/" style="font-size: 19.17px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 15.83px;">指南</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 10.83px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/程序员/" style="font-size: 18.33px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 16.67px;">网络</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 13.33px;">设计模式</a> <a href="/tags/软件质量/" style="font-size: 10.83px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">七月 2016</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/it-manage-redmine/">IT 项目管理工具 Redmine</a>
          </li>
        
          <li>
            <a href="/2017/misc-radio-spectrum/">无线电波段和频谱</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-12-snmp/">TCP/IP 协议 - SNMP</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-11-tcp-protocol/">TCP/IP 协议 - TCP 协议</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-10-dns/">TCP/IP 协议 - DNS</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>