<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>轻松记住大端小端的含义 (附对大端和小端的解释) | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA;: &amp;#x535A;&amp;#x5BA2;&amp;#x56ED; http://www.cnblogs.com/wuyuegb2312/archive/2013/06/08/3126510.html 2013-06-08

&amp;#x5C0F;&amp;#x7AEF;&amp;#x5B58;&amp;#x50A8;&amp;#xFF08;Little Endian&amp;#xFF09;
&amp;#x3000;&amp;#x3000;">
<meta property="og:type" content="article">
<meta property="og:title" content="轻松记住大端小端的含义 (附对大端和小端的解释)">
<meta property="og:url" content="http://snowyying.github.io/2016/os-big-little-endian/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA;: &amp;#x535A;&amp;#x5BA2;&amp;#x56ED; http://www.cnblogs.com/wuyuegb2312/archive/2013/06/08/3126510.html 2013-06-08

&amp;#x5C0F;&amp;#x7AEF;&amp;#x5B58;&amp;#x50A8;&amp;#xFF08;Little Endian&amp;#xFF09;
&amp;#x3000;&amp;#x3000;">
<meta property="og:image" content="http://snowyying.github.io/2016/os-big-little-endian/08153946-05d0c7f220ec42da8f854f37c9719947.png">
<meta property="og:image" content="http://snowyying.github.io/2016/os-big-little-endian/08165259-3348937a49f34cbc996959ff2b23568e.jpg">
<meta property="og:updated_time" content="2017-01-12T06:00:44.498Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="轻松记住大端小端的含义 (附对大端和小端的解释)">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA;: &amp;#x535A;&amp;#x5BA2;&amp;#x56ED; http://www.cnblogs.com/wuyuegb2312/archive/2013/06/08/3126510.html 2013-06-08

&amp;#x5C0F;&amp;#x7AEF;&amp;#x5B58;&amp;#x50A8;&amp;#xFF08;Little Endian&amp;#xFF09;
&amp;#x3000;&amp;#x3000;">
<meta name="twitter:image" content="http://snowyying.github.io/2016/os-big-little-endian/08153946-05d0c7f220ec42da8f854f37c9719947.png">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Learn and live.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-os-big-little-endian" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      轻松记住大端小端的含义 (附对大端和小端的解释)
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/os-big-little-endian/" class="article-date">
  <time datetime="2016-09-01T07:16:12.000Z" itemprop="datePublished">2016-09-01</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/OS/">OS</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: &#x535A;&#x5BA2;&#x56ED; http://www.cnblogs.com/wuyuegb2312/archive/2013/06/08/3126510.html 2013-06-08</code></p>
<blockquote>
<p>&#x5C0F;&#x7AEF;&#x5B58;&#x50A8;&#xFF08;Little Endian&#xFF09;</p>
<p>&#x3000;&#x3000;&#x5B57;&#x8282;&#x6216;&#x534A;&#x5B57;&#x8282;&#x7684;&#x6700;&#x4F4E;&#x4F4D;&#x5B57;&#x8282;&#xFF08;Lowest&#x3002;&#x5B57;&#x8282;&#x6216;&#x534A;&#x5B57;&#x8282;&#x7684;&#x6700;&#x4F4E;&#x4F4D;&#x5B57;&#x8282;&#xFF08;Lowest Significant Bit&#xFF0C;LSB&#xFF09;&#x5B58;&#x653E;&#x4E8E;&#x5185;&#x5B58;&#x6700;&#x4F4E;&#x4F4D;&#x5B57;&#x8282;&#x5730;&#x5740;&#x4E0A;&#x3002;<br>&#x5373;&#x6700;&#x4F4E;&#x5730;&#x5740;&#x5B58;&#x653E;&#x7684;&#x6700;&#x4F4E;&#x5B57;&#x8282;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x7684;32&#x4F4D;&#x6570;&#x636E;&#xFF1A;12345678H&#xFF0C;&#x5B58;&#x653E;&#x5728;&#x5B58;&#x50A8;&#x5B57;&#x957F;&#x662F;32&#x4F4D;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x4E2D;&#xFF0C;&#x6309;&#x4F4E;&#x5B57;&#x8282;&#x5230;&#x9AD8;&#x5B57;&#x8282;&#x7684;&#x5B58;&#x50A8;&#x987A;&#x5E8F;&#x4E3A;0x78&#x3001;0x56&#x3001;0x34&#x548C;0x12&#x3002;&#x6574;&#x4E2A;&#x5B58;&#x50A8;&#x5B57;&#x4ECE;&#x4F4E;&#x5B57;&#x8282;&#x5230;&#x9AD8;&#x5B57;&#x8282;&#x8BFB;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF1A;78563412H&#xFF0C;&#x4E3A;Intel x86 &#x7CFB;&#x5217;&#x7B49;&#x91C7;&#x7528;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6216;&#x8BB8;&#x4F60;&#x66FE;&#x7ECF;&#x4ED4;&#x7EC6;&#x4E86;&#x89E3;&#x8FC7;&#x4EC0;&#x4E48;&#x662F;&#x5927;&#x7AEF;&#x5C0F;&#x7AEF;&#xFF0C;&#x4E5F;&#x52A8;&#x624B;&#x7F16;&#x5199;&#x4E86;&#x6D4B;&#x8BD5;&#x624B;&#x5934;&#x4E0A;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x662F;&#x5927;&#x7AEF;&#x8FD8;&#x662F;&#x5C0F;&#x7AEF;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x7F16;&#x5199;&#x4E86;&#x5927;&#x7AEF;&#x5C0F;&#x7AEF;&#x8F6C;&#x6362;&#x7A0B;&#x5E8F;&#xFF1B;&#x4F46;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x5F53;&#x4F60;&#x518D;&#x770B;&#x5230;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x773C;&#xFF0C;&#x4F60;&#x7684;&#x8111;&#x4E2D;&#x5F88;&#x5FEB;&#x6D6E;&#x8D77;&#x4E86;&#x81EA;&#x5DF1;&#x66FE;&#x7ECF;&#x505A;&#x8FC7;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5374;&#x603B;&#x662F;&#x60F3;&#x4E0D;&#x8D77;&#x7A76;&#x7ADF;&#x54EA;&#x79CD;&#x662F;&#x5927;&#x7AEF;&#x3001;&#x54EA;&#x79CD;&#x662F;&#x5C0F;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x53BB;&#x67E5;&#x4EE5;&#x524D;&#x5199;&#x7684;&#x8BB0;&#x5F55;&#xFF1F;&#x66F4;&#x8BA9;&#x4EBA;&#x4E0D;&#x5FEB;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x7ECF;&#x5386;&#x53CD;&#x53CD;&#x590D;&#x590D;&#xFF0C;&#x8BA9;&#x4F60;&#x5341;&#x5206;&#x56F0;&#x6270;&#x3002;&#x5982;&#x679C;&#x4F60;&#x548C;&#x4EE5;&#x524D;&#x7684;&#x7B14;&#x8005;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x8FC7;&#x8FD9;&#x79CD;&#x4E0D;&#x5FEB;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5E0C;&#x671B;&#x80FD;&#x5E2E;&#x4F60;&#x5F7B;&#x5E95;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x82E6;&#x607C;&#xFF0C;&#x8BA9;&#x4F60;&#x5F7B;&#x5E95;&#x8BB0;&#x4F4F;&#x5B83;&#x4EEC;&#x3002;&#x3000;</p>
</blockquote>
<a id="more"></a>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#x4EE5;&#x81F3;&#x4E8E;&#x5BF9;&#x5B83;&#x4EEC;&#x5341;&#x5206;&#x719F;&#x6089;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#x5728;&#x4FDD;&#x6301;&#x65F6;&#x95F4;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x7CBE;&#x51C6;&#x5EA6;&#x4E0A;&#x90FD;&#x5341;&#x5206;&#x4F18;&#x79C0;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x501F;&#x52A9;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E0D;&#x9002;&#x5408;&#x4F60;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x5728;&#x770B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x524D;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x672C;&#x6587;&#x7684;&#x9644;&#x5F55;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x535A;&#x6587;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x4ECB;&#x7ECD;&#x975E;&#x5E38;&#x4E4B;&#x591A;&#xFF0C;&#x800C;&#x9644;&#x5F55;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x5E38;&#x89C1;&#x89E3;&#x91CA;&#x548C;&#x4E00;&#x6BB5;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6765;&#x770B;&#x6B63;&#x6587;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x8BB0;&#x5FC6;&#xFF0C;&#x7406;&#x89E3;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF1B;&#x800C;&#x8BB0;&#x5FC6;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BB0;&#x4F4F;&#x5B83;&#xFF0C;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x95EE;&#xFF0C;&#x5148;&#x4E86;&#x89E3;&#x6982;&#x5FF5;&#xFF0C;&#x7528;&#x7684;&#x65F6;&#x5019;&#x518D;&#x67E5;&#xFF0C;&#x4E0D;&#x884C;&#x4E48;&#xFF1F;&#x5176;&#x5B9E;&#x6211;&#x4E4B;&#x524D;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#x7684;&#x3002;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#x8FD9;&#x4E24;&#x4E2A;&#x540D;&#x8BCD;&#xFF0C;&#x4F60;&#x4F1A;&#x5728;&#x5F88;&#x591A;&#x6709;&#x5173;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x3001;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3001;&#x751A;&#x81F3;&#x662F;&#x4EE3;&#x7801;&#x5199;&#x4F5C;&#x7684;&#x4E66;&#x4E0A;&#x770B;&#x5230;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x7684;&#x7B14;&#x8BD5;&#x9898;&#x3001;&#x9762;&#x8BD5;&#x9898;&#x70ED;&#x95E8;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x89C1;&#x5B83;&#x5728;&#x4E00;&#x4E9B;&#x9886;&#x57DF;&#x662F;&#x5F88;&#x5E38;&#x7528;&#x3002;&#x5982;&#x679C;&#x7B49;&#x5230;&#x4F60;&#x7528;&#x7684;&#x65F6;&#x5019;&#x518D;&#x67E5;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x8981;&#x964D;&#x4F4E;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5E94;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x67E5;&#x5C31;&#x80FD;&#x67E5;&#x7684;&#xFF1B;&#x5176;&#x5B9E;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x638C;&#x63E1;&#x89C4;&#x5F8B;&#x540E;&#xFF0C;&#x8BB0;&#x4F4F;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x3000;&#x3000;&#x73B0;&#x5728;&#x5148;&#x6765;&#x7406;&#x89E3;&#x8FD9;&#x5BF9;&#x6982;&#x5FF5;&#xFF0C;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#x8FD9;&#x4E24;&#x4E2A;&#x4EE4;&#x4EBA;&#x8FF7;&#x60D1;&#x7684;&#x672F;&#x8BED;&#x7A76;&#x7ADF;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#xFF1F;&#x300A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5B9E;&#x8DF5;&#x300B;&#x7B2C;9&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#xFF0C;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x7AEF;&#x201D;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;1726&#x5E74;&#x7684;Jonathan Swift&#x7684;&#x300A;&#x683C;&#x5217;&#x4F5B;&#x6E38;&#x8BB0;&#x300B;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x7BC7;&#x8BB2;&#x5230;&#x6709;&#x4E24;&#x4E2A;&#x56FD;&#x5BB6;&#x56E0;&#x4E3A;&#x5403;&#x9E21;&#x86CB;&#x7A76;&#x7ADF;&#x662F;&#x5148;&#x6253;&#x7834;&#x8F83;&#x5927;&#x7684;&#x4E00;&#x7AEF;&#x8FD8;&#x662F;&#x5148;&#x6253;&#x7834;&#x8F83;&#x5C0F;&#x7684;&#x4E00;&#x7AEF;&#x800C;&#x4E89;&#x6267;&#x4E0D;&#x4F11;&#xFF0C;&#x751A;&#x81F3;&#x7206;&#x53D1;&#x4E86;&#x6218;&#x4E89;&#x3002;1981&#x5E74;10&#x6708;&#xFF0C;Danny Cohen&#x7684;&#x6587;&#x7AE0;&#x300A;&#x8BBA;&#x5723;&#x6218;&#x4EE5;&#x53CA;&#x5BF9;&#x548C;&#x5E73;&#x7684;&#x7948;&#x7977;&#x300B;&#xFF08;On holy wars and a plea for peace&#xFF09;&#x5C06;&#x8FD9;&#x4E00;&#x5BF9;&#x8BCD;&#x8BED;&#x5F15;&#x5165;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x754C;&#x3002;&#x8FD9;&#x4E48;&#x770B;&#x6765;&#xFF0C;&#x6240;&#x8C13;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;big-endian&#x548C;little-endian&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4ECE;&#x63CF;&#x8FF0;&#x9E21;&#x86CB;&#x7684;&#x90E8;&#x4F4D;&#x800C;&#x5F15;&#x7533;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5730;&#x5740;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4FDA;&#x8BED;&#x884D;&#x5316;&#x6765;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x672F;&#x8BED;&#x3002;&#x7A0D;&#x6709;&#x4E9B;&#x82F1;&#x8BED;&#x5E38;&#x8BC6;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x9760;&#x5B57;&#x9762;&#x610F;&#x601D;&#x6765;&#x7406;&#x89E3;&#x4FDA;&#x8BED;&#xFF0C;&#x90A3;&#x662F;&#x5F88;&#x96BE;&#x731C;&#x5230;&#x5B83;&#x7684;&#x6B63;&#x786E;&#x542B;&#x4E49;&#x7684;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#xFF0C;&#x5BF9;&#x4E8E;&#x5730;&#x5740;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5F88;&#x5C11;&#x7528;&#x201C;&#x5927;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x201D;&#x6765;&#x5F62;&#x5BB9;&#xFF1B;&#x5BF9;&#x5E94;&#x5730;&#xFF0C;&#x7528;&#x7684;&#x66F4;&#x591A;&#x7684;&#x662F;&#x201C;&#x9AD8;&#x201D;&#x548C;&#x201C;&#x4F4E;&#x201D;&#xFF1B;&#x5F88;&#x4E0D;&#x5E78;&#x5730;&#xFF0C;&#x8FD9;&#x5BF9;&#x672F;&#x8BED;&#x76F4;&#x63A5;&#x6309;&#x5B57;&#x9762;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x5C31;&#x6210;&#x4E86;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x7AEF;&#x201D;&#xFF0C;&#x8BA9;&#x4EBA;&#x4EA7;&#x751F;&#x8FF7;&#x60D1;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x5947;&#x602A;&#x7684;&#x4E8B;&#x4E86;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4E0D;&#x8FC7;&#x7ED9;&#x6211;&#x542F;&#x53D1;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x88D8;&#x5B97;&#x71D5;&#x7FFB;&#x8BD1;&#x7684;&#x300A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5B9E;&#x8DF5;&#x300B;&#x91CC;&#xFF0C;&#x8FD9;&#x5BF9;&#x672F;&#x8BED;&#x5E76;&#x6CA1;&#x6709;&#x7FFB;&#x8BD1;&#x4E3A;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x548C;&#x5C0F;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x201C;&#x9AD8;&#x5C3E;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x4F4E;&#x5C3E;&#x7AEF;&#x201D;&#xFF0C;&#x8FD9;&#x5C31;&#x597D;&#x7406;&#x89E3;&#x4E86;&#xFF1A;&#x5982;&#x679C;&#x628A;&#x4E00;&#x4E2A;&#x6570;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6BD4;&#x5982;11223344&#x770B;&#x6210;&#x201D;11223344&#x201D;&#xFF0C;&#x672B;&#x5C3E;&#x662F;&#x4E2A;&#x2019;\0&#x2019;&#xFF0C;&#x2019;11&#x2019;&#x5230;&#x2019;44&#x2019;&#x4E2A;&#x5360;&#x7528;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x5C3E;&#x7AEF;&#x5F88;&#x663E;&#x7136;&#x662F;44&#xFF0C;&#x524D;&#x9762;&#x7684;&#x9AD8;&#x8FD8;&#x662F;&#x4F4E;&#x5C31;&#x8868;&#x793A;&#x5C3E;&#x7AEF;&#x653E;&#x5728;&#x9AD8;&#x5730;&#x5740;&#x8FD8;&#x662F;&#x4F4E;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x653E;&#x6CD5;&#x975E;&#x5E38;&#x76F4;&#x89C2;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="/2016/os-big-little-endian/08153946-05d0c7f220ec42da8f854f37c9719947.png" alt=""></p>
<p>&#x3000;&#x3000;&#x201C;&#x9AD8;/&#x4F4E;&#x5C3E;&#x7AEF;&#x201D;&#x6BD4;&#x201C;&#x5927;/&#x5C0F;&#x7AEF;&#x201D;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x8FF7;&#x60D1;&#x3002;&#x4F46;&#x662F;&#x6839;&#x636E;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#xFF0C;&#x5728;&#x5E02;&#x9762;&#x4E0A;&#x7684;&#x4E66;&#x7C4D;&#x3001;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5404;&#x79CD;&#x8D44;&#x6599;&#x4E2D;&#xFF0C;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x524D;&#x8005;&#x5DF2;&#x7ECF;&#x5F88;&#x5C11;&#x89C1;&#x4E86;&#xFF0C;&#x591A;&#x89C1;&#x7684;&#x662F;&#x540E;&#x8005;&#x3002;&#x597D;&#x5728;&#x8FD9;&#x4E24;&#x5BF9;&#x5F62;&#x5BB9;&#x8BCD;&#x4E2D;&#xFF0C;&#x6070;&#x597D;&#x201C;&#x9AD8;&#x201D;&#x548C;&#x201C;&#x5927;&#x201D;&#x5BF9;&#x5E94;&#xFF0C;&#x201C;&#x4F4E;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x201D;&#x5BF9;&#x5E94;&#xFF1B;&#x65E2;&#x7136;&#x9AD8;&#x5C3E;&#x7AEF;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x5927;&#x7AEF;&#xFF0C;&#x4F4E;&#x5C3E;&#x7AEF;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x5C0F;&#x7AEF;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4F60;&#x518D;&#x89C1;&#x5230;&#x5927;&#x7AEF;&#x548C;&#x5C0F;&#x7AEF;&#x8FD9;&#x4E00;&#x5BF9;&#x672F;&#x8BED;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8111;&#x4E2D;&#x628A;&#x5B83;&#x4EEC;&#x8F6C;&#x5316;&#x6210;&#x9AD8;&#x5C3E;&#x7AEF;&#x548C;&#x4F4E;&#x5C3E;&#x7AEF;&#xFF0C;&#x8FD9;&#x65F6;&#x51ED;&#x7740;&#x4E4B;&#x524D;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x7528;&#x56DE;&#x5FC6;&#xFF0C;&#x60F3;&#x7740;&#x9AD8;&#x4F4E;&#x7684;&#x5B57;&#x9762;&#x542B;&#x4E49;&#x5C31;&#x80FD;&#x56DE;&#x60F3;&#x8D77;&#x5B83;&#x4EEC;&#x7684;&#x542B;&#x4E49;&#x3002;&#x4F46;&#x662F;&#x5F88;&#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x88D8;&#x5B97;&#x71D5;&#x7FFB;&#x8BD1;&#x7684;&#x300A;&#x7F16;&#x7A0B;&#x539F;&#x672C;&#x300B;&#xFF08;Elements of Programming&#xFF09;&#xFF0C;&#x5374;&#x628A;big-endian&#x7FFB;&#x8BD1;&#x6210;&#x5927;&#x5C3E;&#x683C;&#x5F0F;&#xFF08;&#x7B2C;&#x4E00;&#x7AE0;&#xFF09;&#x3002;</p>
<p>&#x3000;  &#x7406;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x8BB0;&#x5FC6;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;</p>
<pre><code>&#xFF08;&#x6570;&#x636E;&#x770B;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x5927;&#x7AEF;&#x2014;&#x2014;&#x9AD8;&#x5C3E;&#x7AEF;&#xFF0C;&#x5C0F;&#x7AEF;&#x2014;&#x2014;&#x4F4E;&#x5C3E;&#x7AEF;
</code></pre><p>&#x3000;&#x3000;&#x7A0D;&#x4E00;&#x601D;&#x7D22;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x9AD8;&#x201D;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x201D;&#x4F4E;&#x201D;&#xFF0C;&#x201D;&#x5C3E;&#x7AEF;&#x201D;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x95EE;&#x9898;&#x8FCE;&#x5203;&#x800C;&#x89E3;&#xFF0C;&#x518D;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x88AB;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x7AEF;&#x201D;&#x8FF7;&#x60D1;&#x3002;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x653E;&#x5F03;&#x539F;&#x5148;&#x7684;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x548C;&#x5BB9;&#x6613;&#x628A;&#x81EA;&#x5DF1;&#x7ED5;&#x8FDB;&#x53BB;&#x800C;&#x53D1;&#x751F;&#x8FF7;&#x60D1;&#x7684;&#x7406;&#x89E3;&#x4E86;&#x3002;</p>
<p>&#x9644;&#x5F55;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x5C0F;&#x7AEF;&#x201D;&#x53CA;&#x4E00;&#x6BB5;&#x6D4B;&#x8BD5;&#x672C;&#x673A;&#x5927;&#x7AEF;&#x8FD8;&#x662F;&#x5C0F;&#x7AEF;&#x7684;&#x4EE3;&#x7801;</p>
<p>&#x3000;&#x3000;&#xFF08;&#x8FD9;&#x6BB5;&#x6587;&#x5B57;&#x662F;&#x300A;UNIX&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#xB7;&#x5377;&#x4E00;&#x300B;&#x7684;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x6982;&#x62EC;&#xFF1B;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x4E66;&#x7C4D;&#x90FD;&#x662F;&#x8FD9;&#x4E48;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#xFF0C;&#x4F60;&#x4F1A;&#x5728;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x76F8;&#x5173;&#x4E0D;&#x540C;&#x9886;&#x57DF;&#x7684;&#x4E66;&#x4E2D;&#x9047;&#x5230;&#x5B83;&#x4EEC;&#x3002;&#x5C3D;&#x7BA1;&#x5F88;&#x4EE4;&#x4EBA;&#x7591;&#x60D1;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9605;&#x8BFB;&#x6B63;&#x6587;&#x524D;&#xFF0C;&#x4F60;&#x6700;&#x597D;&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x8BED;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x6240;&#x7406;&#x89E3;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x524D;&#x5411;&#x6B63;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x6837;&#x63A5;&#x89E6;&#x8FC7;&#x5B83;&#x4EEC;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x5FC5;&#x8BFB;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E86;&#x3002;&#x8BFB;&#x5B8C;&#x540E;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x4F60;&#x867D;&#x7136;&#x7406;&#x89E3;&#x4E86;&#x542B;&#x4E49;&#xFF0C;&#x4F46;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x6389;&#xFF0C;&#x8FD9;&#x65F6;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x6B63;&#x6587;&#x90E8;&#x5206;&#x4E86;&#xFF09;</p>
<p>&#x3000;&#x3000;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7531;2&#x4E2A;&#x5B57;&#x8282;&#x7EC4;&#x6210;&#x7684;16&#x4F4D;&#x6574;&#x6570;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x50A8;&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x79CD;&#x662F;&#x5C06;&#x4F4E;&#x5E8F;&#x5B57;&#x8282;&#x5B58;&#x50A8;&#x5728;&#x8D77;&#x59CB;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x5C0F;&#x7AEF;(little-endian)&#x5B57;&#x8282;&#x5E8F;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x9AD8;&#x5E8F;&#x5B57;&#x8282;&#x5B58;&#x50A8;&#x5728;&#x8D77;&#x59CB;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x79F0;&#x4E3A;&#x5927;&#x7AEF;(big-endian)&#x5B57;&#x8282;&#x5E8F;&#x3002;</p>
<p><img src="/2016/os-big-little-endian/08165259-3348937a49f34cbc996959ff2b23568e.jpg" alt=""></p>
<p>&#x3000;&#x3000;&#x5728;&#x56FE;&#x4E2D;&#xFF0C;&#x9876;&#x90E8;&#x8868;&#x660E;&#x5185;&#x5B58;&#x5730;&#x5740;&#x589E;&#x957F;&#x65B9;&#x5411;&#x4ECE;&#x53F3;&#x5230;&#x5DE6;&#xFF0C;&#x5728;&#x5E95;&#x90E8;&#x6807;&#x660E;&#x5185;&#x5B58;&#x5730;&#x5740;&#x589E;&#x957F;&#x7684;&#x65B9;&#x5411;&#x4E3A;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x3002;&#x5E76;&#x4E14;&#x8FD8;&#x6807;&#x660E;&#x6700;&#x9AD8;&#x6709;&#x6548;&#x4F4D;(most significant bit&#xFF0C;MSB)&#x662F;&#x8FD9;&#x4E2A;16&#x4F4D;&#x503C;&#x6700;&#x5DE6;&#x8FB9;&#x4E00;&#x4F4D;&#xFF0C;&#x6700;&#x4F4E;&#x6709;&#x6548;&#x4F4D;(least significant bit, LSB)&#x662F;&#x8FD9;&#x4E2A;16&#x4F4D;&#x503C;&#x6700;&#x53F3;&#x8FB9;&#x4E00;&#x4F4D;&#x3002;&#x672F;&#x8BED;&#x201C;&#x5C0F;&#x7AEF;&#x201D;&#x548C;&#x201C;&#x5927;&#x7AEF;&#x201D;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x5B57;&#x8282;&#x503C;&#x7684;&#x54EA;&#x4E00;&#x7AEF;&#xFF08;&#x5C0F;&#x7AEF;&#x6216;&#x5927;&#x7AEF;&#xFF09;&#x5B58;&#x50A8;&#x5728;&#x8BE5;&#x503C;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x3002;</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x4E24;&#x79CD;&#x5B57;&#x8282;&#x5E8F;&#x6CA1;&#x6709;&#x6807;&#x51C6;&#x53EF;&#x5FAA;&#xFF0C;&#x90FD;&#x6709;&#x7CFB;&#x7EDF;&#x5728;&#x4F7F;&#x7528;&#x3002;&#x628A;&#x67D0;&#x4E2A;&#x7ED9;&#x5B9A;&#x7CFB;&#x7EDF;&#x6240;&#x7528;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x79F0;&#x4E3A;&#x4E3B;&#x673A;&#x5B57;&#x8282;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4EE5;&#x4E0B;&#x7A0B;&#x5E8F;&#x8F93;&#x51FA;&#x4E3B;&#x673A;&#x5B57;&#x8282;&#x5E8F;&#x3002;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x77ED;&#x6574;&#x6570;&#x53D8;&#x91CF;&#x4E2D;&#x5B58;&#x653E;2&#x5B57;&#x8282;&#x7684;&#x503C;0x0102&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x770B;&#x5B83;&#x7684;&#x8FDE;&#x7EED;&#x5B57;&#x8282;c[0]&#xFF08;&#x5BF9;&#x5E94;&#x4E0A;&#x56FE;&#x5730;&#x5740;A&#xFF09;&#x548C;c<a href="&#x5BF9;&#x5E94;&#x4E0A;&#x56FE;&#x5730;&#x5740;A+1">1</a>&#xFF0C;&#x4EE5;&#x6B64;&#x786E;&#x5B9A;&#x5B57;&#x8282;&#x5E8F;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/os-big-little-endian/" data-id="ciy78n35v008yc4skwsebvogv" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/os-big-little-endian/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Big-Endian/">Big-Endian</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Little-Endian/">Little-Endian</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/大小端/">大小端</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/misc-sqlite3-usage/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          Sqlite3 使用总结
        
      </div>
    </a>
  
  
    <a href="/2016/g-programming-guide-8-dream/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：保持内心的青春与理想 理想驱动编程</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/os-big-little-endian/" data-title="轻松记住大端小端的含义 (附对大端和小端的解释)" data-url="http://snowyying.github.io/2016/os-big-little-endian/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0] 
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">14</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">21</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12.22px;">C</a> <a href="/tags/C/" style="font-size: 12.22px;">C++</a> <a href="/tags/C-C/" style="font-size: 14.44px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11.11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 13.33px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11.11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 10px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11.11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 16.67px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13.33px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 11.11px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11.11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11.11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/select/" style="font-size: 12.22px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11.11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 15.56px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/性能/" style="font-size: 13.33px;">性能</a> <a href="/tags/成长/" style="font-size: 18.89px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 15.56px;">指南</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/程序员/" style="font-size: 17.78px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 16.67px;">网络</a> <a href="/tags/设计模式/" style="font-size: 13.33px;">设计模式</a> <a href="/tags/软件质量/" style="font-size: 11.11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">13</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">17</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">七月 2016</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/it-manage-redmine/">IT 项目管理工具 Redmine</a>
          </li>
        
          <li>
            <a href="/2017/misc-radio-spectrum/">无线电波段和频谱</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-11-tcp-protocol/">TCP/IP 协议 - TCP 协议</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-10-dns/">TCP/IP 协议 - DNS</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-9-igmp/">TCP/IP 协议 - IGMP</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>