<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="Snowyying&apos;s blog">
<meta property="og:type" content="website">
<meta property="og:title" content="Snowyying">
<meta property="og:url" content="http://snowyying.github.io/page/2/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="Snowyying&apos;s blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Snowyying">
<meta name="twitter:description" content="Snowyying&apos;s blog">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Learn and live.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main">
  
    <article id="post-run-32b-on-64b-ubuntu" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/run-32b-on-64b-ubuntu/">run a 32-bit executable file on a 64-bit multi-architecture Ubuntu system</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/run-32b-on-64b-ubuntu/" class="article-date">
  <time datetime="2016-08-03T11:07:13.000Z" itemprop="datePublished">2016-08-03</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Embedded/">Embedded</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="Method-1"><a href="#Method-1" class="headerlink" title="Method 1"></a>Method 1</h2><p>To run a 32-bit executable file on a 64-bit multi-architecture Ubuntu system, you have to add the i386 architecture and install the three library packages libc6:i386, libncurses5:i386, and libstdc++6:i386:</p>
<figure class="highlight sh"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">sudo dpkg --add-architecture i386</div></pre></td></tr></table></figure>
<p>Or if you are using Ubuntu 12.04 LTS (Precise Pangolin) or below, use this:</p>
<figure class="highlight sh"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line"><span class="built_in">echo</span> <span class="string">&quot;foreign-architecture i386&quot;</span> &gt; /etc/dpkg/dpkg.cfg.d/multiarch</div></pre></td></tr></table></figure>
<p>Then:</p>
<figure class="highlight sh"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">sudo apt-get update</div><div class="line">sudo apt-get install libc6:i386 libncurses5:i386 libstdc++6:i386</div></pre></td></tr></table></figure>
<p>After these steps, you should be able to run the 32-bit application:</p>
<figure class="highlight sh"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">./example32bitprogram</div></pre></td></tr></table></figure>
<h2 id="Method-2"><a href="#Method-2" class="headerlink" title="Method 2"></a>Method 2</h2><figure class="highlight sh"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">sudo apt-get install ia32-libs</div></pre></td></tr></table></figure>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/run-32b-on-64b-ubuntu/" data-id="civhpztho002fuwskuuwdr77g" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/run-32b-on-64b-ubuntu/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/32-bit/">32-bit</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/Ubuntu/">Ubuntu</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-lead-the-industry" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/lead-the-industry/">想在IT行业牛B起来, 看他说了些什么... (年轻人必读)</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/lead-the-industry/" class="article-date">
  <time datetime="2016-08-02T13:50:05.000Z" itemprop="datePublished">2016-08-02</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Manage/">Manage</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: CSDN&#x535A;&#x5BA2; &#x7A0B;&#x5E8F;&#x4EBA;&#x751F; 2015-05-27</code></p>
<p>&#x6700;&#x8FD1;&#x6536;&#x5230;&#x4E00;&#x4E9B;&#x5728;&#x6821;&#x5927;&#x5B66;&#x751F;&#x7684;&#x6765;&#x4FE1;&#xFF0C;&#x8BE2;&#x95EE;&#x5927;&#x5B66;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#x5B66;&#x4E60;&#xFF0C;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x4EC0;&#x4E48;&#x65B9;&#x5411;&#x5B66;&#x4E60;&#x4EC0;&#x4E48;&#x6280;&#x672F;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x4E3A;&#x5DE5;&#x4F5C;&#x51C6;&#x5907;&#x2026;&#x2026; &#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x95EE;&#x4EFF;&#x4F5B;&#x770B;&#x5230;&#x4E86;&#x5F53;&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x6DF1;&#x6709;&#x611F;&#x89E6;&#xFF01;&#x53D1;&#x73B0;&#x5176;&#x4E2D;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x5BF9;&#x5927;&#x90E8;&#x5206;&#x5927;&#x5B66;&#x751F;&#x90FD;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x4E8E;&#x662F;&#x5C06;&#x56DE;&#x4FE1;&#x4EE5;&#x535A;&#x5BA2;&#x7684;&#x5F62;&#x5F0F;&#x516C;&#x5F00;&#xFF0C;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x7684;&#x7ECF;&#x5386;&#x4E0E;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E2A;&#x4EBA;&#x5BF9;IT&#x884C;&#x4E1A;&#x3001;&#x5B66;&#x4E60;&#x3001;&#x5DE5;&#x4F5C;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x4EC0;&#x4E48;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4ECE;&#x725B;A&#x53D8;&#x6210;&#x725B;B&#xFF1F;</p>
</blockquote>
<h2 id="IT&#x6280;&#x672F;&#x65B9;&#x5411;&#x5212;&#x5206;&#xFF1A;"><a href="#IT&#x6280;&#x672F;&#x65B9;&#x5411;&#x5212;&#x5206;&#xFF1A;" class="headerlink" title="IT&#x6280;&#x672F;&#x65B9;&#x5411;&#x5212;&#x5206;&#xFF1A;"></a>IT&#x6280;&#x672F;&#x65B9;&#x5411;&#x5212;&#x5206;&#xFF1A;</h2><p>&#x4F60;&#x5BF9;&#x6280;&#x672F;&#x65B9;&#x5411;&#x7684;&#x6982;&#x62EC;&#x7B97;&#x662F;&#x8F83;&#x5168;&#x9762;&#x4E86;&#xFF0C;&#x6211;&#x7A0D;&#x5FAE;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x5212;&#x5206;&#x66F4;&#x5408;&#x7406;&#x4E00;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x5411;</li>
<li>web&#x524D;&#x7AEF;&#x65B9;&#x5411;</li>
<li>web&#x540E;&#x53F0;&#x65B9;&#x5411;</li>
<li>&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x65B9;&#x5411;</li>
<li>&#x7B97;&#x6CD5;/&#x7814;&#x7A76;&#x65B9;&#x5411;</li>
</ul>
<p>&#x56E0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x540E;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x4E00;&#x822C;&#x90FD;&#x662F;Linux&#xFF0C;&#x6240;&#x4EE5;web&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x548C;Linux&#x670D;&#x52A1;&#x5668;&#x5F00;&#x53D1;&#x53EF;&#x89C6;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x65B9;&#x5411;(&#x9664;&#x975E;&#x4F60;&#x6307;&#x7684;Linux&#x670D;&#x52A1;&#x5668;&#x5F00;&#x53D1;&#x662F;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x4E0D;&#x8FC7;&#x90A3;&#x662F;&#x8FD0;&#x7EF4;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0D;&#x7B97;&#x505A;&#x5F00;&#x53D1;&#x5427;)&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x662F;&#x7B97;&#x6CD5;/&#x7814;&#x7A76;&#x65B9;&#x5411;(&#x5982;&#x5927;&#x6570;&#x636E;&#x3001;&#x4E91;&#x8BA1;&#x7B97;&#x3001;&#x5185;&#x6838;&#x5F00;&#x53D1;)&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x628A;&#x5B83;&#x4ECE;&#x672C;&#x79D1;&#x7684;&#x8303;&#x56F4;&#x5185;&#x6392;&#x9664;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x4E0D;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#x3002;&#x867D;&#x7136;&#x7B97;&#x6CD5;/&#x7814;&#x7A76;&#x65B9;&#x5411;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x8981;&#x6C42;&#x7814;&#x7A76;&#x751F;&#x6216;&#x535A;&#x58EB;&#x53CA;&#x4EE5;&#x4E0A;&#xFF0C;&#x4F46;&#x672C;&#x79D1;&#x751F;&#x8FD8;&#x662F;&#x6709;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5389;&#x5BB3;&#x7684;&#x4F18;&#x79C0;&#x4EBA;&#x624D;&#xFF0C;&#x963F;&#x91CC;&#x7684;&#x4E91;&#x8BA1;&#x7B97;&#x8FD8;&#x6709;&#x672C;&#x79D1;&#x751F;&#x5462;&#xFF01;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x4EE5;C++&#x4E3A;&#x4E3B;&#x5374;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;C++&#xFF0C;&#x867D;&#x7136;&#x5F88;&#x591A;&#x5927;&#x578B;&#x6E38;&#x620F;&#x90FD;&#x662F;C++&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x7684;&#x624B;&#x6E38;&#x4E5F;&#x6709;Android&#x3001;IOS&#x7684;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x4E9B;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x4F1A;&#x7528;&#x65B0;&#x7684;&#x6280;&#x672F;(&#x5982;&#x6BD4;&#x8F83;&#x6709;&#x540D;&#x7684;Unity,&#x53EF;&#x80FD;&#x5728;&#x5927;&#x5B66;&#x90FD;&#x8FD8;&#x63A5;&#x89E6;&#x4E0D;&#x5230;)&#x3002;&#x6570;&#x636E;&#x5E93;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x8D77;&#x7684;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x5927;&#x516C;&#x53F8;&#x624D;&#x4F1A;&#x6709;&#x4E13;&#x4E1A;&#x7684;DBA&#x3002;</p>
<h2 id="IT&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF1A;"><a href="#IT&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF1A;" class="headerlink" title="IT&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF1A;"></a>IT&#x884C;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF1A;</h2><h4 id="&#x79FB;&#x52A8;&#x7AEF;"><a href="#&#x79FB;&#x52A8;&#x7AEF;" class="headerlink" title="&#x79FB;&#x52A8;&#x7AEF;"></a>&#x79FB;&#x52A8;&#x7AEF;</h4><p>&#x79FB;&#x52A8;&#x7AEF;(&#x624B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;)&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x5316;&#x6700;&#x5FEB;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x53D8;&#x6570;&#x3002;10&#x5E74;&#x4E4B;&#x524D;&#xFF0C;&#x5728;&#x8BFA;&#x57FA;&#x4E9A;&#x98CE;&#x9761;&#x5168;&#x7403;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x60F3;&#x5230;Android&#x6709;&#x73B0;&#x5728;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x524D;&#x666F;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x7528;&#x6237;&#x91CF;&#x5417;&#xFF1F;10&#x5E74;&#x5F00;&#x59CB;(&#x5176;&#x5B9E;08&#x5E74;&#x5C31;&#x5F00;&#x59CB;&#x915D;&#x917F;&#x4E86;)&#xFF0C;Android&#x8FC5;&#x901F;&#x5D1B;&#x8D77;&#xFF0C;&#x53D1;&#x5C55;&#x5F02;&#x5E38;&#x7684;&#x51F6;&#x731B;&#xFF0C;&#x5230;12&#x5E74;&#x51E0;&#x4E4E;&#x4EBA;&#x624B;&#x4E00;&#x53F0;Android&#x8BBE;&#x5907;&#x4E86;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x8BFA;&#x57FA;&#x4E9A;&#x5374;&#x4E00;&#x8DEF;&#x4E0B;&#x6ED1;&#xFF0C;&#x76F4;&#x81F3;&#x8DCC;&#x5230;&#x4F4E;&#x8C37;&#x518D;&#x4E5F;&#x722C;&#x4E0D;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x6295;&#x5165;&#x5FAE;&#x8F6F;&#x7684;&#x6000;&#x62B1;&#x4E5F;&#x53D1;&#x5C55;&#x7684;&#x4E0D;&#x592A;&#x987A;&#x5229;&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x5927;&#x52BF;&#x5DF2;&#x53BB;&#x3002;&#x800C;&#x82F9;&#x679C;&#x4ECE;2007&#x5E74;&#x7B2C;&#x4E00;&#x4EE3;iphone&#x8BDE;&#x751F;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#xFF0C;&#x8D70;&#x7684;&#x5C31;&#x662F;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x9AD8;&#x7AEF;&#x4EBA;&#x7FA4;&#xFF0C;&#x4EF7;&#x683C;&#x662F;&#x6240;&#x6709;&#x624B;&#x673A;&#x4E2D;&#x6700;&#x9AD8;&#x7684;&#xFF0C;&#x4F46;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x6700;&#x725B;&#x903C;&#x7684;&#xFF0C;&#x4F53;&#x9A8C;&#x662F;&#x6700;&#x53CB;&#x597D;&#x7684;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6BCF;&#x4E00;&#x6B21;&#x7684;&#x53D1;&#x5E03;&#x4F1A;&#x6392;&#x961F;&#x7684;&#x4EBA;&#x90FD;&#x6D4E;&#x5230;&#x7206;&#xFF01;&#x770B;&#x5230;&#x79FB;&#x52A8;&#x5E73;&#x53F0;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x548C;&#x89E6;&#x6478;&#x5C4F;&#x624B;&#x673A;&#x7684;&#x8FC5;&#x901F;&#x5D1B;&#x8D77;&#x540E;&#xFF0C;&#x5FAE;&#x8F6F;&#x4E5F;&#x4E8E;2010&#x5E74;&#x6295;&#x5165;&#x4E86;&#x79FB;&#x52A8;&#x5E73;&#x53F0;&#xFF0C;&#x53D1;&#x5E03;&#x4E86;Windows Phone&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x51ED;&#x501F;&#x7740; Windows PC&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x58F0;&#x671B;&#x548C;Microsoft&#x7684;&#x54C1;&#x724C;&#x5438;&#x5F15;&#x4E86;&#x4E0D;&#x5C11;&#x7684;windows phone&#x7684;&#x7528;&#x6237;&#xFF0C;&#x4F46;&#x4E0E;Android&#x548C;iphone&#x76F8;&#x6BD4;&#xFF0C;&#x8FD8;&#x662F;&#x76F8;&#x5DEE;&#x592A;&#x8FDC;&#x3002;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF1A;&#x82F9;&#x679C;&#x662F;&#x7528;&#x6237;&#x91CF;&#x8F83;&#x5C11;&#xFF0C;&#x5374;&#x662F;&#x6700;&#x8D5A;&#x94B1;&#x7684;&#xFF0C;&#x51ED;&#x501F;&#x5176;&#x5F3A;&#x5927;&#x7684;&#x6280;&#x672F;&#x5B9E;&#x529B;&#x548C;&#x8FFD;&#x6C42;&#x5B8C;&#x7F8E;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x5728;&#x4E09;&#x5230;&#x4E94;&#x5E74;&#x5185;&#x5E94;&#x8BE5;&#x8FD8;&#x53EF;&#x4EE5;&#x53D1;&#x5C55;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x524D;&#x666F;&#x81EA;&#x7136;&#x4E5F;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF1B;Android&#x662F;&#x7528;&#x6237;&#x91CF;&#x6700;&#x591A;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x5C31;&#x4E1A;&#x673A;&#x4F1A;&#x8FD8;&#x662F;&#x633A;&#x591A;&#x7684;&#xFF0C;&#x4F46;&#x672A;&#x6765;&#x662F;&#x5426;&#x4F1A;&#x88AB;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x624B;&#x673A;&#x66FF;&#x6362;&#x8FD8;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#xFF1B;windows phone&#x5173;&#x6CE8;&#x7684;&#x8F83;&#x5C11;&#xFF0C;&#x4E2A;&#x4EBA;&#x4E0D;&#x592A;&#x770B;&#x597D;&#xFF01;</p>
<h4 id="&#x4E92;&#x8054;&#x7F51;"><a href="#&#x4E92;&#x8054;&#x7F51;" class="headerlink" title="&#x4E92;&#x8054;&#x7F51;"></a>&#x4E92;&#x8054;&#x7F51;</h4><p>&#x6211;&#x8BA4;&#x4E3A;IT&#x9886;&#x57DF;&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF0C;&#x4ECE;&#x5B9E;&#x4F53;&#x65B9;&#x9762;&#x6765;&#x770B;&#x4E00;&#x5B9A;&#x662F;&#x667A;&#x80FD;&#x8BBE;&#x5907;&#x548C;&#x7269;&#x8054;&#x7F51;&#xFF0C;&#x4ECE;&#x9886;&#x57DF;&#x6765;&#x770B;&#x4E00;&#x5B9A;&#x662F;&#x4E92;&#x8054;&#x7F51;+&#xFF0C;&#x672A;&#x6765;&#x7684;&#x7F51;&#x7EDC;&#x5C06;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x667A;&#x80FD;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;&#x662F;&#x7F51;&#x7EDC;&#x4E0E;&#x7F51;&#x7EDC;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0E;&#x4EBA;&#x7684;&#x8FDE;&#x63A5;&#xFF1B;&#x800C;&#x7269;&#x8054;&#x7F51;&#x5C31;&#x662F;&#x7269;&#x4F53;&#x4E0E;&#x7F51;&#x7EDC;&#xFF0C;&#x4EBA;&#x4E0E;&#x7F51;&#x7EDC;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x6295;&#x8D44;&#x4EBA;&#x5B59;&#x6B63;&#x4E49;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x5927;&#x4F1A;&#x4E0A;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x4ECA;&#x5929;&#x6BCF;&#x4E2A;&#x4EBA;&#x5927;&#x6982;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#xFF0C;2020&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x8FDE;&#x63A5;&#x7684;&#x8BBE;&#x5907;&#x7684;&#x6570;&#x91CF;&#x4F1A;&#x8FBE;&#x5230;&#x4E00;&#x5343;&#x4E2A;&#x201D;&#x3002;&#x672A;&#x6765;&#x5C06;&#x4F1A;&#x662F;&#x5468;&#x56F4;&#x90FD;&#x662F;&#x7269;&#x4F53;&#xFF0C;&#x800C;&#x7269;&#x4F53;&#x90FD;&#x4E0E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5468;&#x56F4;&#x90FD;&#x662F;&#x7269;&#x4F53;&#xFF0C;&#x5468;&#x56F4;&#x90FD;&#x662F;&#x7F51;&#x7EDC;&#x3002;&#x800C;&#x4E14;&#x7269;&#x4F53;&#x5C06;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x667A;&#x80FD;&#xFF0C;&#x667A;&#x80FD;&#x5BB6;&#x5C45;&#x5E94;&#x8BE5;&#x4F1A;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x4E00;&#x56DE;&#x5BB6;&#xFF0C;&#x7A7A;&#x8C03;&#x5C31;&#x5F00;&#x4E86;&#xFF0C;&#x7535;&#x706F;&#x5C31;&#x4EAE;&#x4E86;&#xFF1B;&#x4E00;&#x51FA;&#x95E8;&#x7A7A;&#x8C03;&#x548C;&#x7535;&#x706F;&#x5C31;&#x5173;&#x4E86;&#xFF0C;&#x8FD8;&#x63D0;&#x9192;&#x4F60;&#x4ECA;&#x5929;&#x7684;&#x5929;&#x6C14;&#x72B6;&#x51B5;&#x2026;&#x2026; &#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x7269;&#x8054;&#x7F51;&#x6162;&#x6162;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x4E92;&#x8054;&#x7F51;+&#x5C31;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E0E;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x7684;&#x7ED3;&#x5408;(&#x4E92;&#x8054;&#x7F51; + &#x4F20;&#x7EDF;&#x884C;&#x4E1A;)&#x3002;&#x73B0;&#x5728;&#x53C8;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x201C;+&#x4E92;&#x8054;&#x7F51;&#x201D;&#xFF0C;&#x6BD4;&#x5982;&#x4E07;&#x79D1;&#x7684;&#x623F;&#x5730;&#x4EA7;&#x4EE5;&#x5C5E;&#x4E8E;&#x6807;&#x51C6;&#x7684;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#xFF0C;&#x73B0;&#x5728;&#x4E0E;&#x5FEB;&#x94B1;&#x5408;&#x4F5C;&#x5F15;&#x5165;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E5F;&#x60F3;&#x6253;&#x9020;&#x4E00;&#x4E2A;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5E73;&#x53F0;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x201C;&#x4E92;&#x8054;&#x7F51;+&#x201D;&#x8FD8;&#x662F;&#x201D;+&#x4E92;&#x8054;&#x7F51;&#x201D;&#xFF0C;&#x90FD;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E0D;&#x65AD;&#x5730;&#x6E17;&#x900F;&#x5230;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4E0E;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x7684;&#x7ED3;&#x5408;&#x5C06;&#x4F1A;&#x66F4;&#x52A0;&#x7D27;&#x5BC6;&#xFF0C;&#x6BD4;&#x5982;&#x4E92;&#x8054;&#x7F51;+&#x91D1;&#x878D;&#xFF0C;&#x73B0;&#x5728;BAT&#x4E09;&#x5BB6;&#x6253;&#x7684;&#x6B63;&#x70ED;&#x95F9;&#x5462;&#xFF01;&#x518D;&#x6BD4;&#x5982;&#x4E92;&#x8054;&#x7F51;&#x4E0E;&#x4F20;&#x7EDF;&#x9910;&#x996E;&#x4E1A;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x6253;&#x9020;&#x51FA;&#x4E86;&#x73B0;&#x5728;&#x7684;&#x767E;&#x5EA6;&#x5916;&#x5356;&#xFF0C;&#x518D;&#x6BD4;&#x5982;&#x65B0;&#x5174;&#x7684;e&#x888B;&#x6D17;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E0E;&#x6D17;&#x8863;&#x5E97;&#x7684;&#x7ED3;&#x5408;&#x3002;</p>
<h4 id="&#x6E38;&#x620F;"><a href="#&#x6E38;&#x620F;" class="headerlink" title="&#x6E38;&#x620F;"></a>&#x6E38;&#x620F;</h4><p>&#x6211;&#x672C;&#x4EBA;&#x4E0D;&#x600E;&#x4E48;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x5BF9;&#x6E38;&#x620F;&#x4E0D;&#x592A;&#x4E86;&#x89E3;&#xFF01;&#x4F46;&#x4ECE;&#x6574;&#x4E2A;&#x793E;&#x4F1A;&#x53D1;&#x5C55;&#x6765;&#x770B;&#xFF0C;&#x4E16;&#x754C;&#x5728;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x4E2D;&#x56FD;&#x4E5F;&#x65E5;&#x76CA;&#x5F3A;&#x5927;&#xFF0C;&#x968F;&#x7740;&#x7ECF;&#x6D4E;&#x6C34;&#x5E73;&#x7684;&#x4E0D;&#x65AD;&#x63D0;&#x9AD8;&#xFF0C;&#x4EBA;&#x4EEC;&#x6709;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x7528;&#x6765;&#x60A0;&#x95F2;&#x5A31;&#x4E50;&#xFF0C;&#x4E5F;&#x6709;&#x66F4;&#x597D;&#x7684;&#x7269;&#x8D28;&#x57FA;&#x7840;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x8D8B;&#x52BF;&#x4E0B;&#xFF0C;&#x73A9;&#x6E38;&#x620F;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x5E94;&#x8BE5;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x666F;&#x6C14;&#x3002;</p>
        
          <p class="article-more-link">
            <a href="/2016/lead-the-industry/#more">Read More</a>
          </p>
        
      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/lead-the-industry/" data-id="civhpzth2001puwsk1hdhr2xi" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/lead-the-industry/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-programmers-10-investment" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/programmers-10-investment/">程序员必须进行的10项投资</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/programmers-10-investment/" class="article-date">
  <time datetime="2016-08-02T12:41:13.000Z" itemprop="datePublished">2016-08-02</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Manage/">Manage</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: &#x535A;&#x5BA2;&#x56ED; http://news.cnblogs.com/n/209983/ 2014-06-09</code></p>
<h2 id="&#x4F60;&#x7684;&#x5065;&#x5EB7;"><a href="#&#x4F60;&#x7684;&#x5065;&#x5EB7;" class="headerlink" title="&#x4F60;&#x7684;&#x5065;&#x5EB7;"></a>&#x4F60;&#x7684;&#x5065;&#x5EB7;</h2><p>&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7ECF;&#x5E38;&#x90FD;&#x662F;&#x5750;&#x7740;&#x4E0D;&#x52A8;&#x7684;&#x3002;&#x6BCF;&#x5929;&#x5750;8&#x5230;16&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x53EA;&#x4F11;&#x606F;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x7684;&#x809A;&#x5B50;&#x5468;&#x56F4;&#x5F88;&#x5BB9;&#x6613;&#x4F1A;&#x5806;&#x8D77;&#x8D58;&#x8089;&#x3002;&#x80A5;&#x80D6;&#x662F;&#x5176;&#x5B83;&#x75BE;&#x75C5;&#x7684;&#x50AC;&#x5316;&#x5242;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x5FC3;&#x810F;&#x75C5;&#x53C8;&#x662F;&#x6700;&#x53EF;&#x6015;&#x7684;&#x3002;&#x591A;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x8FD0;&#x52A8;&#x4E00;&#x4E0B;&#x5C31;&#x80FD;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x82B1;&#x70B9;&#x94B1;&#x529E;&#x4E00;&#x5F20;&#x5065;&#x8EAB;&#x623F;&#x7684;&#x4F1A;&#x5458;&#x5361;&#x3002;</p>
<p>&#x957F;&#x65F6;&#x95F4;&#x4EE5;&#x4E0D;&#x7B26;&#x5408;&#x4EBA;&#x4F53;&#x5DE5;&#x7A0B;&#x5B66;&#x7684;&#x59FF;&#x52BF;&#x6253;&#x5B57;&#xFF0C;&#x4E5F;&#x5BB9;&#x6613;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9009;&#x6210;&#x91CD;&#x590D;&#x6027;&#x7684;&#x808C;&#x8089;&#x635F;&#x4F24;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8155;&#x7BA1;&#x7EFC;&#x5408;&#x5F81;&#x3002;&#x6BCF;&#x9694;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x62C9;&#x4F38;&#x4E00;&#x4E0B;&#x4F60;&#x7684;&#x624B;&#x8155;&#x6216;&#x8005;&#x4E70;&#x5757;&#x9F20;&#x6807;&#x548C;&#x952E;&#x76D8;&#x90FD;&#x80FD;&#x7528;&#x7684;&#x624B;&#x8155;&#x62A4;&#x57AB;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x635F;&#x4F24;&#x3002;</p>
<p>&#x76EF;&#x7740;&#x5C4F;&#x5E55;&#x4E5F;&#x4F1A;&#x7ED9;&#x4F60;&#x7684;&#x773C;&#x775B;&#x9020;&#x6210;&#x538B;&#x8FEB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;&#x914D;&#x4E00;&#x526F;&#x9632;&#x7729;&#x5149;&#x773C;&#x955C;&#x800C;&#x4E0D;&#x662F;&#x666E;&#x901A;&#x773C;&#x955C;&#x7684;&#x539F;&#x56E0;&#xFF08;&#x5047;&#x8BBE;&#x4F60;&#x662F;&#x6234;&#x773C;&#x955C;&#x7684;&#xFF09;&#x3002;</p>
<h2 id="&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x80FD;&#x529B;"><a href="#&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x80FD;&#x529B;" class="headerlink" title="&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x80FD;&#x529B;"></a>&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6570;&#x5B66;&#x80FD;&#x529B;</h2><p>&#x6570;&#x5B66;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x903B;&#x8F91;&#x601D;&#x8003;&#x80FD;&#x529B;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x8FD8;&#x80FD;&#x589E;&#x52A0;&#x4F60;&#x7684;&#x8010;&#x5FC3;&#x3002;&#x6709;&#x4E9B;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x79BB;&#x6563;&#x6570;&#x5B66; &#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x77E5;&#x8BC6;&#x5FD8;&#x4E86;&#x4E5F;&#x6CA1;&#x4E8B;&#xFF0C;&#x8FD9;&#x8981;&#x770B;&#x4F60;&#x4ECE;&#x4E8B;&#x7684;&#x662F;&#x90A3;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x5F00;&#x53D1;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7ECF;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x7269;&#x7406;&#x548C;&#x5FAE;&#x79EF;&#x5206;&#xFF0C;&#x800C;&#x6211;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x5F88;&#x5C11;&#x53D1;&#x73B0;&#x6709;&#x80FD;&#x7528;&#x4E0A;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x65B9; &#x3002;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x8BF4;&#xFF0C;&#x6570;&#x5B66;&#x80FD;&#x8BA9;&#x4F60;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#x3002;</p>
<h2 id="&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;"><a href="#&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;" class="headerlink" title="&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;"></a>&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x82F1;&#x8BED;&#x6C34;&#x5E73;</h2><p>&#x7F16;&#x7A0B;&#x3001;&#x811A;&#x672C; &#x3001;&#x6807;&#x8BB0;&#x6027;&#x8BED;&#x8A00;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;&#x82F1;&#x6587;&#xFF0C;&#x800C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6BD4;&#x5982;Linux&#x5B83;&#x4EEC;&#x7684;&#x6CE8;&#x89E3;&#x901A;&#x5E38;&#x4E5F;&#x90FD;&#x662F;&#x82F1;&#x6587;&#x3002;&#x6765;&#x81EA;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x901A;&#x8FC7;&#x82F1;&#x8BED;&#x6765;&#x534F;&#x4F5C;&#x5F00;&#x53D1;&#x3002;&#x9762;&#x5411;&#x56FD;&#x9645;&#x5BA2;&#x6237;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5FC5;&#x987B;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x591F;&#x5C06;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x8F6C;&#x5316;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x660E;&#x767D;&#x4E86;&#x5427;&#xFF1F;&#x82F1;&#x8BED;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x4E8C;&#x8FDB;&#x5236;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x548C;&#x7F51;&#x7AD9;"><a href="#&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x548C;&#x7F51;&#x7AD9;" class="headerlink" title="&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x548C;&#x7F51;&#x7AD9;"></a>&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x548C;&#x7F51;&#x7AD9;</h2><p>&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x4E13;&#x5C5E;&#x7684;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x800C;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;something@yahoo.com&#x6216;&#x8005;someone@gmail.com&#x662F;&#x4E0D;&#x662F;&#x611F;&#x89C9;&#x633A;&#x9177;&#xFF1F;&#x6BCF;&#x5E74;&#x53EA;&#x9700;&#x82B1;&#x8D39;&#x4E00;&#x70B9;&#x70B9;&#x94B1;&#xFF0C;&#x5C31;&#x80FD;&#x8BA9;&#x4F60;&#x770B;&#x8D77;&#x6765;&#x548C;&#x522B;&#x4EBA;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x4E70;&#x7684;&#x8FD9;&#x4E2A;lambdageek&#x57DF;&#x540D;&#x53EA;&#x82B1;&#x4E86;13&#x7F8E;&#x91D1;&#x800C;&#x5DF2;&#x3002;&#x4E2A;&#x4EBA;&#x57DF;&#x540D;&#x8FD8;&#x80FD;&#x7ED9;&#x4F60;&#x7684;&#x4E2A;&#x4EBA;&#x54C1;&#x724C;&#x6DFB;&#x52A0;&#x81EA;&#x4FE1;&#x548C;&#x4E13;&#x4E1A;&#xFF0C;&#x8BA9;&#x6F5C;&#x5728;&#x7684;&#x7528;&#x6237;&#x6216;&#x8005;&#x540C;&#x4E8B;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x4E0D;&#x80FD;&#x662F;&#x4EC0;&#x4E48;&#x4E71;&#x4E03;&#x516B;&#x7CDF;.com&#x3002;</p>
<h2 id="&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;Github&#x5E10;&#x6237;"><a href="#&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;Github&#x5E10;&#x6237;" class="headerlink" title="&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;Github&#x5E10;&#x6237;"></a>&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;Github&#x5E10;&#x6237;</h2><p>&#x4F5C;&#x54C1;&#x96C6;&#x4E4B;&#x4E8E;&#x827A;&#x672F;&#x5BB6;&#x5C31;&#x72B9;&#x5982;Github&#x4E4B;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;&#x8FD9;&#x70B9;&#x5C31;&#x4E0D;&#x5FC5;&#x591A;&#x8BF4;&#x4E86;&#x3002;</p>
<h2 id="&#x4E00;&#x53F0;&#x597D;&#x7684;&#x7535;&#x8111;"><a href="#&#x4E00;&#x53F0;&#x597D;&#x7684;&#x7535;&#x8111;" class="headerlink" title="&#x4E00;&#x53F0;&#x597D;&#x7684;&#x7535;&#x8111;"></a>&#x4E00;&#x53F0;&#x597D;&#x7684;&#x7535;&#x8111;</h2><p>&#x4F60;&#x542C;&#x8BF4;&#x8FC7;&#x6709;&#x7A0B;&#x5E8F;&#x5458;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x7684;&#x4E48;&#xFF1F;&#x6211;&#x662F;&#x6CA1;&#x542C;&#x8BF4;&#x8FC7;&#x3002;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7535;&#x8111;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x597D;&#x6BD4;&#x6CA1;&#x6709;&#x6FC0;&#x5149;&#x5251;&#x7684;&#x7EDD;&#x5730;&#x6B66;&#x58EB;&#x4E00;&#x6837;&#x3002;&#x6211;&#x8FD9;&#x91CC;&#x6307;&#x7684;&#x597D;&#x7684;&#x7535;&#x8111;&#x81F3;&#x5C11;&#x5F97;&#x6709;4GB&#x5185;&#x5B58;&#xFF08;&#x8981;&#x60F3;&#x4E0D;&#x90A3;&#x4E48;&#x5FEB;&#x8FC7;&#x65F6;&#x81F3;&#x5C11;&#x5F97;&#x6709;8GB&#xFF09;&#x3002;&#x6211;&#x6BD4;&#x8F83;&#x63A8;&#x8350;&#x7684;&#x662F;4000&#x5200;&#x7684;Macbook Pro&#xFF0C;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x6709;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#x7684;&#x6781;&#x7AEF;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x6301;&#x4FDD;&#x7559;&#x610F;&#x89C1; &#x3002;</p>
<h2 id="&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x7F51;&#x901F;"><a href="#&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x7F51;&#x901F;" class="headerlink" title="&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x7F51;&#x901F;"></a>&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x7F51;&#x901F;</h2><p>&#x4E92;&#x8054;&#x7F51;&#x5C31;&#x662F;&#x7801;&#x519C;&#x4EEC;&#x7684;&#x6C27;&#x6C14;&#x3002;&#x65AD;&#x7F51;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x5C31;&#x597D;&#x6BD4;&#x65AD;&#x4E86;&#x7A7A;&#x6C14;&#x4F9B;&#x7ED9;&#x4E00;&#x6837;&#xFF0C;&#x7B80;&#x76F4;&#x65E0;&#x6CD5;&#x5FCD;&#x53D7;&#x3002;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x4E0B;&#x89C6;&#x9891;&#x6559;&#x7A0B;&#x6765;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x6216;&#x8005;&#x6CE1;&#x6CE1;&#x8BBA;&#x575B;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x5173;&#x6CE8;&#x5230;Hacker News&#x4E0A;&#x7684;&#x6700;&#x65B0;&#x6587;&#x7AE0;&#x3002;</p>
<h2 id="&#x8BFB;&#x4E00;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x4E66;&#x7C4D;"><a href="#&#x8BFB;&#x4E00;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x4E66;&#x7C4D;" class="headerlink" title="&#x8BFB;&#x4E00;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x4E66;&#x7C4D;"></a>&#x8BFB;&#x4E00;&#x4E9B;&#x7ECF;&#x5178;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x4E66;&#x7C4D;</h2><p>&#x6709;&#x4E00;&#x4E9B;&#x4E66;&#x6211;&#x8BA4;&#x4E3A;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#x7684;&#x7ECF;&#x5178;&#x4E4B;&#x4F5C;&#xFF1A;</p>
<ul>
<li>&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x7684;&#x6784;&#x9020;&#x548C;&#x89E3;&#x91CA;</li>
<li>&#x7B97;&#x6CD5;&#x5BFC;&#x8BBA;</li>
<li>&#x79BB;&#x6563;&#x6570;&#x5B66;&#x53CA;&#x5176;&#x5E94;&#x7528;</li>
<li>&#x4EE3;&#x7801;&#x5927;&#x5168;2</li>
<li>&#x7A0B;&#x5E8F;&#x5458;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;</li>
<li>&#x91CD;&#x6784;-&#x6539;&#x5584;&#x65E2;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x8BBE;&#x8BA1;</li>
<li>&#x4EBA;&#x6708;&#x795E;&#x8BDD;</li>
</ul>
<h2 id="&#x5B66;&#x58EB;&#x5B66;&#x4F4D;"><a href="#&#x5B66;&#x58EB;&#x5B66;&#x4F4D;" class="headerlink" title="&#x5B66;&#x58EB;&#x5B66;&#x4F4D;"></a>&#x5B66;&#x58EB;&#x5B66;&#x4F4D;</h2><p>&#x4E00;&#x4E2A;&#x672C;&#x79D1;&#x5B66;&#x5386;&#x80FD;&#x591F;&#x589E;&#x52A0;&#x83B7;&#x53D6;&#x5DE5;&#x4F5C;&#x7684;&#x51E0;&#x7387;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x521A;&#x6BD5;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#x8FD8;&#x662F;&#x521A;&#x8F9E;&#x804C;&#x51C6;&#x5907;&#x627E;&#x4E0B;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;&#x518D;&#x60F3;&#x50CF;&#x4E00;&#x4E0B;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5; &#xFF1A;&#x5982;&#x679C;&#x5F88;&#x591A;&#x7814;&#x7A76;&#x751F;&#x90FD;&#x6324;&#x7834;&#x4E86;&#x5934;&#x53BB;&#x62A2;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x672C;&#x79D1;&#x751F;&#x7684;&#x7B80;&#x5386;&#x80FD;&#x88AB;&#x770B;&#x5230;&#x7684;&#x6982;&#x7387;&#x53C8;&#x6709;&#x591A;&#x5C11;&#xFF1F;</p>
<h2 id="&#x8D44;&#x683C;&#x8BA4;&#x8BC1;-&#x53EF;&#x9009;"><a href="#&#x8D44;&#x683C;&#x8BA4;&#x8BC1;-&#x53EF;&#x9009;" class="headerlink" title="&#x8D44;&#x683C;&#x8BA4;&#x8BC1; (&#x53EF;&#x9009;)"></a>&#x8D44;&#x683C;&#x8BA4;&#x8BC1; (&#x53EF;&#x9009;)</h2><p>&#x8D44;&#x683C;&#x8BA4;&#x8BC1;&#x80FD;&#x68C0;&#x9A8C;&#x4F60;&#x7684;&#x67D0;&#x4E00;&#x9879;&#x6280;&#x672F;&#x7684;&#x80FD;&#x529B;&#x3002;&#x901A;&#x8FC7;&#x4E86;&#x67D0;&#x9879;&#x8BA4;&#x8BC1;&#x610F;&#x5473;&#x7740;&#x522B;&#x4EBA;&#x5DF2;&#x7ECF;&#x8BA4;&#x53EF;&#x4E86;&#xFF0C;&#x4F60;&#x5BF9;&#x4F01;&#x4E1A;&#x8BA4;&#x4E3A;&#x53EF;&#x80FD;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#x6709;&#x4E86;&#x6BD4;&#x8F83;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x3002;&#x6709;&#x4E9B;&#x516C;&#x53F8;&#x4F1A;&#x7ED9;&#x6709;&#x76F8;&#x5173;&#x8BA4;&#x8BC1;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x85AA;&#x6C34;&#x548C;&#x5F85;&#x9047;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x516C;&#x53F8;&#x538B;&#x6839;&#x513F;&#x5C31;&#x4E0D;&#x5728;&#x4E4E;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x8BA4;&#x8BC1;&#x7684;Java&#x7A0B;&#x5E8F;&#x5458;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5BF9;Java&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x5F97;&#x6BD4;&#x8F83;&#x900F;&#x5F7B;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5177;&#x5907;&#x4E86;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#x66F4;&#x770B;&#x91CD;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5173;&#x952E;&#x7684;&#x601D;&#x8003;&#x80FD;&#x529B;&#x800C;&#x4E0D;&#x662F;&#x4ED6;&#x5728;&#x67D0;&#x9879;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5B66;&#x4F1A;&#xFF0C;&#x800C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x5219;&#x4E0D;&#x7136;&#x3002;</p>
<blockquote>
<p>&#x6765;&#x81EA;: it.deepinmind.com</p>
</blockquote>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/programmers-10-investment/" data-id="civhpzthh0028uwskpcbrfo58" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/programmers-10-investment/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-outstanding-programmer" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/outstanding-programmer/">如何成为一位杰出的程序员</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/outstanding-programmer/" class="article-date">
  <time datetime="2016-08-02T12:14:02.000Z" itemprop="datePublished">2016-08-02</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Manage/">Manage</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: IT&#x6C5F;&#x6E56; &#x7F16;&#x7A0B;&#x611F;&#x609F; 2014-07-02</code></p>
<p>&#x5982;&#x4F55;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x6770;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EC0;&#x4E48;&#x53EB;&#x6770;&#x51FA;&#xFF1F;&#x4E0B;&#x9762;&#x6211;&#x7ED9;&#x4F60;&#x5927;&#x5BB6;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x6587;&#x4E2D;&#x8BF4;&#x7684;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x8BA4;&#x540C;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF01;&#x8BC4;&#x8BBA;&#x53CD;&#x9988;&#x4E00;&#x4E0B;&#xFF01;</p>
<h2 id="&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x548C;&#x521B;&#x65B0;&#x80FD;&#x529B;"><a href="#&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x548C;&#x521B;&#x65B0;&#x80FD;&#x529B;" class="headerlink" title="&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x548C;&#x521B;&#x65B0;&#x80FD;&#x529B;"></a>&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x548C;&#x521B;&#x65B0;&#x80FD;&#x529B;</h2><p>&#x4E2A;&#x4EBA;&#x89C9;&#x7684;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E0A;&#x9762;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5F88;&#x5FEB;&#x7684;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x4E0D;&#x662F;&#x4E00;&#x5E74;&#x4E24;&#x5E74;&#x53EF;&#x4EE5;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5B9E;&#x8DF5;&#x4EE5;&#x53CA;&#x7ECF;&#x9A8C;&#x3002;&#x521B;&#x65B0;&#x80FD;&#x529B;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8981;&#x5B66;&#x4F1A;&#x4E3E;&#x4E00;&#x53CD;&#x4E09;&#xFF0C;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x8DEF;&#x6765;&#x521B;&#x65B0;&#x51FA;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5BF9;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x6280;&#x672F;&#x8981;&#x65F6;&#x523B;&#x7684;&#x4E86;&#x89E3;&#x5E76;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x4E00;&#x9897;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#x7684;&#x5927;&#x8111;"><a href="#&#x4E00;&#x9897;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#x7684;&#x5927;&#x8111;" class="headerlink" title="&#x4E00;&#x9897;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#x7684;&#x5927;&#x8111;"></a>&#x4E00;&#x9897;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#x7684;&#x5927;&#x8111;</h2><p>&#x6280;&#x672F;&#x66F4;&#x65B0;&#x7684;&#x5F88;&#x5FEB;&#xFF0C;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x6280;&#x672F;&#x662F;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x65E7;&#x7684;&#x6846;&#x67B6;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x6709;&#x4E00;&#x9897;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x7684;&#x5FC3;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x624D;&#x4E0D;&#x4F1A;&#x88AB;&#x6DD8;&#x6C70;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x7684;&#x65B0;&#x7684;&#x6280;&#x672F;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4E30;&#x5BCC;&#x81EA;&#x5DF1;&#xFF01;&#xFF01;</p>
<h2 id="&#x6280;&#x672F;&#x8981;&#x505A;&#x5230;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;"><a href="#&#x6280;&#x672F;&#x8981;&#x505A;&#x5230;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;" class="headerlink" title="&#x6280;&#x672F;&#x8981;&#x505A;&#x5230;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;"></a>&#x6280;&#x672F;&#x8981;&#x505A;&#x5230;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;</h2><p>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x591A;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x867D;&#x7136;&#x62A2;&#x624B;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x534A;&#x74F6;&#x6C34;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x4F30;&#x8BA1;&#x4E5F;&#x662F;&#x6CA1;&#x4EBA;&#x613F;&#x610F;&#x8981;&#x7684;&#x3002;<br>&#x73B0;&#x5728;&#x7A0B;&#x5E8F;&#x5458;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5165;&#x95E8;&#x7684;&#x95E8;&#x69DB;&#x975E;&#x5E38;&#x4F4E;&#xFF0C;&#x4E5F;&#x5C31;&#x9020;&#x6210;&#x884C;&#x4E1A;&#x7684;&#x6C34;&#x5E73;&#x53C2;&#x5DEE;&#x4E0D;&#x9F50;&#x3002;&#x505A;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5F88;&#x96BE;&#x4E48;&#xFF0C;&#x627E;&#x4E2A;&#x73B0;&#x6210;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x61C2;&#x70B9;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5EFA;&#x4E2A;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x524D;&#x7AEF;&#x518D;&#x627E;&#x4E2A;&#x73B0;&#x6210;&#x7684;&#x6A21;&#x677F;&#xFF0C;&#x4FEE;&#x4FEE;&#x6539;&#x6539;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#x3002;<br>&#x4F46;&#x662F;&#x6EE1;&#x8DB3;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x4E86;&#xFF1F;&#x90A3;&#x4E48;&#x6C34;&#x5E73;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x5176;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x70B9;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7814;&#x7A76;&#x7684;&#x5F88;&#x6DF1;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x7AD9;&#x7684;&#x5927;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x7684;&#x6548;&#x7387;&#xFF0C;&#xFF0C;&#x672A;&#x6765;&#x8BA1;&#x7B97;&#x673A;&#x884C;&#x4E1A;&#x7684;&#x6280;&#x672F;&#x5206;&#x5DE5;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x7EC6;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x4E13;&#x5BB6;&#x90FD;&#x662F;&#x76F8;&#x5F53;&#x6709;&#x7528;&#x7684;</p>
<h2 id="Stay-hungry-&#xFF0C;Stay-Foolish"><a href="#Stay-hungry-&#xFF0C;Stay-Foolish" class="headerlink" title="Stay hungry &#xFF0C;Stay Foolish"></a>Stay hungry &#xFF0C;Stay Foolish</h2><p>&#x6280;&#x672F;&#x662F;&#x6C38;&#x65E0;&#x6B62;&#x5883;&#x7684;&#xFF0C;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x5BF9;&#x4E8E;&#x65B0;&#x7684;&#x6280;&#x672F;&#x654F;&#x611F;&#x5EA6;&#xFF0C;&#x4FDD;&#x6301;&#x5B66;&#x4E60;&#x7684;&#x70ED;&#x60C5;<br>&#x540C;&#x65F6;&#x770B;&#x4E66;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x66F4;&#x591A;&#x7684;&#x5F97;&#x5230;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6700;&#x5FEB;&#x7684;&#x65F6;&#x95F4;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x6240;&#x5728;<br>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x597D;&#x7684;&#x601D;&#x7EF4;&#x6A21;&#x5F0F;&#xFF0C;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x9047;&#x5230;&#x9700;&#x6C42;&#x4E86;&#xFF0C;&#x5148;&#x767E;&#x5EA6;&#xFF0C;&#x770B;&#x770B;&#x6709;&#x6CA1;&#x6709;&#x76F8;&#x4F3C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x9047;&#x5230;bug&#x518D;&#x53BB;&#x767E;&#x5EA6;&#x4E0B;&#xFF0C;&#x770B;&#x770B;&#x522B;&#x4EBA;&#x662F;&#x600E;&#x4E48;&#x89E3;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x6C38;&#x8FDC;&#x53EA;&#x662F;&#x7801;&#x519C;&#x800C;&#x5DF2;<br>&#x542C;&#x8BF4;&#x4E00;&#x672C;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x4E66;&#x7C4D;&#x81F3;&#x5C11;&#x8981;&#x8BFB;12&#x904D;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x3002;&#x3002;&#x3002;</p>
<h2 id="&#x4E8B;&#x60C5;&#x505A;&#x5F97;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x63D0;&#x662F;&#x80FD;&#x5173;&#x6CE8;&#x5230;&#x7EC6;&#x8282;"><a href="#&#x4E8B;&#x60C5;&#x505A;&#x5F97;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x63D0;&#x662F;&#x80FD;&#x5173;&#x6CE8;&#x5230;&#x7EC6;&#x8282;" class="headerlink" title="&#x4E8B;&#x60C5;&#x505A;&#x5F97;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x63D0;&#x662F;&#x80FD;&#x5173;&#x6CE8;&#x5230;&#x7EC6;&#x8282;"></a>&#x4E8B;&#x60C5;&#x505A;&#x5F97;&#x4E13;&#x4E1A;&#x7684;&#x524D;&#x63D0;&#x662F;&#x80FD;&#x5173;&#x6CE8;&#x5230;&#x7EC6;&#x8282;</h2><p>&#x6211;&#x89C9;&#x5F97;&#x7EC6;&#x5FC3;&#x8C28;&#x614E;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4FEE;&#x517B;&#x548C;&#x7D20;&#x8D28;&#xFF0C;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x5565;&#x7684;&#x5012;&#x662F;&#x66F4;&#x4E3A;&#x4E0A;&#x4E00;&#x5C42;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6574;&#x5929;&#x60F3;&#x597D;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x67B6;&#x6784;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x5F53;&#x4F60;&#x8DDF;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x8BF4;&#x89E3;&#x4E86;&#x534A;&#x5929;&#x7684;bug&#x662F;&#x56E0;&#x4E3A;&#x5C11;&#x4E86;&#x4E2A;&#x5206;&#x53F7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5FC3;&#x4E2D;&#x9119;&#x89C6;&#x7684;&#x662F;&#x591A;&#x4E48;&#x7684;&#x6CE2;&#x6D9B;&#x6C79;&#x6D8C;&#x4E48;&#x3002;<br>&#x5982;&#x679C;&#x8FDE;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x57FA;&#x672C;&#x7684;&#x7EC6;&#x8282;&#x90FD;&#x4E0D;&#x80FD;&#x6CE8;&#x610F;&#x7684;&#x8BDD;&#xFF0C;&#x8C08;&#x4F55;&#x5176;&#x4ED6;&#x5462;<br>&#x795D;&#x5927;&#x5BB6;&#x6210;&#x4E3A;&#x6770;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF01;&#xFF01;</p>
<blockquote>
<p>IT&#x6C5F;&#x6E56;&#x5B98;&#x7F51;&#x7FA4;&#xFF1A;383126909 &#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x6210;&#x957F;</p>
</blockquote>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/outstanding-programmer/" data-id="civhpzthg0025uwskguog7z16" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/outstanding-programmer/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-Blog-move-to-github" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/Blog-move-to-github/">博客迁移至Github</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/Blog-move-to-github/" class="article-date">
  <time datetime="2016-08-02T08:28:45.000Z" itemprop="datePublished">2016-08-02</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Test/">Test</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<p>&#x66FE;&#x5728;&#x767E;&#x5EA6;&#x7A7A;&#x95F4;, CSDN, &#x535A;&#x5BA2;&#x56ED;, LOFTER&#x7B49;&#x7F51;&#x7AD9;&#x653E;&#x8FC7;&#x535A;&#x5BA2;, &#x73B0;&#x7EDF;&#x4E00;&#x8FC1;&#x79FB;&#x81F3;Github.</p>
</blockquote>
<ul>
<li>&#x767E;&#x5EA6;&#x7A7A;&#x95F4;: <a href="https://wenzhang.baidu.com/" target="_blank" rel="external">https://wenzhang.baidu.com/</a></li>
<li>CSDN: <a href="http://blog.csdn.net/sinat_26663605/" target="_blank" rel="external">http://blog.csdn.net/sinat_26663605/</a></li>
<li>&#x535A;&#x5BA2;&#x56ED;: <a href="http://www.cnblogs.com/snowyying" target="_blank" rel="external">http://www.cnblogs.com/snowyying</a></li>
<li>LOFTER: <a href="http://snowyying.lofter.com/" target="_blank" rel="external">http://snowyying.lofter.com/</a> &#x2026;</li>
</ul>
<p>&#x4EE5;&#x524D;&#x5199;&#x7684;&#x6587;&#x7AE0;, &#x5C06;&#x4F1A;&#x9009;&#x62E9;&#x6027;&#x7684;&#x8FC1;&#x79FB;&#x5230;&#x8FD9;&#x91CC;, &#x5176;&#x4ED6;&#x535A;&#x5BA2;&#x5C06;&#x4E0D;&#x518D;&#x66F4;&#x65B0;.</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/Blog-move-to-github/" data-id="civhpztfy000kuwsk723r2989" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/Blog-move-to-github/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/blog/">blog</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/github/">github</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-c-cpp-growth" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/c-cpp-growth/">C/C++ 成长路线 (教程)</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/c-cpp-growth/" class="article-date">
  <time datetime="2016-08-01T11:05:07.000Z" itemprop="datePublished">2016-08-01</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/C-C/">C/C++</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="1-&#x57FA;&#x7840;"><a href="#1-&#x57FA;&#x7840;" class="headerlink" title="1. &#x57FA;&#x7840;"></a>1. &#x57FA;&#x7840;</h2><ul>
<li>The C++ Programming Language</li>
<li>The C++ standard library</li>
</ul>
<h2 id="2-&#x6DF1;&#x5165;"><a href="#2-&#x6DF1;&#x5165;" class="headerlink" title="2. &#x6DF1;&#x5165;"></a>2. &#x6DF1;&#x5165;</h2><blockquote>
<p>7E1L</p>
</blockquote>
<ul>
<li>Effective C++</li>
<li>More Effective C++</li>
<li>Effective modern C++</li>
<li>Exceptional C++</li>
<li>More Exceptional C++</li>
<li>Exceptional C++ Style</li>
<li>Effective STL</li>
<li>Imperfect C++</li>
</ul>
<h2 id="3-&#x6280;&#x5DE7;"><a href="#3-&#x6280;&#x5DE7;" class="headerlink" title="3. &#x6280;&#x5DE7;"></a>3. &#x6280;&#x5DE7;</h2><ul>
<li>Google&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x6307;&#x5357;</li>
<li>&#x4EE3;&#x7801;&#x6B63;&#x89E3;&#x4E4B;&#x9053;</li>
<li>&#x91CD;&#x6784; - &#x6539;&#x5584;&#x65E2;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x8BBE;&#x8BA1;</li>
<li>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</li>
<li>UML&#x7528;&#x6237;&#x6307;&#x5357;</li>
</ul>
<p><code>&#x81F3;&#x6B64;, &#x606D;&#x559C;&#x4F60;&#x5DF2;&#x7ECF;&#x5165;&#x95E8;&#x4E86;, &#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5728;&#x7B80;&#x5386;&#x4E0A;&#x5199;&#x4E0A;&apos;&#x4E86;&#x89E3;C++&apos;!</code></p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/c-cpp-growth/" data-id="civhpztg4000quwsk5smmg4i9" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/c-cpp-growth/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/C/">C</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/C/">C++</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/学习/">学习</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/教程/">教程</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-it-kas-4-snowyying" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/it-kas-4-snowyying/">IT KAs 4 Snowyying</a>
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/it-kas-4-snowyying/" class="article-date">
  <time datetime="2016-07-31T16:00:00.000Z" itemprop="datePublished">2016-08-01</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Test/">Test</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <blockquote>
<p>&#x6574;&#x7406;&#x65F6;&#x95F4;: 20160801</p>
</blockquote>
<h2 id="1-C"><a href="#1-C" class="headerlink" title="1. C++"></a>1. C++</h2><ul>
<li>C (procedural)</li>
<li>C++ (object-oriented)</li>
<li>Template (generic) [meta programming]</li>
<li>STL [functional]</li>
</ul>
<h2 id="2-Base"><a href="#2-Base" class="headerlink" title="2. Base"></a>2. Base</h2><ul>
<li>&#x6570;&#x636E;&#x7ED3;&#x6784;</li>
<li>&#x5E38;&#x7528;&#x7B97;&#x6CD5;</li>
<li>&#x9AD8;&#x6570;/&#x7EBF;&#x4EE3;/&#x79BB;&#x6563;</li>
</ul>
<h2 id="3-SA"><a href="#3-SA" class="headerlink" title="3. SA"></a>3. SA</h2><ul>
<li>&#x7CFB;&#x7EDF;&#x5206;&#x6790;&#x5E08;</li>
<li>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5E08;</li>
<li>&#x9879;&#x76EE;&#x7BA1;&#x7406;</li>
<li>GoF</li>
<li>UML</li>
<li>SQuaRE</li>
</ul>
<h2 id="4-&#x7F51;&#x7EDC;"><a href="#4-&#x7F51;&#x7EDC;" class="headerlink" title="4. &#x7F51;&#x7EDC;"></a>4. &#x7F51;&#x7EDC;</h2><ul>
<li>TCP/IP&#x534F;&#x8BAE;</li>
<li>TCP/IP&#x8DEF;&#x7531;&#x6280;&#x672F;</li>
<li>&#x7F51;&#x7EDC;&#x5E93; (SOCKET+P2P)</li>
</ul>
<h2 id="5-&#x5B89;&#x5168;"><a href="#5-&#x5B89;&#x5168;" class="headerlink" title="5. &#x5B89;&#x5168;"></a>5. &#x5B89;&#x5168;</h2><ul>
<li>&#x7F51;&#x7EDC;&#x5B89;&#x5168;</li>
<li>&#x672C;&#x5730;&#x5B89;&#x5168; [ASM/PE/Windows Kernel/Driver]</li>
<li>&#x6E17;&#x900F;&#x6D4B;&#x8BD5; [Kali linux]</li>
</ul>
<h2 id="6-&#x6269;&#x5C55;"><a href="#6-&#x6269;&#x5C55;" class="headerlink" title="6. &#x6269;&#x5C55;"></a>6. &#x6269;&#x5C55;</h2><ul>
<li>&#x89C4;&#x8303;/&#x6807;&#x51C6;/&#x6307;&#x5357;</li>
<li>&#x6D4B;&#x8BD5; [gtest/vs]</li>
<li>&#x5D4C;&#x5165;&#x5F0F;&#x7CFB;&#x7EDF;</li>
</ul>
<h2 id="7-&#x4EFB;&#x52A1;"><a href="#7-&#x4EFB;&#x52A1;" class="headerlink" title="7. &#x4EFB;&#x52A1;"></a>7. &#x4EFB;&#x52A1;</h2><ul>
<li>&#x57FA;&#x7840;/&#x5E38;&#x7528;&#x5E93;</li>
<li>swebok_v3_zh</li>
</ul>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/it-kas-4-snowyying/" data-id="civhpztgu001kuwsk66x9ap62" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/it-kas-4-snowyying/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/KAs/">KAs</a></li></ul>

    </footer>
  </div>
  
</article>


  


  <nav id="page-nav">
    <a class="extend prev" rel="prev" href="/">&laquo; __('prev')</a><a class="page-number" href="/">1</a><span class="page-number current">2</span>
  </nav>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C/">C++</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Database/">Database</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/I-O/">I/O</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Manage/">Manage</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/多媒体/">多媒体</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/计算机基础/">计算机基础</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/软件工程/">软件工程</a><span class="category-list-count">3</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 14px;">C</a> <a href="/tags/C/" style="font-size: 14px;">C++</a> <a href="/tags/C-C/" style="font-size: 12px;">C/C++</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/I-O/" style="font-size: 14px;">I/O</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NTP/" style="font-size: 10px;">NTP</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/TCP-IP/" style="font-size: 12px;">TCP/IP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 10px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 12px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 12px;">linux</a> <a href="/tags/select/" style="font-size: 12px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 12px;">socket</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/性能/" style="font-size: 14px;">性能</a> <a href="/tags/成长/" style="font-size: 16px;">成长</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/程序员/" style="font-size: 12px;">程序员</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 18px;">网络</a> <a href="/tags/设计模式/" style="font-size: 10px;">设计模式</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">4</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">19</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/square-overview/">SQuaRE 简介</a>
          </li>
        
          <li>
            <a href="/2016/uml-overview/">UML 概述</a>
          </li>
        
          <li>
            <a href="/2016/swebok-overview/">swebok 概述</a>
          </li>
        
          <li>
            <a href="/2016/design-pattern/">设计模式概述</a>
          </li>
        
          <li>
            <a href="/2016/trace-route/">trace route 网络命令原理</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>