<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>CMMI 概览 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.csai.cn 2007-05-09
&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;CMMICMMI &amp;#x7684;&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;&amp;#xFF1A;Capability Maturity Model Integration&amp;#xFF0C;&amp;#x5373;&amp;#x80FD;&amp;#x529B;&amp;#x6210;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="CMMI 概览">
<meta property="og:url" content="http://snowyying.site/2016/swe-cmmi-overview/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.csai.cn 2007-05-09
&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;CMMICMMI &amp;#x7684;&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;&amp;#xFF1A;Capability Maturity Model Integration&amp;#xFF0C;&amp;#x5373;&amp;#x80FD;&amp;#x529B;&amp;#x6210;&amp;#">
<meta property="og:updated_time" content="2017-04-07T08:47:09.588Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="CMMI 概览">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA;: http://www.csai.cn 2007-05-09
&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;CMMICMMI &amp;#x7684;&amp;#x5168;&amp;#x79F0;&amp;#x4E3A;&amp;#xFF1A;Capability Maturity Model Integration&amp;#xFF0C;&amp;#x5373;&amp;#x80FD;&amp;#x529B;&amp;#x6210;&amp;#">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不摧, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.site"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-swe-cmmi-overview" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      CMMI 概览
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/swe-cmmi-overview/" class="article-date">
  <time datetime="2016-11-25T03:08:05.000Z" itemprop="datePublished">2016-11-25</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/SWE/">SWE</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA;: http://www.csai.cn 2007-05-09</code></p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;CMMI"><a href="#&#x4EC0;&#x4E48;&#x662F;CMMI" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;CMMI"></a>&#x4EC0;&#x4E48;&#x662F;CMMI</h2><p>CMMI &#x7684;&#x5168;&#x79F0;&#x4E3A;&#xFF1A;Capability Maturity Model Integration&#xFF0C;&#x5373;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;&#x96C6;&#x6210;&#x3002;CMMI&#x662F;CMM&#x6A21;&#x578B;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;&#x65E9;&#x671F;&#x7684;CMMI&#xFF08;CMMI-SE/SW/IPPD&#xFF09;1.02&#x7248;&#x672C;&#x662F;&#x5E94;&#x7528;&#x4E8E;&#x8F6F;&#x4EF6;&#x4E1A;&#x9879;&#x76EE;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;SEI&#x5728;&#x90E8;&#x5206;&#x56FD;&#x5BB6;&#x548C;&#x5730;&#x533A;&#x5F00;&#x59CB;&#x63A8;&#x5E7F;&#x548C;&#x8BD5;&#x7528;&#x3002;&#x968F;&#x7740;&#x5E94;&#x7528;&#x7684;&#x63A8;&#x5E7F;&#x4E0E;&#x6A21;&#x578B;&#x672C;&#x8EAB;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6F14;&#x7ECE;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x7684;&#x7EFC;&#x5408;&#x6027;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x81EA;&#x4ECE;1994 &#x5E74;SEI &#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#x8F6F;&#x4EF6;CMM &#x4EE5;&#x6765;&#xFF0C;&#x76F8;&#x7EE7;&#x53C8;&#x5F00;&#x53D1;&#x51FA;&#x4E86;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x3001;&#x8F6F;&#x4EF6;&#x91C7;&#x8D2D;&#x3001;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x4EE5;&#x53CA;&#x96C6;&#x6210;&#x4EA7;&#x54C1;&#x548C;&#x8FC7;&#x7A0B;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x7684;&#x591A;&#x4E2A;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x5728;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#x90FD;&#x5F97;&#x5230;&#x4E86;&#x826F;&#x597D;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x9700;&#x8981;&#x540C;&#x65F6;&#x91C7;&#x7528;&#x591A;&#x79CD;&#x6A21;&#x578B;&#x6765;&#x6539;&#x8FDB;&#x81EA;&#x5DF1;&#x591A;&#x65B9;&#x9762;&#x8FC7;&#x7A0B;&#x80FD;&#x529B;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x65F6;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x4F53;&#x73B0;&#x5728;&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x80FD;&#x96C6;&#x4E2D;&#x5176;&#x4E0D;&#x540C;&#x8FC7;&#x7A0B;&#x6539;&#x8FDB;&#x7684;&#x80FD;&#x529B;&#x4EE5;&#x53D6;&#x5F97;&#x66F4;&#x5927;&#x6210;&#x7EE9;&#xFF1B;</li>
<li>&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x91CD;&#x590D;&#x7684;&#x57F9;&#x8BAD;&#x3001;&#x8BC4;&#x4F30;&#x548C;&#x6539;&#x8FDB;&#x6D3B;&#x52A8;&#xFF0C;&#x56E0;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x8BB8;&#x591A;&#x6210;&#x672C;&#xFF1B;</li>
<li>&#x9047;&#x5230;&#x4E0D;&#x540C;&#x6A21;&#x578B;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x5BF9;&#x76F8;&#x540C;&#x4E8B;&#x7269;&#x8BF4;&#x6CD5;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6216;&#x6D3B;&#x52A8;&#x4E0D;&#x534F;&#x8C03;&#xFF0C;&#x751A;&#x81F3;&#x76F8;&#x62B5;&#x89E6;&#x3002;</li>
</ul>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x5E0C;&#x671B;&#x6574;&#x5408;&#x4E0D;&#x540C;CMM &#x6A21;&#x578B;&#x7684;&#x9700;&#x6C42;&#x4EA7;&#x751F;&#x4E86;&#x3002;1997 &#x5E74;&#xFF0C;&#x7F8E;&#x56FD;&#x8054;&#x90A6;&#x822A;&#x7A7A;&#x7BA1;&#x7406;&#x5C40;&#xFF08;FAA&#xFF09;&#x5F00;&#x53D1;&#x4E86;FAA-iCMMSM&#xFF08;&#x8054;&#x90A6;&#x822A;&#x7A7A;&#x7BA1;&#x7406;&#x5C40;&#x7684;&#x96C6;&#x6210;CMM&#xFF09;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x96C6;&#x6210;&#x4E86;&#x9002;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x7684;SE-CMM&#x3001;&#x8F6F;&#x4EF6;&#x83B7;&#x53D6;&#x7684;SA-CMM &#x548C;&#x8F6F;&#x4EF6;&#x7684;SW-CMM &#x4E09;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x539F;&#x5219;&#x3001;&#x6982;&#x5FF5;&#x548C;&#x5B9E;&#x8DF5;&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x5316;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>CMMI &#x4E0E;CMM &#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#xFF1A; CMMISM-SE/SW/IPPD/SS 1.1 &#x7248;&#x672C;&#x6709;&#x56DB;&#x4E2A;&#x96C6;&#x6210;&#x6210;&#x5206;&#xFF0C;&#x5373;&#xFF1A;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;(SE)&#x548C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;(SW)&#x662F;&#x57FA;&#x672C;&#x7684;&#x79D1;&#x76EE;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x4E9B;&#x7EC4;&#x7EC7;&#x8FD8;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x96C6;&#x6210;&#x4EA7;&#x54C1;&#x548C;&#x8FC7;&#x7A0B;&#x5F00;&#x53D1;&#x65B9;&#x9762;(IPPD)&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x6D89;&#x53CA;&#x5230;&#x4F9B;&#x5E94;&#x5546;&#x5916;&#x5305;&#x7BA1;&#x7406;&#x53EF;&#x4EE5;&#x76F8;&#x5E94;&#x7684;&#x5E94;&#x7528;SS(Supplier Sourcing)&#x90E8;&#x5206;&#x3002;</p>
<p>CMMI &#x6709;&#x4E24;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x5927;&#x5BB6;&#x5F88;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x548C;&#x8F6F;&#x4EF6;CMM &#x4E00;&#x6837;&#x7684;&#x9636;&#x6BB5;&#x5F0F;&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x8FDE;&#x7EED;&#x5F0F;&#x7684;&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF1A;&#x9636;&#x6BB5;&#x5F0F;&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#x4ECD;&#x7136;&#x628A;CMMI &#x4E2D;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x8FC7;&#x7A0B;&#x533A;&#x57DF;&#x5206;&#x6210;&#x4E86;5 &#x4E2A;&#x6210;&#x719F;&#x5EA6;&#x7EA7;&#x522B;&#xFF0C;&#x5E2E;&#x52A9;&#x5B9E;&#x65BD;CMMI &#x7684;&#x7EC4;&#x7EC7;&#x5EFA;&#x8BAE;&#x4E00;&#x6761;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x6539;&#x8FDB;&#x53D1;&#x5C55;&#x9053;&#x8DEF;&#x3002;&#x800C;&#x8FDE;&#x7EED;&#x5F0F;&#x8868;&#x73B0;&#x65B9;&#x6CD5;&#x5219;&#x901A;&#x8FC7;&#x5C06;CMMI &#x4E2D;&#x8FC7;&#x7A0B;&#x533A;&#x57DF;&#x5206;&#x4E3A;&#x56DB;&#x5927;&#x7C7B;&#xFF1A;&#x8FC7;&#x7A0B;&#x7BA1;&#x7406;&#x3001;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x3001;&#x5DE5;&#x7A0B;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5927;&#x7C7B;&#x4E2D;&#x7684;&#x8FC7;&#x7A0B;&#x533A;&#x57DF;&#xFF0C;&#x53C8;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x4E3A;&#x57FA;&#x672C;&#x7684;&#x548C;&#x9AD8;&#x7EA7;&#x7684;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x6309;&#x7167;&#x8FDE;&#x7EED;&#x5F0F;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x5B9E;&#x65BD;CMMI&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x628A;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x67D0;&#x7C7B;&#x7684;&#x5B9E;&#x8DF5;&#x4E00;&#x76F4;&#x505A;&#x5230;&#x6700;&#x597D;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x8FC7;&#x7A0B;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x3002;</p>
<a id="more"></a>
<p>CMMI&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5173;&#x952E;&#x5143;&#x7D20;</p>
<p>CMMI&#x81EA;&#x51FA;&#x9053;&#x4EE5;&#x6765;&#xFF0C;&#x5B83;&#x6240;&#x8FBE;&#x5230;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x6CA1;&#x6709;&#x53D8;&#x8FC7;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x8D28;&#x91CF;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x65F6;&#x95F4;&#x8868;&#xFF0C;&#x7B2C;&#x4E09;&#x5C31;&#x662F;&#x8981;&#x7528;&#x6700;&#x4F4E;&#x7684;&#x6210;&#x672C;&#x3002;&#x4E0D;&#x8FC7;&#x7279;&#x522B;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;CMMI&#x4E0D;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x3001;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x8FD0;&#x7528;&#x4E8E;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x4E00;&#x4E2A;&#x8303;&#x7574;&#x2014;&#x2014;&#x5DE5;&#x7A0B;&#x8BBE;&#x8BA1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;TSP&#x7684;&#x5EFA;&#x7ACB;&#xFF0C;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x652F;&#x6301;CMMI&#x7684;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x90A3;&#x4E48;CMMI&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#x600E;&#x4E48;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C;&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x6982;&#x62EC;&#x4EC0;&#x4E48;&#x662F;CMMI&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x9886;&#x57DF;&#x91CC;&#x9762;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x70B9;&#x3002;&#x5B83;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x67B6;&#x6784;&#xFF0C;&#x80FD;&#x591F;&#x7528;&#x6765;&#x5EA6;&#x91CF;&#x4F60;&#x7684;&#x6709;&#x6548;&#x6027;&#x548C;&#x5B9E;&#x7528;&#x6027;&#xFF1B;&#x80FD;&#x591F;&#x627E;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E9B;&#x673A;&#x4F1A;&#xFF0C;&#x7EE7;&#x7EED;&#x6539;&#x8FDB;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5305;&#x62EC;&#x5728;&#x5546;&#x4E1A;&#x76EE;&#x6807;&#x3001;&#x7B56;&#x7565;&#x8FD8;&#x6709;&#x964D;&#x4F4E;&#x9879;&#x76EE;&#x7684;&#x98CE;&#x9669;&#x7B49;&#x65B9;&#x9762;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;CMMI&#x7684;&#x8D77;&#x6E90;"><a href="#&#x4E00;&#x3001;CMMI&#x7684;&#x8D77;&#x6E90;" class="headerlink" title="&#x4E00;&#x3001;CMMI&#x7684;&#x8D77;&#x6E90;"></a>&#x4E00;&#x3001;CMMI&#x7684;&#x8D77;&#x6E90;</h2><p>&#x968F;&#x7740;&#x4EBA;&#x4EEC;&#x5BF9;CMM&#x7814;&#x7A76;&#x7684;&#x4E0D;&#x65AD;&#x6DF1;&#x5165;&#xFF0C;&#x5176;&#x4ED6;&#x5B66;&#x79D1;&#x4E5F;&#x7ED3;&#x5408;&#x672C;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x9646;&#x7EED;&#x63A8;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;CMM&#x6A21;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;&#x3001;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;&#x7B49;&#x7B49;&#xFF1A;</p>
<ol>
<li>SW-CMM (Software CMM) &#x8F6F;&#x4EF6;CMM</li>
<li>SE-CMM (System Engineering CMM) &#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;CMM</li>
<li>SA-CMM (Software Acquisition CMM) &#x8F6F;&#x4EF6;&#x91C7;&#x8D2D;CMM</li>
<li>IPT-CMM (Integrated Product Team CMM) &#x96C6;&#x6210;&#x4EA7;&#x54C1;&#x7FA4;&#x7EC4;CMM</li>
<li>P-CMM (People CMM) &#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;</li>
</ol>
<p>&#x4E3A;&#x4E86;&#x4EE5;&#x793A;&#x533A;&#x522B;&#xFF0C;&#x56FD;&#x5185;&#x5916;&#x5F88;&#x591A;&#x8D44;&#x6599;&#x628A;CMM&#x53EB;&#x505A;SW-CMM&#x3002;&#x6309;&#x7167;SEI&#x539F;&#x6765;&#x7684;&#x8BA1;&#x5212;&#xFF0C;CMM&#x7684;&#x6539;&#x8FDB;&#x7248;&#x672C;2.0&#x5E94;&#x8BE5;&#x5728;1997&#x5E74;11&#x6708;&#x5B8C;&#x6210;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53D6;&#x5F97;&#x7248;&#x672C;2.0&#x5F97;&#x5B9E;&#x8DF5;&#x53CD;&#x9988;&#x610F;&#x89C1;&#x4E4B;&#x540E;&#xFF0C;&#x5728;1999&#x5E74;&#x5B8C;&#x6210;&#x51C6;CMM2.0&#x7248;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7F8E;&#x56FD;&#x56FD;&#x9632;&#x90E8;&#x529E;&#x516C;&#x5BA4;&#x8981;&#x6C42;SEI&#x63A8;&#x8FDF;&#x53D1;&#x5E03;CMM2.0&#x7248;&#x672C;&#xFF0C;&#x800C;&#x8981;&#x5148;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x7D27;&#x8FEB;&#x7684;&#x9879;&#x76EE;CMMI&#x3002;</p>
<p>CMMI&#xFF08;Capability Maturity Model Integration&#xFF09;&#x5373;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x96C6;&#x6210;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x7F8E;&#x56FD;&#x56FD;&#x9632;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x8BBE;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x60F3;&#x628A;&#x73B0;&#x5728;&#x6240;&#x6709;&#x7684;&#x4EE5;&#x53CA;&#x5C06;&#x88AB;&#x53D1;&#x5C55;&#x51FA;&#x6765;&#x7684;&#x5404;&#x79CD;&#x80FD;&#x529B;&#x6210;&#x719F;&#x5EA6;&#x6A21;&#x578B;&#xFF0C;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x4E2D;&#x53BB;&#x3002;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x6709;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x8F6F;&#x4EF6;&#x91C7;&#x8D2D;&#x65B9;&#x6CD5;&#x7684;&#x6539;&#x9769;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x79CD;&#x4ECE;&#x96C6;&#x6210;&#x4EA7;&#x54C1;&#x4E0E;&#x8FC7;&#x7A0B;&#x53D1;&#x5C55;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x3001;&#x5305;&#x542B;&#x5065;&#x5168;&#x7684;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x539F;&#x5219;&#x7684;&#x8FC7;&#x7A0B;&#x6539;&#x8FDB;&#x3002;&#x5C31;&#x8F6F;&#x4EF6;&#x800C;&#x8A00;&#xFF0C;CMMI&#x662F;SW-CMM&#x7684;&#x4FEE;&#x8BA2;&#x672C;&#x3002;&#x5B83;&#x517C;&#x6536;&#x4E86;SW-CMM 2.0&#x7248;C&#x7A3F;&#x8349;&#x6848;&#x548C;SPA&#x4E2D;&#x66F4;&#x5408;&#x7406;&#x3001;&#x66F4;&#x79D1;&#x5B66;&#x548C;&#x66F4;&#x5468;&#x5BC6;&#x7684;&#x4F18;&#x70B9;&#x3002;SEI&#x5728;&#x53D1;&#x8868;CMMI-SE/SW 1.0&#x7248;&#x65F6;&#xFF0C;&#x5BA3;&#x5E03;&#x5927;&#x7EA6;&#x7528;&#x4E24;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x4ECE;CMM&#x5230;CMMI&#x7684;&#x8FC7;&#x6E21;&#x3002;</p>
<p>CMMI&#x9879;&#x76EE;&#x66F4;&#x4E3A;&#x5DE5;&#x4E1A;&#x754C;&#x548C;&#x653F;&#x5E9C;&#x90E8;&#x95E8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x7684;&#x4EA7;&#x54C1;&#x96C6;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x6D88;&#x9664;&#x4E0D;&#x540C;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x548C;&#x91CD;&#x590D;&#xFF0C;&#x964D;&#x4F4E;&#x57FA;&#x4E8E;&#x6A21;&#x578B;&#x6539;&#x5584;&#x7684;&#x6210;&#x672C;&#x3002;CMMI&#x5C06;&#x4EE5;&#x66F4;&#x52A0;&#x7CFB;&#x7EDF;&#x548C;&#x4E00;&#x81F4;&#x7684;&#x6846;&#x67B6;&#x6765;&#x6307;&#x5BFC;&#x7EC4;&#x7EC7;&#x6539;&#x5584;&#x8F6F;&#x4EF6;&#x8FC7;&#x7A0B;&#xFF0C;&#x63D0;&#x9AD8;&#x4EA7;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x5F00;&#x53D1;&#x3001;&#x83B7;&#x53D6;&#x548C;&#x7EF4;&#x62A4;&#x80FD;&#x529B;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;"><a href="#&#x4E8C;&#x3001;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;" class="headerlink" title="&#x4E8C;&#x3001;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;"></a>&#x4E8C;&#x3001;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;</h2><p>&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x9879;&#x76EE;&#x5DE5;&#x7A0B;&#x8D70;&#x5411;&#x4E16;&#x754C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x897F;&#x65B9;&#x56FD;&#x5BB6;&#x63A5;&#x5230;&#x8BA2;&#x5355;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x6211;&#x56FD;&#x4F01;&#x4E1A;&#x5B9E;&#x65BD;CMMI&#x7684;&#x610F;&#x4E49;&#x7684;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x610F;&#x4E49;&#x5219;&#x662F;&#xFF0C;CMMI&#x7684;&#x5B9E;&#x65BD;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x6211;&#x56FD;&#x4F01;&#x4E1A;&#x7684;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;&#x964D;&#x4F4E;&#x4F01;&#x4E1A;&#x7684;&#x5DE5;&#x7A0B;&#x6210;&#x672C;&#x3002;&#x4E8B;&#x5B9E;&#x8868;&#x660E;&#xFF0C;&#x4F01;&#x4E1A;&#x5B9E;&#x65BD;CMMI&#x6280;&#x672F;&#x7684;&#x6295;&#x5165;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x4E30;&#x539A;&#x7684;&#x56DE;&#x62A5;&#x3002;&#x636E;SEI&#x7EDF;&#x8BA1;&#xFF0C;&#x7528;&#x4E8E;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4E0A;&#x7684;CMMI&#x7684;&#x6295;&#x8D44;&#xFF0C;&#x5176;&#x56DE;&#x62A5;&#x7387;&#x5728;5:1&#x5230;8:1&#x4E4B;&#x95F4;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x7EB7;&#x7EB7;&#x5B9E;&#x65BD;CMMI&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x6280;&#x672F;&#x3002;</p>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x5F88;&#x591A;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x7EB7;&#x7EB7;&#x5B9E;&#x65BD;CMMI&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#x53CD;&#x6620;&#x4E86;&#x6211;&#x56FD;&#x4F01;&#x4E1A;&#x5728;&#x8FDB;&#x5165;WTO&#x540E;&#x7684;&#x5371;&#x673A;&#x610F;&#x8BC6;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x4E16;&#x754C;&#x63A5;&#x8F68;&#x7684;&#x8FEB;&#x5207;&#x613F;&#x671B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5219;&#x53CD;&#x6620;&#x51FA;&#x6211;&#x56FD;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x5728;&#x6539;&#x8FDB;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x4E0A;&#x6240;&#x4F5C;&#x7684;&#x52AA;&#x529B;&#x3002;&#x4F46;&#x662F;CMMI&#x5230;&#x5E95;&#x80FD;&#x591F;&#x4E3A;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5BF9;&#x91C7;&#x8D2D;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x638C;&#x63E1;&#x4E86;CMMI&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x6709;&#x76EE;&#x7684;&#x5730;&#x8003;&#x5BDF;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4EBA;&#x5458;&#x6216;&#x516C;&#x53F8;&#x7684;&#x5B9E;&#x65BD;&#x80FD;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x6240;&#x91C7;&#x8D2D;&#x7684;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x987A;&#x5229;&#x5B8C;&#x6210;&#x3002;&#x5BF9;&#x4E8E;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x6765;&#x8BF4;&#xFF0C;&#x638C;&#x63E1;CMMI&#x6280;&#x672F;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x591F;&#x4F7F;&#x9879;&#x76EE;&#x9AD8;&#x8D28;&#x91CF;&#xFF0C;&#x4F4E;&#x6210;&#x672C;&#xFF0C;&#x6309;&#x671F;&#x9650;&#x5730;&#x5B8C;&#x6210;&#x3002;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x8001;&#x603B;&#x6765;&#x8BF4;&#xFF0C;CMMI&#x8FD8;&#x80FD;&#x591F;&#x5F15;&#x5165;&#x79D1;&#x5B66;&#x7684;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#xFF0C;&#x63D0;&#x5347;&#x4F01;&#x4E1A;&#x7684;&#x6574;&#x4F53;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;</p>
<p>&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x901A;&#x8FC7;CMMI&#x8BC4;&#x4F30;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x627F;&#x5305;&#x56FD;&#x9632;&#x5DE5;&#x7A0B;&#x6216;&#x4E00;&#x4E9B;&#x5927;&#x4F01;&#x4E1A;&#x7684;&#x5DE5;&#x7A0B;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x81EA;&#x8EAB;&#x7684;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x3002;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x7684;&#x5DE5;&#x7A0B;&#x9879;&#x76EE;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x90FD;&#x8981;&#x6C42;&#x627F;&#x5305;&#x5546;&#x6709;&#x4E00;&#x5B9A;&#x7684;CMMI&#x7EA7;&#x522B;&#x4F5C;&#x4E3A;&#x53C2;&#x52A0;&#x6295;&#x6807;&#x7684;&#x8D44;&#x683C;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x5F00;&#x59CB;&#x8981;&#x6C42;&#x5176;&#x5DE5;&#x7A0B;&#x627F;&#x5305;&#x5546;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;CMMI&#x7EA7;&#x522B;&#x3002;&#x7EA7;&#x522B;&#x9AD8;&#x7684;&#x4F01;&#x4E1A;&#x5728;&#x8D62;&#x5F97;&#x9879;&#x76EE;&#x7684;&#x7ADE;&#x6807;&#x4E2D;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;CMMI&#x7684;&#x7B49;&#x7EA7;&#x8BC4;&#x4F30;&#xFF0C;&#x4F01;&#x4E1A;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x5F88;&#x591A;&#x5546;&#x673A;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;CMMI&#x7684;&#x4E24;&#x79CD;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;"><a href="#&#x4E09;&#x3001;CMMI&#x7684;&#x4E24;&#x79CD;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;" class="headerlink" title="&#x4E09;&#x3001;CMMI&#x7684;&#x4E24;&#x79CD;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;"></a>&#x4E09;&#x3001;CMMI&#x7684;&#x4E24;&#x79CD;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;</h2><p>CMMI&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x7EA7;&#x522B;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x3002;CMMI&#x7684;&#x4E00;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#x4E3A;&#x8FDE;&#x7EED;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x80FD;&#x529B;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x63A5;&#x53D7;&#x8BC4;&#x4F30;&#x65F6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x81EA;&#x5DF1;&#x5E0C;&#x671B;&#x8BC4;&#x4F30;&#x7684;&#x9879;&#x76EE;&#x6765;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x3002;&#x56E0;&#x4E3A;&#x662F;&#x4F01;&#x4E1A;&#x81EA;&#x5DF1;&#x6311;&#x9009;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x8BC4;&#x4F30;&#x901A;&#x8FC7;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8F83;&#x5927;&#x4E00;&#x70B9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x53CD;&#x6620;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x6BD4;&#x8F83;&#x7A84;&#x4E00;&#x70B9;&#x3002;&#x5B83;&#x4EC5;&#x4EC5;&#x8868;&#x793A;&#x4F01;&#x4E1A;&#x5728;&#x8BE5;&#x9879;&#x76EE;&#x6216;&#x7C7B;&#x4F3C;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x65BD;&#x80FD;&#x529B;&#x8FBE;&#x5230;&#x4E86;&#x67D0;&#x4E00;&#x7B49;&#x7EA7;&#x3002;&#x800C;&#x53E6;&#x4E00;&#x79CD;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#x4E3A;&#x9636;&#x6BB5;&#x6027;&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x6210;&#x719F;&#x5EA6;&#xFF0C;&#x4EA6;&#x5373;&#x662F;&#x4F01;&#x4E1A;&#x5728;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4E0A;&#x7684;&#x7EFC;&#x5408;&#x5B9E;&#x529B;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x7531;&#x8BC4;&#x4F30;&#x5E08;&#x6765;&#x6311;&#x9009;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x7684;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x3002;&#x4E00;&#x822C;&#x5730;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x8981;&#x60F3;&#x5728;&#x9636;&#x6BB5;&#x6027;&#x8BC4;&#x4F30;&#x4E2D;&#x5F97;&#x5230;&#x4E09;&#x7EA7;&#xFF0C;&#x5176;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x7684;&#x5927;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x8981;&#x8FBE;&#x5230;&#x4E09;&#x7EA7;&#xFF0C;&#x5C0F;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x5728;&#x4E8C;&#x7EA7;&#xFF0C;&#x4F46;&#x7EDD;&#x4E0D;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x7EA7;&#x3002;&#x9636;&#x6BB5;&#x6027;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#x7684;&#x96BE;&#x5EA6;&#x8981;&#x5927;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x867D;&#x7136;&#xFF0C;CMMI&#x7684;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x8D28;&#x5185;&#x5BB9;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x3002;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x51C6;&#x5907;&#x8BC4;&#x4F30;&#x65F6;&#x8981;&#x505A;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x7BA1;&#x7406;&#x4E0A;&#x7684;&#x5E2E;&#x52A9;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F01;&#x4E1A;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x4F01;&#x4E1A;&#x6240;&#x83B7;&#x53D6;&#x7684;&#x5B9E;&#x60E0;&#x5E94;&#x8BE5;&#x662F;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#x3002;&#x5177;&#x4F53;&#x8981;&#x505A;&#x8FDE;&#x7EED;&#x6027;&#x8BC4;&#x4F30;&#xFF0C;&#x8FD8;&#x662F;&#x505A;&#x9636;&#x6BB5;&#x6027;&#x8BC4;&#x4F30;&#x5219;&#x8981;&#x770B;&#x4F01;&#x4E1A;&#x5BF9;&#x7B49;&#x7EA7;&#x8BC4;&#x4F30;&#x8BC1;&#x4E66;&#x7684;&#x5177;&#x4F53;&#x8981;&#x6C42;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;CMMI&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;"><a href="#&#x56DB;&#x3001;CMMI&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;" class="headerlink" title="&#x56DB;&#x3001;CMMI&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;"></a>&#x56DB;&#x3001;CMMI&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;</h2><p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x5F88;&#x591A;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x7EB7;&#x7EB7;&#x5B9E;&#x65BD;CMMI&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x5C11;&#x4F01;&#x4E1A;&#x5982;&#xFF1A;&#x4E1C;&#x8F6F;&#xFF0C;&#x6258;&#x666E;&#xFF0C;&#x534E;&#x4E3A;&#x7B49;&#x4F01;&#x4E1A;&#x901A;&#x8FC7;&#x4E86;&#x4E09;&#x7EA7;&#x6216;&#x56DB;&#x7EA7;&#x8BC4;&#x4F30;&#x3002; &#x8FD9;&#x4E00;&#x65B9;&#x9762;&#x53CD;&#x6620;&#x4E86;&#x6211;&#x56FD;&#x4F01;&#x4E1A;&#x5728;&#x8FDB;&#x5165;WTO&#x540E;&#x7684;&#x5371;&#x673A;&#x610F;&#x8BC6;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x4E16;&#x754C;&#x63A5;&#x8F68;&#x7684;&#x8FEB;&#x5207;&#x613F;&#x671B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5219;&#x53CD;&#x6620;&#x51FA;&#x6211;&#x56FD;&#x8F6F;&#x4EF6;&#x4F01;&#x4E1A;&#x5728;&#x6539;&#x8FDB;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x4E0A;&#x6240;&#x4F5C;&#x7684;&#x52AA;&#x529B;&#x3002;&#x4F46;&#x662F;CMMI&#x5230;&#x5E95;&#x80FD;&#x591F;&#x4E3A;&#x6211;&#x4EEC;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5BF9;&#x91C7;&#x8D2D;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x638C;&#x63E1;&#x4E86;CMMI&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x6709;&#x76EE;&#x7684;&#x5730;&#x8003;&#x5BDF;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4EBA;&#x5458;&#x6216;&#x516C;&#x53F8;&#x7684;&#x5B9E;&#x65BD;&#x80FD;&#x529B;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x6240;&#x91C7;&#x8D2D;&#x7684;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x987A;&#x5229;&#x5B8C;&#x6210;&#x3002;&#x5BF9;&#x4E8E;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x6765;&#x8BF4;&#xFF0C;&#x638C;&#x63E1;CMMI&#x6280;&#x672F;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#xFF0C; &#x4ECE;&#x800C;&#x80FD;&#x591F;&#x4F7F;&#x9879;&#x76EE;&#x9AD8;&#x8D28;&#x91CF;&#xFF0C;&#x4F4E;&#x6210;&#x672C;&#xFF0C;&#x6309;&#x671F;&#x9650;&#x5730;&#x5B8C;&#x6210;&#x3002; &#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x8001;&#x603B;&#x6765;&#x8BF4;&#xFF0C;CMMI&#x6280;&#x672F;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x63D0;&#x5347;&#x4F01;&#x4E1A;&#x7684;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x5F15;&#x5165;&#x79D1;&#x5B66;&#x7684;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#xFF0C;&#x63D0;&#x5347;&#x4F01;&#x4E1A;&#x7684;&#x6574;&#x4F53;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;</p>
<p>&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x5F88;&#x591A;&#x4F01;&#x4E1A;&#x901A;&#x8FC7;CMMI&#x8BC4;&#x4F30;&#x4E00;&#x65B9;&#x9762;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x627F;&#x5305;&#x56FD;&#x9632;&#x5DE5;&#x7A0B;&#x6216;&#x4E00;&#x4E9B;&#x5927;&#x4F01;&#x4E1A;&#x7684;&#x5DE5;&#x7A0B;&#x7684;&#x8981;&#x6C42;&#xFF0C; &#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x81EA;&#x8EAB;&#x7684;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x3002;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x7684;&#x5DE5;&#x7A0B;&#x9879;&#x76EE;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x90FD;&#x8981;&#x6C42;&#x627F;&#x5305;&#x5546;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;CMMI&#x7EA7;&#x522B;&#x4F5C;&#x4E3A;&#x53C2;&#x52A0;&#x6295;&#x6807;&#x7684;&#x8D44;&#x683C;&#x3002;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x4E1A;&#x5F00;&#x59CB;&#x8981;&#x6C42;&#x5176;&#x5DE5;&#x7A0B;&#x627F;&#x5305;&#x5546;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;CMMI&#x7EA7;&#x522B;&#x3002;&#x7EA7;&#x522B;&#x9AD8;&#x7684;&#x4F01;&#x4E1A;&#x5728;&#x8D62;&#x5F97;&#x9879;&#x76EE;&#x7684;&#x7ADE;&#x6807;&#x4E2D;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4F18;&#x52BF;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;CMMI&#x7684;&#x7B49;&#x7EA7;&#x8BC4;&#x4F30;&#xFF0C;&#x4F01;&#x4E1A;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x5F88;&#x591A;&#x5546;&#x673A;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4F01;&#x4E1A;&#x901A;&#x8FC7;CMMI&#x8BC4;&#x4F30;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x7684;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#xFF0C;&#x964D;&#x4F4E;&#x4F01;&#x4E1A;&#x7684;&#x5DE5;&#x7A0B;&#x6210;&#x672C;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x5B9E;&#x65BD;CMMI&#x6280;&#x672F;&#x7684;&#x6295;&#x5165;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x4E30;&#x539A;&#x7684;&#x56DE;&#x62A5;&#x3002;&#x636E;SEI&#x7EDF;&#x8BA1;&#xFF0C;&#x7528;&#x4E8E;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4E0A;&#x7684;CMMI&#x7684;&#x6295;&#x8D44;&#xFF0C;&#x5176;&#x56DE;&#x62A5;&#x7387;&#x5728;5&#xFF1A;1&#x5230;8&#xFF1A;1&#x4E4B;&#x95F4;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x7EB7;&#x7EB7;&#x5B9E;&#x65BD;CMMI&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x6280;&#x672F;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;CMMI&#x7684;&#x57FA;&#x672C;&#x8868;&#x8FF0;"><a href="#&#x4E94;&#x3001;CMMI&#x7684;&#x57FA;&#x672C;&#x8868;&#x8FF0;" class="headerlink" title="&#x4E94;&#x3001;CMMI&#x7684;&#x57FA;&#x672C;&#x8868;&#x8FF0;"></a>&#x4E94;&#x3001;CMMI&#x7684;&#x57FA;&#x672C;&#x8868;&#x8FF0;</h2><p>&#x5982;&#x679C;&#x4E00;&#x5BB6;&#x4F01;&#x4E1A;&#x5BF9;&#x5916;&#x5BA3;&#x79F0;&#x81EA;&#x5DF1;&#x901A;&#x8FC7;&#x4E86;CMMI&#x4E09;&#x7EA7;&#x8BC4;&#x4F30;&#xFF0C;&#x5916;&#x884C;&#x7684;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;&#x4E09;&#x7EA7;&#x6BD4;&#x4E8C;&#x7EA7;&#x8981;&#x9AD8;&#x3002; &#x5185;&#x884C;&#x7684;&#x4EBA;&#x5219;&#x8981;&#x95EE;&#x901A;&#x8FC7;&#x4E86;&#x4E09;&#x7EA7;&#x4EC0;&#x4E48;&#xFF1F; &#x56E0;&#x4E3A;&#xFF0C;CMMI&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x7EA7;&#x522B;&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x3002;CMMI&#x7684;&#x4E00;&#x79CD;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x4E3A;&#x8FDE;&#x7EED;&#x8868;&#x8FF0;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x80FD;&#x529B;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x63A5;&#x53D7;&#x8BC4;&#x4F30;&#x65F6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x81EA;&#x5DF1;&#x5E0C;&#x671B;&#x8BC4;&#x4F30;&#x7684;&#x9879;&#x76EE;&#x6765;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x3002;&#x56E0;&#x4E3A;&#x662F;&#x4F01;&#x4E1A;&#x81EA;&#x5DF1;&#x6311;&#x9009;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x8BC4;&#x4F30;&#x901A;&#x8FC7;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8F83;&#x5927;&#x4E00;&#x70B9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x53CD;&#x6620;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x6BD4;&#x8F83;&#x7A84;&#x4E00;&#x70B9;&#x3002;&#x5B83;&#x4EC5;&#x4EC5;&#x8868;&#x793A;&#x4F01;&#x4E1A;&#x5728;&#x8BE5;&#x9879;&#x76EE;&#x6216;&#x7C7B;&#x4F3C;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x65BD;&#x80FD;&#x529B;&#x8FBE;&#x5230;&#x4E86;&#x67D0;&#x4E00;&#x7B49;&#x7EA7;&#x3002;&#x800C;&#x53E6;&#x4E00;&#x79CD;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x4E3A;&#x9636;&#x6BB5;&#x6027;&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x6210;&#x719F;&#x5EA6;&#xFF0C;&#x4E5F;&#x5373;&#x662F;&#x4F01;&#x4E1A;&#x5728;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4E0A;&#x7684;&#x7EFC;&#x5408;&#x5B9E;&#x529B;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x7531;&#x8BC4;&#x4F30;&#x5E08;&#x6765;&#x6311;&#x9009;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x7684;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x3002;&#x4E00;&#x822C;&#x5730;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x8981;&#x60F3;&#x5728;&#x9636;&#x6BB5;&#x6027;&#x8BC4;&#x4F30;&#x4E2D;&#x5F97;&#x5230;&#x4E09;&#x7EA7;&#xFF0C;&#x5176;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x7684;&#x5927;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x8981;&#x8FBE;&#x5230;&#x4E09;&#x7EA7;&#xFF0C;&#x5C0F;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x5728;&#x4E8C;&#x7EA7;&#xFF0C;&#x4F46;&#x7EDD;&#x4E0D;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x7EA7;&#x3002;&#x9636;&#x6BB5;&#x6027;&#x8868;&#x8FF0;&#x7684;&#x96BE;&#x5EA6;&#x8981;&#x5927;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x867D;&#x7136;&#xFF0C;CMMI&#x7684;&#x8868;&#x8FF0;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x8D28;&#x5185;&#x5BB9;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x3002;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x51C6;&#x5907;&#x8BC4;&#x4F30;&#x65F6;&#x8981;&#x505A;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x4E5F;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5BF9;&#x4F01;&#x4E1A;&#x7684;&#x7BA1;&#x7406;&#x4E0A;&#x7684;&#x5E2E;&#x52A9;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x80FD;&#x4F01;&#x4E1A;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;&#x4F01;&#x4E1A;&#x6240;&#x83B7;&#x53D6;&#x7684;&#x5B9E;&#x60E0;&#x5E94;&#x8BE5;&#x662F;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#x3002;&#x5177;&#x4F53;&#x8981;&#x505A;&#x8FDE;&#x7EED;&#x6027;&#x8BC4;&#x4F30;&#xFF0C;&#x8FD8;&#x662F;&#x505A;&#x9636;&#x6BB5;&#x6027;&#x8BC4;&#x4F30;&#x5219;&#x662F;&#x770B;&#x4F01;&#x4E1A;&#x5BF9;&#x7B49;&#x7EA7;&#x8BC4;&#x4F30;&#x8BC1;&#x4E66;&#x7684;&#x5177;&#x4F53;&#x8981;&#x6C42;&#x3002;</p>
<h2 id="&#x516D;&#x3001;CMMI&#x7684;&#x4E94;&#x4E2A;&#x53F0;&#x9636;"><a href="#&#x516D;&#x3001;CMMI&#x7684;&#x4E94;&#x4E2A;&#x53F0;&#x9636;" class="headerlink" title="&#x516D;&#x3001;CMMI&#x7684;&#x4E94;&#x4E2A;&#x53F0;&#x9636;"></a>&#x516D;&#x3001;CMMI&#x7684;&#x4E94;&#x4E2A;&#x53F0;&#x9636;</h2><h6 id="&#x53F0;&#x9636;&#x4E00;&#xFF1A;CMMI&#x4E00;&#x7EA7;&#xFF0C;&#x5B8C;&#x6210;&#x7EA7;&#x3002;"><a href="#&#x53F0;&#x9636;&#x4E00;&#xFF1A;CMMI&#x4E00;&#x7EA7;&#xFF0C;&#x5B8C;&#x6210;&#x7EA7;&#x3002;" class="headerlink" title="&#x53F0;&#x9636;&#x4E00;&#xFF1A;CMMI&#x4E00;&#x7EA7;&#xFF0C;&#x5B8C;&#x6210;&#x7EA7;&#x3002;"></a>&#x53F0;&#x9636;&#x4E00;&#xFF1A;CMMI&#x4E00;&#x7EA7;&#xFF0C;&#x5B8C;&#x6210;&#x7EA7;&#x3002;</h6><p>&#x5728;&#x5B8C;&#x6210;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4F01;&#x4E1A;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x4E0E;&#x8981;&#x505A;&#x7684;&#x52AA;&#x529B;&#x5F88;&#x6E05;&#x6670;&#xFF0C;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x5F97;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x4EFB;&#x52A1;&#x7684;&#x5B8C;&#x6210;&#x5E26;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5076;&#x7136;&#x6027;&#xFF0C;&#x4F01;&#x4E1A;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5728;&#x5B9E;&#x65BD;&#x540C;&#x7C7B;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x4E00;&#x7EA7;&#x4E0A;&#x7684;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x5BF9;&#x5B9E;&#x65BD;&#x4EBA;&#x5458;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x3002;</p>
<h6 id="&#x53F0;&#x9636;&#x4E8C;&#xFF1A;CMMI&#x4E8C;&#x7EA7;&#xFF0C;&#x7BA1;&#x7406;&#x7EA7;&#x3002;"><a href="#&#x53F0;&#x9636;&#x4E8C;&#xFF1A;CMMI&#x4E8C;&#x7EA7;&#xFF0C;&#x7BA1;&#x7406;&#x7EA7;&#x3002;" class="headerlink" title="&#x53F0;&#x9636;&#x4E8C;&#xFF1A;CMMI&#x4E8C;&#x7EA7;&#xFF0C;&#x7BA1;&#x7406;&#x7EA7;&#x3002;"></a>&#x53F0;&#x9636;&#x4E8C;&#xFF1A;CMMI&#x4E8C;&#x7EA7;&#xFF0C;&#x7BA1;&#x7406;&#x7EA7;&#x3002;</h6><p>&#x5728;&#x7BA1;&#x7406;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4F01;&#x4E1A;&#x5728;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4E0A;&#x80FD;&#x591F;&#x9075;&#x5B88;&#x65E2;&#x5B9A;&#x7684;&#x8BA1;&#x5212;&#x4E0E;&#x6D41;&#x7A0B;&#xFF0C;&#x6709;&#x8D44;&#x6E90;&#x51C6;&#x5907;&#xFF0C;&#x6743;&#x8D23;&#x5230;&#x4EBA;&#xFF0C;&#x5BF9;&#x76F8;&#x5173;&#x7684;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x4EBA;&#x5458;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x57F9;&#x8BAD;&#xFF0C;&#x5BF9;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x6709;&#x76D1;&#x6D4B;&#x4E0E;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E0E;&#x4E0A;&#x7EA7;&#x5355;&#x4F4D;&#x5BF9;&#x9879;&#x76EE;&#x4E0E;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x5BA1;&#x67E5;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x4E8C;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#x4F53;&#x73B0;&#x4E86;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7BA1;&#x7406;&#x624B;&#x6BB5;&#x6392;&#x9664;&#x4E86;&#x4F01;&#x4E1A;&#x5728;&#x4E00;&#x7EA7;&#x65F6;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x4F01;&#x4E1A;&#x7684;&#x6240;&#x6709;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x6210;&#x529F;&#x3002;</p>
<h6 id="&#x53F0;&#x9636;&#x4E09;&#xFF1A;CMMI&#x4E09;&#x7EA7;&#xFF0C;&#x5B9A;&#x4E49;&#x7EA7;&#x3002;"><a href="#&#x53F0;&#x9636;&#x4E09;&#xFF1A;CMMI&#x4E09;&#x7EA7;&#xFF0C;&#x5B9A;&#x4E49;&#x7EA7;&#x3002;" class="headerlink" title="&#x53F0;&#x9636;&#x4E09;&#xFF1A;CMMI&#x4E09;&#x7EA7;&#xFF0C;&#x5B9A;&#x4E49;&#x7EA7;&#x3002;"></a>&#x53F0;&#x9636;&#x4E09;&#xFF1A;CMMI&#x4E09;&#x7EA7;&#xFF0C;&#x5B9A;&#x4E49;&#x7EA7;&#x3002;</h6><p>&#x5728;&#x5B9A;&#x4E49;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4F01;&#x4E1A;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x65BD;&#x6709;&#x4E00;&#x6574;&#x5957;&#x7684;&#x7BA1;&#x7406;&#x63AA;&#x65BD;&#xFF0C;&#x5E76;&#x4FDD;&#x969C;&#x9879;&#x76EE;&#x7684;&#x5B8C;&#x6210;&#xFF1B;&#x800C;&#x4E14;&#xFF0C;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x7684;&#x6807;&#x51C6;&#x6D41;&#x7A0B;&#xFF0C;&#x5C06;&#x8FD9;&#x5957;&#x7BA1;&#x7406;&#x4F53;&#x7CFB;&#x4E0E;&#x6D41;&#x7A0B;&#x4E88;&#x4EE5;&#x5236;&#x5EA6;&#x5316;&#x8FD9;&#x6837;&#xFF0C;&#x4F01;&#x4E1A;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x5728;&#x540C;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x751F;&#x5230;&#x6210;&#x529F;&#x7684;&#x5B9E;&#x65BD;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x4E00;&#x6837;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x6210;&#x529F;&#x7684;&#x5B9E;&#x65BD;&#x3002;&#x79D1;&#x5B66;&#x7684;&#x7BA1;&#x7406;&#x6210;&#x4E3A;&#x4F01;&#x4E1A;&#x7684;&#x4E00;&#x79CD;&#x6587;&#x5316;&#xFF0C;&#x4F01;&#x4E1A;&#x7684;&#x7EC4;&#x7EC7;&#x8D22;&#x5BCC;&#x3002;</p>
<h6 id="&#x53F0;&#x9636;&#x56DB;&#xFF1A;CMMI&#x56DB;&#x7EA7;&#xFF0C;&#x91CF;&#x5316;&#x7BA1;&#x7406;&#x7EA7;&#x3002;"><a href="#&#x53F0;&#x9636;&#x56DB;&#xFF1A;CMMI&#x56DB;&#x7EA7;&#xFF0C;&#x91CF;&#x5316;&#x7BA1;&#x7406;&#x7EA7;&#x3002;" class="headerlink" title="&#x53F0;&#x9636;&#x56DB;&#xFF1A;CMMI&#x56DB;&#x7EA7;&#xFF0C;&#x91CF;&#x5316;&#x7BA1;&#x7406;&#x7EA7;&#x3002;"></a>&#x53F0;&#x9636;&#x56DB;&#xFF1A;CMMI&#x56DB;&#x7EA7;&#xFF0C;&#x91CF;&#x5316;&#x7BA1;&#x7406;&#x7EA7;&#x3002;</h6><p>&#x5728;&#x91CF;&#x5316;&#x7BA1;&#x7406;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4F01;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E0D;&#x4EC5;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x5236;&#x5EA6;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x5B9E;&#x73B0;&#x6570;&#x5B57;&#x5316;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x5BF9;&#x7BA1;&#x7406;&#x6D41;&#x7A0B;&#x8981;&#x505A;&#x5230;&#x91CF;&#x5316;&#x4E0E;&#x6570;&#x5B57;&#x5316;&#x3002;&#x901A;&#x8FC7;&#x91CF;&#x5316;&#x6280;&#x672F;&#x6765;&#x5B9E;&#x73B0;&#x6D41;&#x7A0B;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x5B9E;&#x73B0;&#x7BA1;&#x7406;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x964D;&#x4F4E;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x5728;&#x8D28;&#x91CF;&#x4E0A;&#x7684;&#x6CE2;&#x52A8;&#x3002;</p>
<h6 id="&#x53F0;&#x9636;&#x4E94;&#xFF1A;CMMI&#x4E94;&#x7EA7;&#xFF0C;&#x4F18;&#x5316;&#x7EA7;&#x3002;"><a href="#&#x53F0;&#x9636;&#x4E94;&#xFF1A;CMMI&#x4E94;&#x7EA7;&#xFF0C;&#x4F18;&#x5316;&#x7EA7;&#x3002;" class="headerlink" title="&#x53F0;&#x9636;&#x4E94;&#xFF1A;CMMI&#x4E94;&#x7EA7;&#xFF0C;&#x4F18;&#x5316;&#x7EA7;&#x3002;"></a>&#x53F0;&#x9636;&#x4E94;&#xFF1A;CMMI&#x4E94;&#x7EA7;&#xFF0C;&#x4F18;&#x5316;&#x7EA7;&#x3002;</h6><p>&#x5728;&#x4F18;&#x5316;&#x7EA7;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x4F01;&#x4E1A;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x8FBE;&#x5230;&#x4E86;&#x6700;&#x9AD8;&#x7684;&#x5883;&#x754C;&#x3002;&#x4F01;&#x4E1A;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x4FE1;&#x606F;&#x624B;&#x6BB5;&#x4E0E;&#x6570;&#x5B57;&#x5316;&#x624B;&#x6BB5;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x5145;&#x5206;&#x5229;&#x7528;&#x4FE1;&#x606F;&#x8D44;&#x6599;&#xFF0C;&#x5BF9;&#x4F01;&#x4E1A;&#x5728;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x54C1;&#x4E88;&#x4EE5;&#x9884;&#x9632;&#x3002;&#x80FD;&#x591F;&#x4E3B;&#x52A8;&#x5730;&#x6539;&#x5584;&#x6D41;&#x7A0B;&#xFF0C;&#x8FD0;&#x7528;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x5B9E;&#x73B0;&#x6D41;&#x7A0B;&#x7684;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x7531;&#x4E0A;&#x8FF0;&#x7684;&#x4E94;&#x4E2A;&#x53F0;&#x9636;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#x90FD;&#x662F;&#x4E0A;&#x9762;&#x4E00;&#x9636;&#x53F0;&#x9636;&#x7684;&#x57FA;&#x77F3;&#x3002;&#x8981;&#x4E0A;&#x9AD8;&#x5C42;&#x53F0;&#x9636;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x8E0F;&#x4E0A;&#x8F83;&#x4F4E;&#x4E00;&#x5C42;&#x53F0;&#x9636;&#x3002;&#x4F01;&#x4E1A;&#x5728;&#x5B9E;&#x65BD;CMMI&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8DEF;&#x8981;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x8D70;&#x3002;&#x4E00;&#x822C;&#x5730;&#x8BB2;&#xFF0C;&#x5E94;&#x8BE5;&#x5148;&#x4ECE;&#x4E8C;&#x7EA7;&#x5165;&#x624B;&#x3002;&#x5728;&#x7BA1;&#x7406;&#x4E0A;&#x4E0B;&#x529F;&#x592B;&#x3002;&#x4E89;&#x53D6;&#x6700;&#x7EC8;&#x5B9E;&#x73B0;CMMI&#x7684;&#x7B2C;&#x4E94;&#x7EA7;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.site/2016/swe-cmmi-overview/" data-id="cj4sep54m00998oskhobxpevd" class="article-share-link">Share</a>
      
        <a href="http://snowyying.site/2016/swe-cmmi-overview/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/CMMI/">CMMI</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/SWE/">SWE</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/软件质量/">软件质量</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/swe-cmmi-kpas/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          CMMI 主要内容及各过程域的相互关系
        
      </div>
    </a>
  
  
    <a href="/2016/test-memory-leak-detect/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">C/C++ 内存泄露检查及工具使用</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/swe-cmmi-overview/" data-title="CMMI 概览" data-url="http://snowyying.site/2016/swe-cmmi-overview/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">17</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/IoT/">IoT</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">24</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">13</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/SA/">SA</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/SWE/">SWE</a><span class="category-list-count">12</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Web/">Web</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/ARP/" style="font-size: 10px;">ARP</a> <a href="/tags/AT指令/" style="font-size: 10px;">AT指令</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 11px;">C</a> <a href="/tags/C/" style="font-size: 12px;">C++</a> <a href="/tags/C-C/" style="font-size: 16px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11px;">CMMI</a> <a href="/tags/DNS/" style="font-size: 10px;">DNS</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/ESP82xx/" style="font-size: 10px;">ESP82xx</a> <a href="/tags/GPIO/" style="font-size: 11px;">GPIO</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/Google/" style="font-size: 10px;">Google</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/ICMP/" style="font-size: 10px;">ICMP</a> <a href="/tags/IGMP/" style="font-size: 10px;">IGMP</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IP/" style="font-size: 10px;">IP</a> <a href="/tags/IP-协议/" style="font-size: 10px;">IP 协议</a> <a href="/tags/IT/" style="font-size: 19px;">IT</a> <a href="/tags/IoT/" style="font-size: 12px;">IoT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Key/" style="font-size: 10px;">Key</a> <a href="/tags/Linux/" style="font-size: 11px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11px;">NTP</a> <a href="/tags/OS/" style="font-size: 13px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RARP/" style="font-size: 10px;">RARP</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SA/" style="font-size: 15px;">SA</a> <a href="/tags/SNMP/" style="font-size: 10px;">SNMP</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17px;">SWE</a> <a href="/tags/State/" style="font-size: 10px;">State</a> <a href="/tags/TCP/" style="font-size: 10px;">TCP</a> <a href="/tags/TCP-协议/" style="font-size: 10px;">TCP 协议</a> <a href="/tags/TCP-IP/" style="font-size: 11px;">TCP/IP</a> <a href="/tags/TCP-IP-协议/" style="font-size: 18px;">TCP/IP 协议</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/Test/" style="font-size: 10px;">Test</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UDP-协议/" style="font-size: 10px;">UDP 协议</a> <a href="/tags/UML/" style="font-size: 11px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Web/" style="font-size: 11px;">Web</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 12px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 11px;">http</a> <a href="/tags/https/" style="font-size: 11px;">https</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11px;">linux</a> <a href="/tags/mqtt/" style="font-size: 10px;">mqtt</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 11px;">poll</a> <a href="/tags/select/" style="font-size: 13px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/勘误/" style="font-size: 10px;">勘误</a> <a href="/tags/勘误表/" style="font-size: 10px;">勘误表</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 16px;">发展</a> <a href="/tags/发音/" style="font-size: 10px;">发音</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10px;">微信</a> <a href="/tags/快速-GPIO/" style="font-size: 10px;">快速 GPIO</a> <a href="/tags/性能/" style="font-size: 13px;">性能</a> <a href="/tags/成长/" style="font-size: 18px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/技术图谱/" style="font-size: 10px;">技术图谱</a> <a href="/tags/技术路线/" style="font-size: 10px;">技术路线</a> <a href="/tags/技能/" style="font-size: 10px;">技能</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 16px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/按键扫描/" style="font-size: 10px;">按键扫描</a> <a href="/tags/支付/" style="font-size: 10px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/数据链路层/" style="font-size: 10px;">数据链路层</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 12px;">架构</a> <a href="/tags/框架/" style="font-size: 11px;">框架</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 12px;">测试</a> <a href="/tags/演进/" style="font-size: 11px;">演进</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/状态图/" style="font-size: 10px;">状态图</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/矩阵按键/" style="font-size: 10px;">矩阵按键</a> <a href="/tags/短信/" style="font-size: 11px;">短信</a> <a href="/tags/程序员/" style="font-size: 17px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/系统分析师/" style="font-size: 15px;">系统分析师</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网站/" style="font-size: 11px;">网站</a> <a href="/tags/网络/" style="font-size: 20px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14px;">设计模式</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/选路/" style="font-size: 10px;">选路</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/05/">2017-05</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/04/">2017-04</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">13</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">18</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/web-framework-ionic-highcharts/">web-framework-ionic-highcharts</a>
          </li>
        
          <li>
            <a href="/2017/web-framework-ionic-demo/">web-framework-ionic-demo</a>
          </li>
        
          <li>
            <a href="/2017/web-server-nginx-ubuntu/">web-server-nginx-ubuntu</a>
          </li>
        
          <li>
            <a href="/2017/media-libpng-vs-windows/">media-libpng-vs-windows</a>
          </li>
        
          <li>
            <a href="/2017/misc-qr-lib-zxing/">misc-qr-lib-zxing</a>
          </li>
        
          <li>
            <a href="/2017/security-lib-cryptopp-md5/">security-lib-cryptopp-md5</a>
          </li>
        
          <li>
            <a href="/2017/swe-uml-state-example-iot/">UML 状态图实例 - IoT 模块</a>
          </li>
        
          <li>
            <a href="/2017/iot-wifi-esp82xx-guide/">物联网 - WIF 芯片 ESP82xx 使用指南</a>
          </li>
        
          <li>
            <a href="/2017/sa-course-p17-Embedded-system-analysis-design/">系统分析师教程学习 - 嵌入式系统分析与设计</a>
          </li>
        
          <li>
            <a href="/2017/sa-course-p11-requirement-engineering/">系统分析师教程学习 - 需求工程</a>
          </li>
        
          <li>
            <a href="/2017/sa-course-p08-software-engineering/">系统分析师教程学习 - 软件工程</a>
          </li>
        
          <li>
            <a href="/2017/sa-course-p07-informatization/">系统分析师教程学习 - 信息化</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="http://libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>