<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：保持内心的青春与理想 理想驱动编程 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2658 2014&amp;#x5E74;01&amp;#x6708;27&amp;#x65E5;
&amp;#x5982;&amp;#x679C;&amp;#x8BF4;&amp;#x7269;&amp;#x8D28;&amp;#x548C;&amp;#x5355;&amp;#x7EAF;&amp;#x7684;&amp;#x5174;&amp;#x8DA3;&amp;#x4E0D;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：保持内心的青春与理想 理想驱动编程">
<meta property="og:url" content="http://snowyying.github.io/2016/g-programming-guide-8-dream/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2658 2014&amp;#x5E74;01&amp;#x6708;27&amp;#x65E5;
&amp;#x5982;&amp;#x679C;&amp;#x8BF4;&amp;#x7269;&amp;#x8D28;&amp;#x548C;&amp;#x5355;&amp;#x7EAF;&amp;#x7684;&amp;#x5174;&amp;#x8DA3;&amp;#x4E0D;&amp;#x">
<meta property="og:updated_time" content="2017-01-12T02:31:11.108Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：保持内心的青春与理想 理想驱动编程">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2658 2014&amp;#x5E74;01&amp;#x6708;27&amp;#x65E5;
&amp;#x5982;&amp;#x679C;&amp;#x8BF4;&amp;#x7269;&amp;#x8D28;&amp;#x548C;&amp;#x5355;&amp;#x7EAF;&amp;#x7684;&amp;#x5174;&amp;#x8DA3;&amp;#x4E0D;&amp;#x">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">Learn and live.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.github.io"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-g-programming-guide-8-dream" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：保持内心的青春与理想 理想驱动编程
    </h1>
  

      </header>
    
  
  <div class="article-meta">
    <a href="/2016/g-programming-guide-8-dream/" class="article-date">
  <time datetime="2016-08-05T05:38:29.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA; http://www.nowamagic.net/librarys/veda/detail/2658 2014&#x5E74;01&#x6708;27&#x65E5;</code></p>
<p>&#x5982;&#x679C;&#x8BF4;&#x7269;&#x8D28;&#x548C;&#x5355;&#x7EAF;&#x7684;&#x5174;&#x8DA3;&#x4E0D;&#x8DB3;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x957F;&#x4E45;&#x7684;&#x9A71;&#x52A8;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x7591;&#x7684;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7EE7;&#x7EED;&#x53BB;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x4F7F;&#x4EBA;&#x751F;&#x6C38;&#x52A8;&#x7684;&#x52BF;&#x80FD;&#x3002;</p>
<a id="more"></a>
<p>&#x5F88;&#x591A;&#x4E00;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x5458;&#x5176;&#x5B9E;&#x662F;&#x8BA4;&#x8BC6;&#x5230;&#x4E86;&#x6280;&#x672F;&#x66F4;&#x8FED;&#x8FD9;&#x6837;&#x7684;&#x7279;&#x5F81;&#x65F6;&#x523B;&#x5728;&#x638F;&#x7A7A;&#x81EA;&#x5DF1;&#x7ACB;&#x8DB3;&#x7684;&#x6839;&#x57FA;&#x7684;&#xFF0C;&#x4F46;&#x5F88;&#x591A;&#x7684;&#x4EBA;&#x5728;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x662F;&#x91C7;&#x53D6;&#x79EF;&#x6781;&#x7684;&#x6001;&#x5EA6;&#x53BB;&#x9762;&#x5BF9;&#xFF0C;&#x800C;&#x662F;&#x4F1A;&#x8BD5;&#x56FE;&#x6B3A;&#x9A97;&#x81EA;&#x5DF1;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x79CD;&#x5B89;&#x5168;&#x7684;&#x5047;&#x8C61;&#x3002;&#x6BD4;&#x5982;&#x53EF;&#x80FD;&#x4F1A;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x53CD;&#x6B63;&#x516C;&#x53F8;&#x77ED;&#x65F6;&#x95F4;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x624B;&#x91CC;&#x7684;&#x4E8B;&#x505A;&#x597D;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x8BA9;&#x81EA;&#x5DF1;&#x90A3;&#x4E48;&#x8F9B;&#x82E6;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x5728;&#x67D0;&#x4E9B;&#x6709;&#x70B9;&#x5E74;&#x7EAA;&#x751F;&#x6D3B;&#x76F8;&#x5BF9;&#x5B89;&#x7A33;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8EAB;&#x4E0A;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#xFF0C;&#x8FD9;&#x5F88;&#x53EF;&#x6015;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x903C;&#x5230;&#x6B7B;&#x89D2;&#x91CC;&#x3002;&#x6446;&#x8131;&#x8FD9;&#x79CD;&#x72B6;&#x51B5;&#x5F53;&#x7136;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x5371;&#x673A;&#x610F;&#x8BC6;&#xFF0C;&#x4F46;&#x66F4;&#x5173;&#x952E;&#x7684;&#x662F;&#x8981;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x4F7F;&#x4EBA;&#x751F;&#x6C38;&#x52A8;&#x7684;&#x52BF;&#x80FD;&#x3002;</p>
<p>&#x636E;&#x8BF4;&#x7F8E;&#x519B;&#x7684;&#x9EA6;&#x514B;&#x963F;&#x745F;&#x5C06;&#x519B;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x4E00;&#x7BC7;&#x540D;&#x4E3A;&#x300A;&#x9752;&#x6625;&#x300B;&#x7684;&#x6563;&#x6587;&#xFF0C;&#x5728;&#x5360;&#x9886;&#x65E5;&#x672C;&#x671F;&#x95F4;&#x65E5;&#x672C;&#x4EBA;&#x5728;&#x7F8E;&#x519B;&#x603B;&#x90E8;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x7BC7;&#x6563;&#x6587;&#xFF0C;&#x4E8E;&#x662F;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5F88;&#x5FEB;&#x53D8;&#x5F97;&#x5F88;&#x6D41;&#x884C;&#xFF0C;&#x5728;&#x5546;&#x754C;&#x5927;&#x4F6C;&#xFF08;&#x5982;&#x677E;&#x4E0B;&#x5E78;&#x4E4B;&#x52A9;&#x7B49;&#xFF09;&#x95F4;&#x6D41;&#x4F20;&#x751A;&#x5E7F;&#x3002;&#x90A3;&#x300A;&#x9752;&#x6625;&#x300B;&#x8FD9;&#x7BC7;&#x6563;&#x6587;&#x8BF4;&#x7684;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6765;&#x4E00;&#x8D77;&#x770B;&#x4E00;&#x4E0B;&#xFF1A;</p>
<p>&#x9752;&#x6625;&#x4E0D;&#x662F;&#x5E74;&#x534E;&#xFF0C;&#x800C;&#x662F;&#x5FC3;&#x5883;&#xFF1B;&#x9752;&#x6625;&#x4E0D;&#x662F;&#x6843;&#x9762;&#x3001;&#x4E39;&#x5507;&#x3001;&#x67D4;&#x819D;&#xFF0C;&#x800C;&#x662F;&#x6DF1;&#x6C89;&#x7684;&#x610F;&#x5FD7;&#xFF0C;&#x6062;&#x5B8F;&#x7684;&#x60F3;&#x8C61;&#xFF0C;&#x7099;&#x70ED;&#x7684;&#x604B;&#x60C5;&#xFF1B;&#x9752;&#x6625;&#x662F;&#x751F;&#x547D;&#x7684;&#x6DF1;&#x6CC9;&#x5728;&#x6D8C;&#x6D41;&#x3002;</p>
<p>&#x9752;&#x6625;&#x6C14;&#x8D2F;&#x957F;&#x8679;&#xFF0C;&#x52C7;&#x9510;&#x76D6;&#x8FC7;&#x602F;&#x5F31;&#xFF0C;&#x8FDB;&#x53D6;&#x538B;&#x5012;&#x82DF;&#x5B89;&#x3002;&#x5982;&#x6B64;&#x9510;&#x6C14;&#xFF0C;&#x4E8C;&#x5341;&#x540E;&#x751F;&#x800C;&#x6709;&#x4E4B;&#xFF0C;&#x516D;&#x65EC;&#x7537;&#x5B50;&#x5219;&#x66F4;&#x591A;&#x89C1;&#x3002;&#x5E74;&#x5C81;&#x6709;&#x52A0;&#xFF0C;&#x5E76;&#x975E;&#x5782;&#x8001;&#xFF0C;&#x7406;&#x60F3;&#x4E22;&#x5F03;&#xFF0C;&#x65B9;&#x5815;&#x66AE;&#x5E74;&#x3002;</p>
<p>&#x5C81;&#x6708;&#x60A0;&#x60A0;&#xFF0C;&#x8870;&#x5FAE;&#x53EA;&#x53CA;&#x808C;&#x80A4;&#xFF1B;&#x70ED;&#x5FF1;&#x629B;&#x5374;&#xFF0C;&#x9893;&#x5E9F;&#x5FC5;&#x81F4;&#x7075;&#x9B42;&#x3002;&#x5FE7;&#x70E6;&#xFF0C;&#x60F6;&#x6050;&#xFF0C;&#x4E27;&#x5931;&#x81EA;&#x4FE1;&#xFF0C;&#x5B9A;&#x4F7F;&#x5FC3;&#x7075;&#x626D;&#x66F2;&#xFF0C;&#x610F;&#x6C14;&#x5982;&#x7070;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x5E74;&#x5C4A;&#x82B1;&#x7532;&#xFF0C;&#x62DF;&#x6216;&#x4E8C;&#x516B;&#x82B3;&#x9F84;&#xFF0C;&#x5FC3;&#x4E2D;&#x7686;&#x6709;&#x751F;&#x547D;&#x4E4B;&#x6B22;&#x4E50;&#xFF0C;&#x5947;&#x8FF9;&#x4E4B;&#x8BF1;&#x60D1;&#xFF0C;&#x5B69;&#x7AE5;&#x822C;&#x5929;&#x771F;&#x4E45;&#x76DB;&#x4E0D;&#x8870;&#x3002;&#x4EBA;&#x4EBA;&#x5FC3;&#x4E2D;&#x7686;&#x6709;&#x4E00;&#x53F0;&#x5929;&#x7EBF;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x4ECE;&#x5929;&#x4E0A;&#x4EBA;&#x95F4;&#x63A5;&#x53D7;&#x7F8E;&#x597D;&#x3001;&#x5E0C;&#x671B;&#x3001;&#x6B22;&#x4E50;&#x3001;&#x52C7;&#x6C14;&#x548C;&#x529B;&#x91CF;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x4F60;&#x5C31;&#x9752;&#x6625;&#x6C38;&#x9A7B;&#xFF0C;&#x98CE;&#x534E;&#x5E38;&#x5B58;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5929;&#x7EBF;&#x4E0B;&#x964D;&#xFF0C;&#x9510;&#x6C14;&#x4FBF;&#x88AB;&#x51B0;&#x96EA;&#x8986;&#x76D6;&#xFF0C;&#x73A9;&#x4E16;&#x4E0D;&#x606D;&#x3001;&#x81EA;&#x66B4;&#x81EA;&#x5F03;&#x6CB9;&#x7136;&#x800C;&#x751F;&#xFF0C;&#x5373;&#x4F7F;&#x5E74;&#x65B9;&#x4E8C;&#x5341;&#xFF0C;&#x5B9E;&#x5DF2;&#x5782;&#x5782;&#x8001;&#x77E3;&#xFF1B;&#x7136;&#x5219;&#x53EA;&#x8981;&#x6811;&#x8D77;&#x5929;&#x7EBF;&#xFF0C;&#x6355;&#x6349;&#x4E50;&#x89C2;&#x4FE1;&#x53F7;&#xFF0C;&#x4F60;&#x5C31;&#x6709;&#x671B;&#x5728;&#x516B;&#x5341;&#x9AD8;&#x9F84;&#x544A;&#x522B;&#x5C18;&#x5BF0;&#x65F6;&#x4ECD;&#x89C9;&#x5E74;&#x8F7B;&#x3002;</p>
<p>&#x2014;&#x2014; &#x585E;&#x7F2A;&#x5C14;-&#x5384;&#x5C14;&#x66FC;&#x5FB7;</p>
<p>&#x6587;&#x5B57;&#x975E;&#x5E38;&#x4F18;&#x7F8E;&#xFF0C;&#x4F46;&#x610F;&#x601D;&#x5E76;&#x4E0D;&#x6DF1;&#x5965;&#x3002;&#x9752;&#x6625;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x53D6;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x8FDC;&#x79BB;&#x9893;&#x5E9F;&#x8FFD;&#x9010;&#x7406;&#x60F3;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x975E;&#x5E38;&#x8BA4;&#x540C;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x3002;</p>
<p>&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x548C;&#x6B32;&#x671B;&#x5177;&#x6709;&#x65E0;&#x8FB9;&#x754C;&#x7279;&#x8D28;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x672A;&#x6765;&#x548C;&#x73B0;&#x5728;&#x4E4B;&#x95F4;&#x5236;&#x9020;&#x4E00;&#x79CD;&#x5DEE;&#x8DDD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x65E0;&#x5C3D;&#x7684;&#x52BF;&#x80FD;&#xFF0C;&#x4EBA;&#x4E5F;&#x5C31;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x524D;&#x884C;&#x3002;&#x800C;&#x5236;&#x9020;&#x8FD9;&#x79CD;&#x5DEE;&#x8DDD;&#x7684;&#x6700;&#x4F73;&#x7D20;&#x6750;&#x5F80;&#x5F80;&#x53EA;&#x80FD;&#x662F;&#x7406;&#x60F3;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x53EF;&#x80FD;&#x8BEF;&#x89E3;&#x4E86;&#x7406;&#x60F3;&#x548C;&#x9053;&#x5FB7;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x7406;&#x60F3;&#x5E76;&#x975E;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x5C1A;&#x7684;&#x8BCD;&#x6C47;&#xFF0C;&#x4E0E;&#x5584;&#x6076;&#x65E0;&#x5173;&#xFF0C;&#x66F4;&#x4E0E;&#x5B8F;&#x5927;&#x4E0E;&#x6E3A;&#x5C0F;&#x65E0;&#x5173;&#x3002;</p>
<p>&#x9C81;&#x667A;&#x6DF1;&#x8BF4;&#xFF1A;&#x5E73;&#x751F;&#x4E0D;&#x4FEE;&#x5584;&#x679C;&#xFF0C;&#x4E13;&#x7231;&#x6740;&#x4EBA;&#x653E;&#x706B;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x79CD;&#x7406;&#x60F3;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x53EF;&#x4EE5;&#x627F;&#x53D7;&#x5B83;&#x6240;&#x5E26;&#x6765;&#x7684;&#x8D1F;&#x80FD;&#x91CF;&#x5E76;&#x4E0D;&#x611F;&#x5230;&#x75DB;&#x82E6;&#x3002;&#x7269;&#x8D28;&#x9700;&#x8981;&#x3001;&#x6210;&#x5C31;&#x9700;&#x8981;&#x3001;&#x6743;&#x5229;&#x9700;&#x8981;&#x3001;&#x5F52;&#x5C5E;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x4E2D;&#x7ECF;&#x5E38;&#x63D0;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E43;&#x81F3;&#x524D;&#x6587;&#x63D0;&#x5230;&#x7684;&#x5174;&#x8DA3;&#x90FD;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x7406;&#x60F3;&#x7684;&#x7D20;&#x6750;&#x3002;&#x6240;&#x4EE5;&#x53CD;&#x8FC7;&#x6765;&#x8BB2;&#xFF0C;&#x7406;&#x60F3;&#x662F;&#x4EC0;&#x4E48;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x5173;&#x952E;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x8981;&#x6709;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x5F88;&#x72C2;&#x70ED;&#x7684;&#x6295;&#x5165;&#x53BB;&#x505A;&#xFF0C;&#x8FD9;&#x5C31;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x4E00;&#x5B9A;&#x7684;&#x52BF;&#x80FD;&#x3002;</p>
<p>&#x5BF9;&#x4E0E;&#x5929;&#x751F;&#x5BF9;&#x4EE3;&#x7801;&#x72C2;&#x70ED;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1B;&#x4F46;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x8FD9;&#x79CD;&#x7406;&#x60F3;&#x5F80;&#x5F80;&#x5E76;&#x4E0D;&#x5728;&#x7A0B;&#x5E8F;&#x4E4B;&#x5185;&#xFF0C;&#x800C;&#x5728;&#x7A0B;&#x5E8F;&#x4E4B;&#x5916;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x5F88;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x53E0;&#x52A0;&#x51E0;&#x7C7B;&#x4E1C;&#x897F;&#x624D;&#x80FD;&#x7ED9;&#x81EA;&#x5DF1;&#x84C4;&#x79EF;&#x8DB3;&#x591F;&#x7684;&#x52BF;&#x80FD;&#xFF1A;&#x7269;&#x8D28;&#x7684;&#x9700;&#x6C42;&#x3001;&#x6210;&#x5C31;&#x7684;&#x6E34;&#x671B;&#x3001;&#x4E0D;&#x5B89;&#x5168;&#x611F;&#x7684;&#x9A71;&#x79BB;&#x3001;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x8FFD;&#x6C42;&#x7B49;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x7D20;&#x6750;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x4E2A;&#x4EBA;&#x7684;&#x79C1;&#x6709;&#x9886;&#x57DF;&#xFF0C;&#x6700;&#x7EC8;&#x53EA;&#x80FD;&#x7531;&#x4E2A;&#x4EBA;&#x505A;&#x51FA;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6700;&#x540E;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x6709;&#x7406;&#x60F3;&#x3001;&#x6709;&#x6597;&#x5FD7;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x65E0;&#x7406;&#x60F3;&#x3001;&#x65E0;&#x6597;&#x5FD7;&#x51E0;&#x4E4E;&#x4E00;&#x5B9A;&#x4F1A;&#x94F8;&#x5C31;&#x5E73;&#x5EB8;&#x548C;&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x4E3A;&#x7EC6;&#x81F4;&#x60F3;&#x6765;&#x4E16;&#x754C;&#x672C;&#x8EAB;&#x5F52;&#x6839;&#x5230;&#x5E95;&#x662F;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x903B;&#x8F91;&#x6E38;&#x620F;&#x6765;&#x505A;&#x70B9;&#x8BC1;&#x660E;&#xFF1A;</p>
<p>&#x610F;&#x8BC6;&#x51B3;&#x5B9A;&#x884C;&#x52A8;&#xFF1A;&#x4E2A;&#x4EBA;&#x610F;&#x5FD7;&#x51B3;&#x5B9A;&#x4E2A;&#x4EBA;&#x884C;&#x6B62;&#xFF0C;&#x7EC4;&#x7EC7;&#x610F;&#x5FD7;&#x51B3;&#x5B9A;&#x7EC4;&#x7EC7;&#x884C;&#x4E3A; &#x2192; &#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x4E2A;&#x4EBA;&#x610F;&#x5FD7;&#x66F4;&#x4E3A;&#x9C9C;&#x660E;&#xFF0C;&#x81EA;&#x6211;&#x610F;&#x8BC6;&#x5F3A;&#x70C8;&#xFF0C;&#x800C;&#x65E0;&#x7406;&#x60F3;&#x7684;&#x4E2A;&#x4EBA;&#x610F;&#x5FD7;&#x8584;&#x5F31;&#xFF0C;&#x613F;&#x610F;&#x968F;&#x6CE2;&#x9010;&#x6D41; &#x2192; &#x610F;&#x8BC6;&#x5F3A;&#x8005;&#x4E0A;&#x4F4D; &#x2192; &#x5904;&#x4E8E;&#x7EC4;&#x7EC7;&#x6838;&#x5FC3;&#x5730;&#x4F4D;&#x7684;&#x662F;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005; &#x2192; &#x65E0;&#x7406;&#x60F3;&#x7684;&#x4EBA;&#x4E0D;&#x8BBA;&#x5728;&#x4E2A;&#x4EBA;&#x5C42;&#x9762;&#x8FD8;&#x662F;&#x7EC4;&#x7EC7;&#x5C42;&#x9762;&#x90FD;&#x6CA6;&#x4E3A;&#x8FFD;&#x968F;&#x8005; &#x2192; &#x4ECE;&#x8D44;&#x6E90;&#x638C;&#x63A7;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x638C;&#x63A7;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x5BF9;&#x8FD9;&#x4E8B;&#x800C;&#x8A00;&#xFF0C;&#x7406;&#x8BBA;&#x5176;&#x5B9E;&#x4E0D;&#x5173;&#x952E;&#xFF0C;&#x9009;&#x62E9;&#x4E0E;&#x575A;&#x6301;&#x975E;&#x5E38;&#x5173;&#x952E;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x628A;&#x5B83;&#x4EEC;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F9B;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#x3002;</p>
<p>&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x4E0E;&#x4EBA;&#x751F;&#x52BF;&#x80FD;</p>
<p>&#x5982;&#x679C;&#x628A;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x201C;&#x52BF;&#x80FD;&#x201D;&#x505A;&#x7EC6;&#x81F4;&#x5206;&#x89E3;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x3002;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x5374;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x73B0;&#x4EE3;&#x4EBA;&#x79CD;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x91CC;&#x5BF9;&#x5176;&#x505A;&#x4E00;&#x70B9;&#x4ECB;&#x7ECD;&#x3002;</p>
<ol>
<li>&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x9700;&#x6C42;&#x5C42;&#x6B21;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x91CC;&#x6700;&#x6709;&#x540D;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x9700;&#x6C42;&#x5C42;&#x6B21;&#x7406;&#x8BBA;&#xFF0C;&#x5373;&#xFF1A;</p>
<p>&#x751F;&#x7406;&#x9700;&#x8981;&#xFF1A;&#x5305;&#x62EC;&#x89C5;&#x98DF;&#xFF0C;&#x996E;&#x6C34;&#xFF0C;&#x6816;&#x8EAB;&#xFF0C;&#x6027;&#x548C;&#x5176;&#x5B83;&#x8EAB;&#x4F53;&#x9700;&#x8981;&#x3002;<br>&#x5B89;&#x5168;&#x9700;&#x8981;&#xFF1A;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x514D;&#x53D7;&#x751F;&#x7406;&#x548C;&#x60C5;&#x7EEA;&#x4F24;&#x5BB3;&#x7684;&#x9700;&#x8981;&#x3002;<br>&#x793E;&#x4F1A;&#x9700;&#x8981;&#xFF1A;&#x7231;&#x3001;&#x5F52;&#x5C5E;&#x3001;&#x63A5;&#x7EB3;&#x548C;&#x53CB;&#x8C0A;&#x3002;<br>&#x5C0A;&#x91CD;&#x7684;&#x9700;&#x8981;&#xFF1A;&#x81EA;&#x5C0A;&#x3001;&#x81EA;&#x4E3B;&#x548C;&#x6210;&#x5C31;&#x611F;&#xFF1B;&#x5730;&#x4F4D;&#x3001;&#x8BA4;&#x53EF;&#x548C;&#x5173;&#x6CE8;&#x7B49;&#x3002;<br>&#x81EA;&#x6211;&#x5B9E;&#x73B0;&#x7684;&#x9700;&#x8981;&#x3002;</p>
<ol>
<li>ERG&#x7406;&#x8BBA;&#xFF1A;</li>
</ol>
<p>&#x5B58;&#x5728;&#x9700;&#x8981;(Existence)&#xFF1A;&#x4E0E;&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x751F;&#x7406;&#x3001;&#x5B89;&#x5168;&#x9700;&#x8981;&#x76F8;&#x4F3C;&#x3002;<br>&#x5173;&#x7CFB;&#x9700;&#x8981;(Relatedness)&#xFF1A;&#x4E0E;&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x793E;&#x4F1A;&#x53CA;&#x5730;&#x4F4D;&#x9700;&#x8981;&#x76F8;&#x4F3C;&#x3002;<br>&#x6210;&#x957F;&#x9700;&#x8981;(Growth)&#xFF1A;&#x4E0E;&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x81EA;&#x5C0A;&#x53CA;&#x81EA;&#x6211;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x76F8;&#x4F3C;&#x3002;</p>
<ol>
<li>X&#x7406;&#x8BBA;&#x548C;Y&#x7406;&#x8BBA;&#xFF1A;</li>
</ol>
<p>X&#x7406;&#x8BBA;&#x6301;&#x4E0B;&#x9762;&#x56DB;&#x79CD;&#x5047;&#x8BBE;&#xFF1A;</p>
<p>&#x5458;&#x5DE5;&#x751F;&#x6765;&#x4E0D;&#x559C;&#x6B22;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x9003;&#x907F;&#x5DE5;&#x4F5C;&#x3002;<br>&#x7531;&#x4E8E;&#x5458;&#x5DE5;&#x4E0D;&#x559C;&#x6B22;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x5F3A;&#x5236;&#x548C;&#x63A7;&#x5236;&#x63AA;&#x65BD;&#xFF0C;&#x6216;&#x91C7;&#x7528;&#x60E9;&#x7F5A;&#x5A01;&#x80C1;&#x4ED6;&#x4EEC;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x76EE;&#x6807;&#x3002;<br>&#x53EA;&#x8981;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x5458;&#x5DE5;&#x5C31;&#x4F1A;&#x9003;&#x907F;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#xFF0C;&#x5E76;&#x5BFB;&#x6C42;&#x6B63;&#x5F0F;&#x7684;&#x6307;&#x4EE4;&#x3002;<br>&#x5927;&#x591A;&#x6570;&#x5458;&#x5DE5;&#x628A;&#x5B89;&#x5168;&#x611F;&#x89C6;&#x4E3A;&#x9AD8;&#x4E8E;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x76F8;&#x5173;&#x56E0;&#x7D20;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x96C4;&#x5FC3;&#x58EE;&#x5FD7;&#x3002;<br>&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;Y&#x7406;&#x8BBA;&#x6301;&#x56DB;&#x79CD;&#x79EF;&#x6781;&#x7684;&#x4EBA;&#x6027;&#x5047;&#x8BBE;&#xFF1A;</p>
<p>&#x5458;&#x5DE5;&#x89C6;&#x5DE5;&#x4F5C;&#x5982;&#x540C;&#x4F11;&#x606F;&#x3001;&#x5A31;&#x4E50;&#x90A3;&#x6837;&#x81EA;&#x7136;&#x3002;<br>&#x5982;&#x679C;&#x5458;&#x5DE5;&#x627F;&#x8BFA;&#x5B8C;&#x6210;&#x67D0;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x4ED6;&#x4F1A;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x5F15;&#x5BFC;&#x548C;&#x81EA;&#x6211;&#x63A7;&#x5236;&#x3002;<br>&#x901A;&#x5E38;&#x4EBA;&#x4EEC;&#x90FD;&#x80FD;&#x5B66;&#x4F1A;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x4E3B;&#x52A8;&#x5BFB;&#x6C42;&#x8D23;&#x4EFB;&#x3002;<br>&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x5177;&#x6709;&#x505A;&#x51FA;&#x521B;&#x9020;&#x51B3;&#x7B56;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7BA1;&#x7406;&#x8005;&#x624D;&#x5177;&#x5907;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x3002;<br>&#x5982;&#x679C;&#x628A;X&#x7406;&#x8BBA;&#x548C;Y&#x7406;&#x8BBA;&#x5BF9;&#x5E94;&#x5230;IT&#x884C;&#x4E1A;&#xFF0C;&#x90A3;&#x4E48;&#x63D0;&#x5021;&#x4EBA;&#x4EF6;&#x548C;&#x654F;&#x6377;&#x7684;&#x57FA;&#x672C;&#x662F;&#x57FA;&#x4E8E;Y&#x7406;&#x8BBA;&#xFF0C;&#x800C;&#x63D0;&#x5021;CMMI&#x548C;&#x5927;&#x68D2;&#x52A0;&#x80E1;&#x841D;&#x535C;&#x7684;&#x57FA;&#x672C;&#x662F;&#x57FA;&#x4E8E;X&#x7406;&#x8BBA;&#x3002;</p>
<ol>
<li>&#x53CC;&#x56E0;&#x7D20;&#x7406;&#x8BBA;(two-factor theory)</li>
</ol>
<p>&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6FC0;&#x52B1;-&#x4FDD;&#x5065;&#x7406;&#x8BBA;(motivation-hygiene theory&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x8BA4;&#x4E3A;&#x6FC0;&#x52B1;&#x548C;&#x8BA9;&#x4EBA;&#x4E0D;&#x70E6;&#xFF08;&#x4FDD;&#x5065;&#xFF09;&#x662F;&#x4E24;&#x7801;&#x4E8B;&#x60C5;&#x3002;&#x6EE1;&#x610F;&#x4E0E;&#x4E0D;&#x6EE1;&#x610F;&#x4E0D;&#x662F;&#x5BF9;&#x7ACB;&#x7684;&#x4E24;&#x6781;&#xFF0C;&#x6EE1;&#x610F;&#x5BF9;&#x7ACB;&#x7684;&#x662F;&#x6CA1;&#x6709;&#x6EE1;&#x610F;&#xFF0C;&#x800C;&#x4E0D;&#x6EE1;&#x610F;&#x5BF9;&#x7ACB;&#x7684;&#x5219;&#x662F;&#x6CA1;&#x6709;&#x4E0D;&#x6EE1;&#x610F;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BB2;&#x7BA1;&#x7406;&#x8D28;&#x91CF;&#x3001;&#x85AA;&#x91D1;&#x6C34;&#x5E73;&#x3001;&#x516C;&#x53F8;&#x653F;&#x7B56;&#x3001;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x8FD9;&#x4E9B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4FDD;&#x5065;&#x56E0;&#x7D20;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x4EA7;&#x751F;&#x6EE1;&#x610F;&#xFF0C;&#x53EA;&#x4EA7;&#x751F;&#x4E0D;&#x6EE1;&#x610F;&#x6216;&#x6CA1;&#x6709;&#x4E0D;&#x6EE1;&#x610F;&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x3002;&#x8981;&#x60F3;&#x6FC0;&#x52B1;&#x5458;&#x5DE5;&#x5FC5;&#x987B;&#x5728;&#x664B;&#x5347;&#x3001;&#x4E2A;&#x4F53;&#x6210;&#x957F;&#x4E0A;&#x6709;&#x6240;&#x4F5C;&#x4E3A;&#x3002;</p>
<ol>
<li>&#x9EA6;&#x514B;&#x83B1;&#x5170;&#x7684;&#x9700;&#x8981;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x628A;&#x4EBA;&#x7684;&#x5185;&#x5728;&#x9700;&#x8981;&#x5F52;&#x4E3A;&#x4E09;&#x7C7B;&#xFF1A;&#x6210;&#x5C31;&#x9700;&#x8981;&#x3001;&#x6743;&#x5229;&#x9700;&#x8981;&#x548C;&#x5F52;&#x5C5E;&#x9700;&#x8981;&#x3002;&#x6210;&#x5C31;&#x9700;&#x8981;&#x662F;&#x4E00;&#x79CD;&#x8FFD;&#x6C42;&#x5353;&#x8D8A;&#x3001;&#x83B7;&#x53D6;&#x6210;&#x529F;&#x7684;&#x9700;&#x8981;&#x3002;&#x6743;&#x5229;&#x9700;&#x8981;&#x5219;&#x662F;&#x4E00;&#x79CD;&#x63A7;&#x5236;&#x4ED6;&#x4EBA;&#x884C;&#x4E3A;&#x7684;&#x9700;&#x8981;&#x3002;&#x5F52;&#x5C5E;&#x9700;&#x8981;&#x5219;&#x662F;&#x5EFA;&#x7ACB;&#x826F;&#x597D;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x7684;&#x9700;&#x8981;&#x3002;</p>
<ol>
<li>&#x8BA4;&#x77E5;&#x8BC4;&#x4EF7;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x6BD4;&#x8F83;&#x795E;&#x5947;&#x3002;&#x4ED6;&#x8BA4;&#x4E3A;&#x5DE5;&#x4F5C;&#x672C;&#x8EAB;&#x7684;&#x4E50;&#x8DA3;&#x662F;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x79CD;&#x5185;&#x5728;&#x7684;&#x5956;&#x52B1;&#xFF0C;&#x800C;&#x5916;&#x90E8;&#x5956;&#x52B1;&#x53CD;&#x5012;&#x4F1A;&#x964D;&#x4F4E;&#x52A8;&#x673A;&#x7684;&#x6C34;&#x5E73;&#x3002;&#x8FD9;&#x542C;&#x7740;&#x6BD4;&#x8F83;&#x62BD;&#x8C61;&#xFF0C;&#x4F46;&#x610F;&#x601D;&#x662F;&#x5982;&#x679C;&#x603B;&#x662F;&#x7528;&#x5956;&#x91D1;&#x914D;&#x5408;&#x7EE9;&#x6548;&#x8003;&#x6838;&#x6765;&#x6FC0;&#x52B1;&#x5458;&#x5DE5;&#xFF0C;&#x90A3;&#x4E48;&#x4E2A;&#x4EBA;&#x7531;&#x4E8E;&#x5174;&#x8DA3;&#x800C;&#x4ECE;&#x4E8B;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;&#x7684;&#x52A8;&#x529B;&#x5C31;&#x4F1A;&#x964D;&#x4F4E;&#x3002;&#x8FD9;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x786E;&#x5B9E;&#x4E5F;&#x6709;&#x8BC1;&#x636E;&#x6765;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x3002;</p>
<ol>
<li>&#x76EE;&#x6807;&#x8BBE;&#x7F6E;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x7531;&#x4E8E;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x4F1A;&#x505A;&#x76EE;&#x6807;&#x7BA1;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x5BF9;&#x8FD9;&#x4E00;&#x7406;&#x8BBA;&#x53CD;&#x5012;&#x4E0D;&#x964C;&#x751F;&#x3002;&#x8FD9;&#x4E00;&#x7406;&#x8BBA;&#x5927;&#x610F;&#x662F;&#x8BF4;&#xFF1A;&#x660E;&#x786E;&#x800C;&#x5177;&#x4F53;&#x7684;&#x76EE;&#x6807;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x4E2A;&#x4EBA;&#x6548;&#x80FD;&#xFF0C;&#x76EE;&#x6807;&#x7684;&#x6311;&#x6218;&#x6027;&#x3001;&#x9488;&#x5BF9;&#x76EE;&#x6807;&#x7684;&#x53CD;&#x9988;&#x90FD;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x76EE;&#x6807;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<ol>
<li>&#x81EA;&#x6211;&#x6548;&#x80FD;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x8D70;&#x5230;&#x6781;&#x7AEF;&#x5C31;&#x662F;&#x5E38;&#x8BF4;&#x7684;&#x201C;&#x4EBA;&#x6709;&#x591A;&#x5927;&#x80C6;&#xFF0C;&#x5730;&#x6709;&#x591A;&#x5927;&#x4EA7;&#x201D;&#x3002;&#x5927;&#x610F;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x80FD;&#x529B;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x4EFB;&#x52A1;&#x7684;&#x4FE1;&#x5FF5;&#x8D8A;&#x5F3A;&#xFF0C;&#x90A3;&#x6548;&#x80FD;&#x8D8A;&#x9AD8;&#x3002;&#x6216;&#x8005;&#x7B80;&#x5355;&#x8BF4;&#x5C31;&#x662F;&#x81EA;&#x4FE1;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4FC3;&#x6210;&#x81EA;&#x4FE1;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#xFF1A;&#x8FC7;&#x53BB;&#x7684;&#x6210;&#x529F;&#x7ECF;&#x9A8C;&#x3001;&#x4ECE;&#x699C;&#x6837;&#x5438;&#x53D6;&#x529B;&#x91CF;&#x3001;&#x53D7;&#x5230;&#x8A00;&#x8BED;&#x6FC0;&#x52B1;&#x7B49;&#x3002;</p>
<ol>
<li>&#x516C;&#x5E73;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x516C;&#x5E73;&#x7406;&#x8BBA;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x603B;&#x662F;&#x4F1A;&#x62FF;&#x81EA;&#x5DF1;&#x7684;&#x4EA7;&#x51FA;&#x6536;&#x5165;&#x6BD4;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#xFF0C;&#x5982;&#x679C;&#x6BD4;&#x7387;&#x76F8;&#x4F3C;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x4F1A;&#x8BA4;&#x4E3A;&#x73AF;&#x5883;&#x662F;&#x516C;&#x5E73;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x843D;&#x5230;&#x4E2A;&#x4EBA;&#x5934;&#x4E0A;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x91CD;&#x89C6;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x4E48;&#xFF1F;&#x90FD;&#x662F;&#x540C;&#x6837;&#x7684;&#x5B66;&#x6821;&#x3001;&#x540C;&#x6837;&#x7684;&#x667A;&#x5546;&#x3001;&#x540C;&#x6837;&#x7684;&#x5BB6;&#x5EAD;&#x80CC;&#x666F;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x6536;&#x5165;&#x7B49;&#x6BD4;&#x4F60;&#x591A;&#x5F88;&#x591A;&#xFF0C;&#x4F60;&#x5728;&#x610F;&#x4E48;&#xFF1F;</p>
<ol>
<li>&#x671F;&#x671B;&#x7406;&#x8BBA;</li>
</ol>
<p>&#x8FD9;&#x79CD;&#x7406;&#x8BBA;&#x628A;&#x4EBA;&#x7684;&#x52A8;&#x673A;&#x5206;&#x89E3;&#x6210;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x4E00;&#x662F;&#x5982;&#x679C;&#x6211;&#x52AA;&#x529B;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x79CD;&#x52AA;&#x529B;&#x80FD;&#x5426;&#x5728;&#x7EE9;&#x6548;&#x8BC4;&#x4F30;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x6765;&#xFF1F;&#x4E8C;&#x662F;&#x5982;&#x679C;&#x6211;&#x83B7;&#x5F97;&#x4E86;&#x826F;&#x597D;&#x7684;&#x7EE9;&#x6548;&#x8BC4;&#x4F30;&#xFF0C;&#x90A3;&#x4E48;&#x80FD;&#x5426;&#x5F97;&#x5230;&#x5956;&#x52B1;&#xFF1F;&#x4E09;&#x662F;&#x5373;&#x4F7F;&#x6211;&#x88AB;&#x5956;&#x52B1;&#x4E86;&#xFF0C;&#x8FD9;&#x4E1C;&#x897F;&#x662F;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x4ECE;&#x516C;&#x53F8;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x662F;&#x6FC0;&#x52B1;&#x5458;&#x5DE5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x5219;&#x662F;&#x52AA;&#x529B;&#x524D;&#x884C;&#x7684;&#x52A8;&#x529B;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x77E5;&#x9053;&#x5C31;&#x53EF;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x5BF9;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x8FDB;&#x884C;&#x89E6;&#x52A8;&#x7684;&#x70B9;&#xFF0C;&#x7406;&#x8BBA;&#x5728;&#x8FD9;&#x91CC;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5982;&#x679C;&#x60F3;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x9605;&#x8BFB;&#x7EC4;&#x7EC7;&#x884C;&#x4E3A;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x4E66;&#x7C4D;&#x4E86;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x5219;&#x4E3B;&#x8981;&#x53C2;&#x7167;&#x4E86;&#x4EBA;&#x6C11;&#x5927;&#x5B66;&#x51FA;&#x7248;&#x7684;&#x300A;&#x7EC4;&#x7EC7;&#x884C;&#x4E3A;&#x5B66;&#x300B;&#x4E00;&#x4E66;&#x3002;</p>
<p>&#x6700;&#x540E;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#x5355;&#x7EAF;&#x4ECE;&#x5883;&#x754C;&#x4E0A;&#x6765;&#x8BF4;&#x4F3C;&#x4E4E;&#x6709;&#x4E00;&#x79CD;&#x7CBE;&#x795E;&#x8FDC;&#x8FDC;&#x8D85;&#x51FA;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x6240;&#x80FD;&#x6DB5;&#x76D6;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x8FD9;&#x79CD;&#x6F8E;&#x6E43;&#x7684;&#x751F;&#x547D;&#x529B;&#x548C;&#x6C38;&#x4E0D;&#x5C48;&#x670D;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x867D;&#x7136;&#x5E74;&#x4EE3;&#x4E45;&#x8FDC;&#xFF0C;&#x4E43;&#x81F3;&#x5931;&#x53BB;&#x4F20;&#x627F;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x7CBE;&#x795E;&#x5374;&#x6B63;&#x662F;&#x4E0A;&#x53E4;&#x534E;&#x590F;&#x6C11;&#x65CF;&#x6240;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#x7684;&#x7CBE;&#x795E;&#x3002;</p>
<p>&#x4F55;&#x65B0;&#x5148;&#x751F;&#x4E3A;&#x81EA;&#x5DF1;&#x56FD;&#x5B66;&#x7ECF;&#x5178;&#x7CFB;&#x5217;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x603B;&#x5E8F;&#xFF0C;&#x5BF9;&#x6B64;&#x8FDB;&#x884C;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF1A;</p>
<p>&#x534E;&#x590F;&#x6C11;&#x65CF;&#x7684;&#x5148;&#x53F2;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x795E;&#x8BDD;&#x65F6;&#x4EE3;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x534E;&#x590F;&#x6C11;&#x65CF;&#x8087;&#x59CB;&#x548C;&#x6587;&#x660E;&#x6EE5;&#x89DE;&#x7684;&#x82F1;&#x96C4;&#x65F6;&#x4EE3;&#x3002;</p>
<p>&#x5973;&#x5A32;&#x662F;&#x6562;&#x4E8E;&#x8E48;&#x706B;&#x8865;&#x5929;&#x7684;&#x82F1;&#x96C4;&#x3002;&#x4F0F;&#x7FB2;&#x3001;&#x795E;&#x519C;&#x3001;&#x9EC4;&#x5E1D;&#x3001;&#x708E;&#x5E1D;&#x3001;&#x86A9;&#x5C24;&#x3001;&#x5927;&#x79B9;&#xFF0C;&#x6216;&#x521B;&#x4E16;&#x7EAA;&#xFF0C;&#x6216;&#x521B;&#x6587;&#x660E;&#xFF0C;&#x6216;&#x62D3;&#x5927;&#x8352;&#xFF0C;&#x6216;&#x5F00;&#x6C11;&#x667A;&#xFF0C;&#x6216;&#x594B;&#x8EAB;&#x4E3A;&#x5929;&#x4E0B;&#x6CD5;&#x3002;</p>
<p>&#x9CA7;&#x4E0E;&#x5927;&#x79B9;&#x7236;&#x6B7B;&#x5B50;&#x7EE7;&#xFF0C;&#x4EE5;&#x8EAB;&#x6D4E;&#x4E16;&#xFF0C;&#x62EF;&#x9ECE;&#x6C11;&#x4E8E;&#x6C34;&#x706B;&#xFF1B;&#x86A9;&#x5C24;&#x5171;&#x5DE5;&#x4E5D;&#x6B7B;&#x4E0D;&#x6094;&#xFF0C;&#x867D;&#x5931;&#x8D25;&#x800C;&#x58EE;&#x5FD7;&#x4E0D;&#x5C48;&#xFF0C;&#x5929;&#x5730;&#x4E3A;&#x4E4B;&#x5D29;&#x9677;&#x3002;</p>
<p>&#x5938;&#x7236;&#x9010;&#x65E5;&#xFF0C;&#x4F53;&#x73B0;&#x4E86;&#x5BF9;&#x795E;&#x7075;&#x7684;&#x85D0;&#x89C6;&#x3002;&#x800C;&#x7CBE;&#x536B;&#x586B;&#x6D77;&#xFF0C;&#x5219;&#x8868;&#x73B0;&#x4E86;&#x5BF9;&#x5BBF;&#x547D;&#x7684;&#x4E0D;&#x9A6F;&#x3002;</p>
<p>&#x7531;&#x6B64;&#x89C2;&#x4E4B;&#xFF0C;&#x4E2D;&#x534E;&#x6C11;&#x65CF;&#x7684;&#x795E;&#x8BDD;&#x5148;&#x53E4;&#x65F6;&#x4EE3;&#xFF0C;&#x5B9E;&#x5728;&#x662F;&#x4E00;&#x4E2A;&#x7FA4;&#x661F;&#x707F;&#x70C2;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6177;&#x6168;&#x60B2;&#x58EE;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x594B;&#x8FDB;&#x521A;&#x6BC5;&#x7684;&#x65F6;&#x4EE3;&#xFF1B;&#x662F;&#x732E;&#x8EAB;&#x8005;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6B89;&#x9053;&#x8005;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x521B;&#x9020;&#x82F1;&#x96C4;&#x548C;&#x4EA7;&#x751F;&#x82F1;&#x96C4;&#x7684;&#x65F6;&#x4EE3;&#x3002;</p>
<p>&#x4F20;&#x8BF4;&#x4E2D;&#x534E;&#x6C11;&#x65CF;&#x662F;&#x9F99;&#x548C;&#x51E4;&#x7684;&#x4F20;&#x4EBA;&#xFF0C;&#x800C;&#x9F99;&#x51E4;&#x7CBE;&#x795E;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x5C31;&#x662F;&#x5065;&#x4E0E;&#x7F8E;&#x7684;&#x7CBE;&#x795E;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x603B;&#x662F;&#x611F;&#x89C9;&#x5F88;&#x96BE;&#x7528;&#x52A8;&#x673A;&#x7406;&#x8BBA;&#x53BB;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x5B8F;&#x5927;&#x4E14;&#x58EE;&#x9614;&#x7684;&#x7CBE;&#x795E;&#x3002;</p>
<p>&#x5C0F;&#x7ED3;</p>
<p>IT&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x786E;&#x5B9E;&#x662F;&#x5E74;&#x8F7B;&#x4EBA;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x5934;&#x7684;&#x884C;&#x4E1A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4FE1;&#xFF0C;&#x53BB;&#x770B;&#x770B;&#x817E;&#x8BAF;&#x548C;&#x94F6;&#x884C;&#x9AD8;&#x5C42;&#x7684;&#x5E74;&#x9F84;&#x5427;&#x3002;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x5174;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x5F80;&#x5F80;&#x4F1A;&#x5E26;&#x7740;&#x4E00;&#x6279;&#x4EBA;&#x8D70;&#x4E0A;&#x6210;&#x957F;&#x7684;&#x5FEB;&#x8F66;&#x9053;&#x3002;&#x5728;&#x8FD9;&#x7C7B;&#x4F01;&#x4E1A;&#x91CC;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x5386;&#x53F2;&#x5305;&#x88B1;&#x6240;&#x4EE5;&#x5360;&#x636E;&#x9AD8;&#x4F4D;&#x7684;&#x5F80;&#x5F80;&#x662F;&#x4E9B;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x8FD9;&#x548C;&#x6709;&#x4E2A;&#x51E0;&#x5341;&#x5E74;&#x5386;&#x53F2;&#x7684;&#x884C;&#x4E1A;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x800C;&#x4E3A;&#x4E86;&#x8FBE;&#x6210;&#x8FD9;&#x4E00;&#x76EE;&#x7684;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x6709;&#x6548;&#x7684;&#x6301;&#x7EED;&#x589E;&#x503C;&#x5E76;&#x6210;&#x4E3A;&#x67D0;&#x4E00;&#x65B9;&#x7684;&#x9AD8;&#x624B;&#xFF08;&#x67B6;&#x6784;&#x5E08;&#x3001;Guru&#x6216;&#x8005;&#x4F18;&#x79C0;&#x7684;&#x7BA1;&#x7406;&#x8005;&#xFF09;&#x3002;&#x5355;&#x7EAF;&#x4ECE;&#x6280;&#x80FD;&#x4E0A;&#x8BB2;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x548C;&#x91D1;&#x5B57;&#x5854;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x767E;&#x4E07;&#x5927;&#x519B;&#x7ADE;&#x4E89;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x4E00;&#x4E2A;&#x521A;&#x5B66;&#x4F1A;&#x67D0;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x4EBA;&#x548C;&#x4E00;&#x4E2A;&#x6BCF;&#x5929;&#x601D;&#x8003;&#x865A;&#x62DF;&#x673A;&#x539F;&#x7406;&#x4E0E;&#x8BBE;&#x8BA1;&#x3001;&#x8BBE;&#x8BA1;&#x8DE8;&#x5E73;&#x53F0;&#x7CFB;&#x7EDF;&#x7684;&#x4EBA;&#x6709;&#x591A;&#x5927;&#x7684;&#x5DEE;&#x8DDD;&#x3002;&#x800C;&#x4ECE;&#x516C;&#x53F8;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x9AD8;&#x624B;&#x5219;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x4E3A;&#x516C;&#x53F8;&#x5728;&#x73B0;&#x5728;&#x6216;&#x5C06;&#x6765;&#x521B;&#x751F;&#x8F83;&#x5927;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x60F3;&#x6210;&#x4E3A;&#x9AD8;&#x624B;&#x5C31;&#x9700;&#x8981;&#x9009;&#x5B9A;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6301;&#x7EED;&#x6DF1;&#x5316;&#xFF0C;&#x5E76;&#x907F;&#x5F00;&#x5B66;&#x4E60;&#x8DEF;&#x4E0A;&#x7684;&#x8BF8;&#x591A;&#x9677;&#x9631;&#xFF0C;&#x5982;&#xFF1A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x3001;&#x5206;&#x79BB;&#x5B66;&#x4E60;&#x4E0E;&#x5B9E;&#x8DF5;&#x3001;&#x8FC7;&#x6563;&#x800C;&#x4E0D;&#x4E13;&#x7B49;&#x7B49;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.github.io/2016/g-programming-guide-8-dream/" data-id="ciy79yyl8002m1wskz0dsiktn" class="article-share-link">Share</a>
      
        <a href="http://snowyying.github.io/2016/g-programming-guide-8-dream/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/os-big-little-endian/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          轻松记住大端小端的含义 (附对大端和小端的解释)
        
      </div>
    </a>
  
  
    <a href="/2016/g-programming-guide-7-driving-force/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：物质驱动与兴趣驱动 编程驱动力是什么？</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/g-programming-guide-8-dream/" data-title="码路指南：保持内心的青春与理想 理想驱动编程" data-url="http://snowyying.github.io/2016/g-programming-guide-8-dream/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0] 
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded/">Embedded</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">14</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">21</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Software-Engineering/">Software Engineering</a><span class="category-list-count">9</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 12.22px;">C</a> <a href="/tags/C/" style="font-size: 12.22px;">C++</a> <a href="/tags/C-C/" style="font-size: 14.44px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 11.11px;">CMMI</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 13.33px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10px;">ICE</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IT/" style="font-size: 20px;">IT</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Linux/" style="font-size: 10px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NTP/" style="font-size: 11.11px;">NTP</a> <a href="/tags/Network/" style="font-size: 10px;">Network</a> <a href="/tags/OS/" style="font-size: 10px;">OS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 11.11px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/STUN/" style="font-size: 10px;">STUN</a> <a href="/tags/SWE/" style="font-size: 16.67px;">SWE</a> <a href="/tags/TCP-IP/" style="font-size: 13.33px;">TCP/IP</a> <a href="/tags/TRUN/" style="font-size: 10px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UML/" style="font-size: 10px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/epoll/" style="font-size: 11.11px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 11.11px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 11.11px;">linux</a> <a href="/tags/p2p/" style="font-size: 10px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/select/" style="font-size: 12.22px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 11.11px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/发展/" style="font-size: 15.56px;">发展</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/学习/" style="font-size: 10px;">学习</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/性能/" style="font-size: 13.33px;">性能</a> <a href="/tags/成长/" style="font-size: 18.89px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 15.56px;">指南</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/架构/" style="font-size: 10px;">架构</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.11px;">测试</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/程序员/" style="font-size: 17.78px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网络/" style="font-size: 16.67px;">网络</a> <a href="/tags/设计模式/" style="font-size: 13.33px;">设计模式</a> <a href="/tags/软件质量/" style="font-size: 11.11px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">一月 2017</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">十二月 2016</a><span class="archive-list-count">13</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">十一月 2016</a><span class="archive-list-count">14</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">十月 2016</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">九月 2016</a><span class="archive-list-count">17</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">八月 2016</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">七月 2016</a><span class="archive-list-count">1</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/it-manage-redmine/">IT 项目管理工具 Redmine</a>
          </li>
        
          <li>
            <a href="/2017/misc-radio-spectrum/">无线电波段和频谱</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-11-tcp-protocol/">TCP/IP 协议 - TCP 协议</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-10-dns/">TCP/IP 协议 - DNS</a>
          </li>
        
          <li>
            <a href="/2017/network-tcpip-9-igmp/">TCP/IP 协议 - IGMP</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>