<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>码路指南：别错过人生中学习的黄金时期 保持知识更新 | Snowyying</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2665 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x9519;&amp;#x8FC7;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7684;&amp;#x597D;&amp;#x65F6;&amp;#x673A;
&amp;#x6CA1;&amp;#x6BD5;&amp;#x4E1A;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="码路指南：别错过人生中学习的黄金时期 保持知识更新">
<meta property="og:url" content="http://snowyying.site/2016/gen-programming-guide-6-golden-time/index.html">
<meta property="og:site_name" content="Snowyying">
<meta property="og:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2665 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x9519;&amp;#x8FC7;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7684;&amp;#x597D;&amp;#x65F6;&amp;#x673A;
&amp;#x6CA1;&amp;#x6BD5;&amp;#x4E1A;&amp;#">
<meta property="og:updated_time" content="2017-01-12T02:31:16.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="码路指南：别错过人生中学习的黄金时期 保持知识更新">
<meta name="twitter:description" content="&amp;#x8F6C;&amp;#x81EA; http://www.nowamagic.net/librarys/veda/detail/2665 2014&amp;#x5E74;01&amp;#x6708;20&amp;#x65E5;
&amp;#x9519;&amp;#x8FC7;&amp;#x4EBA;&amp;#x751F;&amp;#x4E2D;&amp;#x7684;&amp;#x597D;&amp;#x65F6;&amp;#x673A;
&amp;#x6CA1;&amp;#x6BD5;&amp;#x4E1A;&amp;#">
  
    <link rel="alternate" href="/atom.xml" title="Snowyying" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">Snowyying</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">天下武功, 无坚不摧, 唯快不破.</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/About">About</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="搜索"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://snowyying.site"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-gen-programming-guide-6-golden-time" class="article article-type-post" itemscope itemprop="blogPost">

  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      码路指南：别错过人生中学习的黄金时期 保持知识更新
    </h1>
  

      </header>
    

  <div class="article-meta">
    <a href="/2016/gen-programming-guide-6-golden-time/" class="article-date">
  <time datetime="2016-08-05T05:37:22.000Z" itemprop="datePublished">2016-08-05</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/General/">General</a>
  </div>

  </div>

    <div class="article-entry" itemprop="articleBody">
      
        <p><code>&#x8F6C;&#x81EA; http://www.nowamagic.net/librarys/veda/detail/2665 2014&#x5E74;01&#x6708;20&#x65E5;</code></p>
<p>&#x9519;&#x8FC7;&#x4EBA;&#x751F;&#x4E2D;&#x7684;&#x597D;&#x65F6;&#x673A;</p>
<p>&#x6CA1;&#x6BD5;&#x4E1A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6216;&#x8005;&#x521A;&#x6BD5;&#x4E1A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5F80;&#x5F80;&#x611F;&#x89C9;&#x7A7A;&#x4F59;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x5145;&#x6C9B;&#xFF0C;&#x8FD8;&#x5F88;&#x82E6;&#x607C;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x6253;&#x53D1;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4E00;&#x4E2A;&#x4EBA;&#x4E00;&#x751F;&#x4E2D;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5145;&#x7535;&#x7684;&#x65F6;&#x95F4;&#x8FDC;&#x6BD4;&#x60F3;&#x7684;&#x5C11;&#x3002;&#x4E00;&#x65E6;&#x9519;&#x8FC7;&#x65F6;&#x673A;&#xFF0C;&#x5F80;&#x5F80;&#x6094;&#x4E4B;&#x83AB;&#x53CA;&#x3002;</p>
<a id="more"></a>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x4EBA;&#x751F;&#x5C31;&#x50CF;&#x4E2A;&#x6A21;&#x677F;&#xFF0C;&#x5C0F;&#x5904;&#x8FD8;&#x6709;&#x504F;&#x5DEE;&#xFF0C;&#x5927;&#x5904;&#x5374;&#x57FA;&#x672C;&#x76F8;&#x540C;&#x3002;</p>
<p>20~30&#x5C81;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x8BB2;&#x662F;&#x9EC4;&#x91D1;&#x65F6;&#x671F;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x91CC;&#xFF0C;&#x5BB6;&#x5EAD;&#x8D1F;&#x62C5;&#x8F83;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x652F;&#x914D;&#x7684;&#x65F6;&#x95F4;&#x8F83;&#x591A;&#x3002;&#x5F53;&#x7136;&#x649E;&#x5230;&#x4E86;&#x5F88;&#x7279;&#x522B;&#x7684;&#x3001;&#x9700;&#x8981;&#x75AF;&#x72C2;&#x52A0;&#x73ED;&#x7684;&#x516C;&#x53F8;&#x53EA;&#x80FD;&#x53E6;&#x7B97;&#x3002;<br>30&#x5C81;&#x4E4B;&#x540E;&#x56E0;&#x4E3A;&#x5A03;&#x5A03;&#x51FA;&#x751F;&#x7B49;&#xFF0C;&#x5BB6;&#x5EAD;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x589E;&#x52A0;&#xFF0C;&#x4E2A;&#x4EBA;&#x53EF;&#x652F;&#x914D;&#x65F6;&#x95F4;&#x53D8;&#x5C11;&#x3002;&#x5176;&#x4E2D;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x8FD8;&#x6709;&#x5F88;&#x5927;&#x53EF;&#x80FD;&#x4F1A;&#x9762;&#x5BF9;&#x7535;&#x89C6;&#x5267;&#x91CC;&#x5E38;&#x8BF4;&#x7684;&#x5A46;&#x5AB3;&#x77DB;&#x76FE;&#xFF0C;&#x8BA9;&#x4F60;&#x6BCF;&#x5929;&#x5FC3;&#x7EEA;&#x4E0D;&#x5B81;&#x3002;<br>40&#x5C81;&#x4E4B;&#x540E;&#xFF0C;&#x5BB6;&#x5EAD;&#x7410;&#x4E8B;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x52A0;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x4E0A;&#x6709;&#x8001;&#x4E0B;&#x6709;&#x5C0F;&#x3002;&#x5B9E;&#x5728;&#x8FD0;&#x6C14;&#x4E0D;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x4F1A;&#x751F;&#x70B9;&#x75C5;&#x2014;&#x9888;&#x690E;&#x75C5;&#x3001;&#x8170;&#x95F4;&#x76D8;&#x7A81;&#x51FA;&#x3001;&#x80C3;&#x75C5;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x5165;&#x9009;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4E09;&#x5927;&#x804C;&#x4E1A;&#x75C5;&#x3002;<br>50&#x5C81;&#x4E4B;&#x540E;&#xFF0C;&#x65F6;&#x95F4;&#x4E0A;&#x4F1A;&#x518D;&#x6B21;&#x89E3;&#x8131;&#xFF0C;&#x4F46;&#x53EF;&#x60DC;&#x7684;&#x662F;&#x81EA;&#x5DF1;&#x4E5F;&#x8001;&#x4E86;&#xFF0C;&#x65F6;&#x673A;&#x4E0D;&#x5728;&#x3002;<br>&#x5982;&#x679C;&#x628A;&#x4EBA;&#x751F;&#x6309;&#x7167;&#x5E74;&#x9F84;&#x753B;&#x4E00;&#x6761;&#x629B;&#x7269;&#x7EBF;&#x7684;&#x8BDD;&#xFF0C;40&#x5C81;&#x5DE6;&#x53F3;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x7684;&#x4EBA;&#x751F;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x672A;&#x6765;&#x518D;&#x7A81;&#x7834;&#x7684;&#x51E0;&#x7387;&#x5219;&#x53D8;&#x5C0F;&#x3002;&#x4ECE;&#x5386;&#x53F2;&#x4EBA;&#x7269;&#x6765;&#x770B;&#xFF0C;&#x5927;&#x5668;&#x665A;&#x6210;&#x7684;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#xFF0C;&#x4F46;&#x771F;&#x7684;&#x5F88;&#x5C11;&#x3002;</p>
<p>&#x7528;&#x5FC3;&#x89C2;&#x5BDF;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x62DB;&#x8058;&#x542F;&#x793A;&#x91CC;&#x7ECF;&#x5E38;&#x4F1A;&#x6CE8;&#x660E;&#x5E74;&#x9F84;&#x8981;&#x5728;35&#x5468;&#x5C81;&#x4EE5;&#x4E0B;&#x6216;&#x8005;40&#x5468;&#x5C81;&#x4EE5;&#x4E0B;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x62DB;&#x8058;&#x9AD8;&#x5C42;&#x3002;&#x8FD9;&#x53CD;&#x8FC7;&#x6765;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5230;&#x9AD8;&#x5C42;&#xFF0C;&#x4EBA;&#x751F;&#x4F1A;&#x5728;40&#x4E4B;&#x524D;&#x5B9A;&#x578B;&#xFF0C;&#x4E4B;&#x540E;&#x6709;&#x4E0B;&#x6ED1;&#x5371;&#x9669;&#xFF08;&#x5982;&#x906D;&#x9047;&#x4E0D;&#x666F;&#x6C14;&#x3001;&#x516C;&#x53F8;&#x5012;&#x95ED;&#x7B49;&#xFF09;&#x3002;&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#x5C24;&#x5176;&#x7684;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x53EF;&#x80FD;&#x4F60;&#x8F9B;&#x82E6;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x88AB;&#x66F4;&#x8FED;&#x6389;&#x4E86;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x672C;&#x8EAB;&#x65E0;&#x7591;&#x7684;&#x662F;&#x9700;&#x8981;&#x987A;&#x5E94;&#x8FD9;&#x79CD;&#x81EA;&#x7136;&#x89C4;&#x5F8B;&#x7684;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x5728;&#x4E8E;&#xFF0C;&#x5728;&#x9EC4;&#x91D1;&#x65F6;&#x671F;&#xFF0C;&#x6CA1;&#x505A;&#x4EC0;&#x4E48;&#x79EF;&#x7D2F;&#xFF0C;&#x5C31;&#x987E;&#x5F97;&#x4EAB;&#x53D7;&#x751F;&#x6D3B;&#x4E86;&#xFF0C;&#x800C;&#x4E00;&#x65E6;&#x610F;&#x8BC6;&#x5230;&#x79EF;&#x7D2F;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x65F6;&#xFF0C;&#x5374;&#x53C8;&#x53D7;&#x56F0;&#x4E8E;&#x8BF8;&#x591A;&#x7410;&#x4E8B;&#x800C;&#x6B32;&#x632F;&#x4E4F;&#x529B;&#xFF0C;&#x6700;&#x7EC8;&#x4EBA;&#x751F;&#x9AD8;&#x5EA6;&#x6709;&#x9650;&#xFF0C;&#x5E76;&#x8FC5;&#x901F;&#x8D70;&#x4F4E;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x73B0;&#x4EE3;&#x7A0B;&#x5E8F;&#x5458;&#x7248;&#x7684;&#x201C;&#x5C11;&#x58EE;&#x4E0D;&#x52AA;&#x529B;&#xFF0C;&#x8001;&#x5927;&#x5F92;&#x4F24;&#x60B2;&#x201D;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x4E0A;&#x8BB2;&#xFF0C;35&#x5C81;&#x4EE5;&#x524D;&#x8981;&#x628A;&#x9700;&#x8981;&#x82B1;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x6BD4;&#x8F83;&#x786C;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x9661;&#x7684;&#x6280;&#x80FD;&#x638C;&#x63E1;&#xFF0C;&#x5177;&#x5907;&#x5DE5;&#x4F5C;&#x6240;&#x9700;&#x8981;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x8981;&#x6280;&#x80FD;&#xFF0C;&#x800C;35&#x5C81;&#x4E4B;&#x540E;&#x5219;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x77E5;&#x8BC6;&#x7684;&#x66F4;&#x65B0;&#x548C;&#x67D0;&#x4E9B;&#x8F6F;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x65F6;&#x6DFB;&#x6C34;&#x6218;&#x672F;&#x6548;&#x7387;&#x771F;&#x7684;&#x5F88;&#x5DEE;&#xFF0C;&#x6BCF;&#x6B21;&#x70B9;&#x4E00;&#x6839;&#x706B;&#x67F4;&#x70E7;&#x6C34;&#xFF0C;&#x4E00;&#x4EBF;&#x5E74;&#x6C34;&#x4E5F;&#x70E7;&#x4E0D;&#x5F00;&#x4E00;&#x58F6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6BD4;&#x8F83;&#x786C;&#x7684;&#x6280;&#x80FD;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;Donald Knuth&#x7684;&#x300A;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x827A;&#x672F;&#x300B;)&#x5F80;&#x5F80;&#x662F;&#x9700;&#x8981;&#x5927;&#x5757;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x7684;&#xFF0C;&#x4F46;&#x5E74;&#x7EAA;&#x8D8A;&#x5927;&#x65F6;&#x95F4;&#x8D8A;&#x5448;&#x73B0;&#x4E3A;&#x788E;&#x7247;&#x5316;&#xFF0C;&#x8D8A;&#x96BE;&#x641E;&#x5B9A;&#x786C;&#x7684;&#x77E5;&#x8BC6; &#x2014;&#x2014; &#x5148;&#x5929;&#x5C31;&#x5BB9;&#x6613;&#x9020;&#x5C31;&#x6DFB;&#x6C34;&#x6218;&#x672F;&#x3002;&#x6BD4;&#x8F83;&#x8F6F;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7528;&#x788E;&#x7247;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x63D0;&#x9AD8;PPT&#x7684;&#x5236;&#x4F5C;&#x6C34;&#x5E73;&#xFF0C;&#x63D0;&#x9AD8;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x80FD;&#x591F;&#x5B89;&#x6392;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x8F6F;&#x786C;&#x77E5;&#x8BC6;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x7279;&#x5B9A;&#x57FA;&#x7840;&#x4E0A;&#x505A;&#x79EF;&#x7D2F;&#xFF0C;&#x5C0F;&#x6B65;&#x524D;&#x8FDB;&#xFF0C;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5E74;&#x8F7B;&#x7EDD;&#x5BF9;&#x662F;&#x4E00;&#x79CD;&#x503A;&#x52A1;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5FC5;&#x987B;&#x5728;&#x4ED6;&#x6CA1;&#x5B8C;&#x5168;&#x7ED3;&#x675F;&#x524D;&#xFF0C;&#x8FD8;&#x6389;&#x6240;&#x6B20;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x6BD4;&#x8F83;&#x786C;&#x7684;&#xFF0C;&#x8981;&#x5728;35&#x5C81;&#x524D;&#x641E;&#x5B9A;&#x5462;&#xFF1F;&#x8FD9;&#x56E0;&#x76EE;&#x6807;&#x800C;&#x5F02;&#xFF0C;&#x4F46;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x901A;&#x7528;&#x6027;&#xFF1A;</p>
<p>&#x7CBE;&#x901A;&#x4E00;&#x95E8;&#x6700;&#x5E38;&#x7528;&#x7684;&#x8BED;&#x8A00;<br>&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x6700;&#x5E38;&#x7528;&#x5E73;&#x53F0;&#x7684;&#x57FA;&#x672C;&#x673A;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3001;&#x7EBF;&#x7A0B;&#x673A;&#x5236;&#x7B49;<br>UML&#x56FE;&#x548C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;<br>&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5982;&#xFF1A;&#x804C;&#x8D23;&#x5355;&#x4E00;&#x7B49;<br>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;<br>&#x300A;&#x4EE3;&#x7801;&#x5927;&#x5168;&#x300B;&#x91CC;&#x8BB2;&#x7684;&#x4E00;&#x5207;<br>&#x7CBE;&#x8BFB;&#x4E00;&#x4E2A;&#x77E5;&#x540D;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x70B9;&#x89C4;&#x6A21;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x70B9;&#x4E0A;&#x8981;&#x611F;&#x8C22;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x4F18;&#x79C0;&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x8981;&#x8C28;&#x9632;&#x597D;&#x9AD8;&#x9A9B;&#x8FDC;&#xFF0C;&#x52A8;&#x8F84;&#x6311;&#x6218;Linux&#x5185;&#x6838;&#xFF0C;&#x7CBE;&#x8BFB;&#x662F;&#x5173;&#x952E;&#x3002;<br>&#x7D2F;&#x79EF;&#x4E00;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x72EC;&#x7ACB;&#x7684;&#x5B8C;&#x6574;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x6570;&#x4E07;&#x4EE3;&#x7801;&#x884C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x662F;&#x5B8C;&#x5168;&#x81EA;&#x5DF1;&#x6253;&#x9020;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x62F7;&#x8D1D;&#x7C98;&#x8D34;&#x3002;<br>&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x53EF;&#x4EE5;&#x4E0D;&#x81EA;&#x5DF1;&#x5199;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x8981;&#x77E5;&#x9053;&#x5176;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x533A;&#x522B;&#xFF09;<br>&#x517B;&#x6210;&#x4E00;&#x79CD;&#x6E05;&#x6670;&#x7684;&#x7F16;&#x7801;&#x98CE;&#x683C;<br>&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E13;&#x4E1A;&#xFF08;&#x91D1;&#x878D;&#x3001;&#x9AD8;&#x5E76;&#x53D1;&#x7F51;&#x7AD9;&#xFF0C;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF0C;TTS&#x7B49;&#xFF09;<br>&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x7684;&#x65F6;&#x673A;&#x548C;&#x5FC5;&#x8981;&#x6027;</p>
<p>&#x603B;&#x7684;&#x6765;&#x770B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#x662F;&#x4E00;&#x9879;&#x6295;&#x8D44;&#x56DE;&#x62A5;&#x7387;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6295;&#x5165;&#x3002;&#x4ECE;&#x76EE;&#x6807;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x672A;&#x5FC5;&#x4E00;&#x5B9A;&#x8981;&#x53E3;&#x8BED;&#x6D41;&#x5229;&#xFF0C;&#x4F46;&#x6700;&#x4F4E;&#x8981;&#x8FBE;&#x5230;&#x9605;&#x8BFB;&#x82F1;&#x6587;&#x8D44;&#x6599;&#x6CA1;&#x6709;&#x969C;&#x788D;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x65E6;&#x82F1;&#x8BED;&#x9605;&#x8BFB;&#x95EE;&#x9898;&#x8F83;&#x5927;&#xFF0C;&#x67E5;&#x627E;&#x95EE;&#x9898;&#x4F1A;&#x4E60;&#x60EF;&#x7528;&#x767E;&#x5EA6;&#xFF0C;&#x8FD9;&#x5929;&#x7136;&#x4F1A;&#x9650;&#x5236;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x89C6;&#x91CE;&#x3002;&#x4E0D;&#x662F;&#x8BF4;&#x767E;&#x5EA6;&#x81EA;&#x8EAB;&#x6709;&#x591A;&#x4E0D;&#x597D;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x82F1;&#x8BED;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6709;&#x7740;&#x66F4;&#x591A;&#x66F4;&#x7CBE;&#x5F69;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x559C;&#x6B22;&#x4E0D;&#x559C;&#x6B22;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#x4E00;&#x79CD;&#x73B0;&#x5B9E;&#xFF0C;&#x5728;IT&#x7684;&#x4E16;&#x754C;&#x91CC;&#x82F1;&#x8BED;&#x662F;&#x4E00;&#x79CD;&#x4E16;&#x754C;&#x8BED;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x7531;&#x4E8E;&#x7F8E;&#x56FD;&#x516C;&#x53F8;&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x5219;&#x662F;&#x7531;&#x4E8E;&#x5F00;&#x6E90;&#x9009;&#x62E9;&#x4E86;&#x82F1;&#x8BED;&#x3002;&#x8FD9;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;IT&#x4E16;&#x754C;&#x91CC;&#x7684;&#x65B0;&#x52A8;&#x5411;&#x3001;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x5C0F;&#x6280;&#x5DE7;&#x3001;&#x7F51;&#x7AD9;&#x7684;&#x67B6;&#x6784;&#x7B49;&#x7B49;&#x90FD;&#x8981;&#x5230;&#x82F1;&#x8BED;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x53BB;&#x627E;&#x3002;&#x5728;StackOverlow&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x5404;&#x79CD;&#x5C0F;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x5728;Quora&#x5219;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x5404;&#x79CD;&#x7F51;&#x7AD9;&#x7684;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x4ECE;&#x5B66;&#x4E60;&#x65F6;&#x673A;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7279;&#x522B;&#x5E94;&#x8BE5;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x641E;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x884C;&#x81F3;&#x5C11;&#x4E5F;&#x8981;&#x5728;&#x6BD5;&#x4E1A;1~2&#x5E74;&#x5185;&#x8FBE;&#x5230;&#x9605;&#x8BFB;&#x65E0;&#x969C;&#x788D;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x5F53;&#x7136;&#x5E0C;&#x671B;&#x52A0;&#x5165;&#x5916;&#x4F01;&#x8FD8;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x4ED8;&#x51FA;&#x3002;&#x4ECE;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x6765;&#x770B;&#xFF0C;&#x5B66;&#x4E60;&#x5916;&#x8BED;&#x771F;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x7684;&#x7A8D;&#x95E8;&#xFF0C;&#x575A;&#x6301;&#x5E76;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x505C;&#x6B62;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;</p>
<p>&#x5BF9;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x589E;&#x503C;&#x800C;&#x8A00;&#xFF0C;&#x4EBA;&#x751F;&#x91CC;&#x6700;&#x5927;&#x7684;&#x9677;&#x9631;&#x4E5F;&#x8BB8;&#x662F;&#x4E3A;&#x5B89;&#x5168;&#x7684;&#x5047;&#x8C61;&#x6240;&#x6B3A;&#x9A97;&#x800C;&#x5F7B;&#x5E95;&#x7684;&#x653E;&#x677E;&#x81EA;&#x5DF1;&#x3002;&#x8FD9;&#x79CD;&#x72B6;&#x51B5;&#x5728;&#x751F;&#x5B58;&#x73AF;&#x5883;&#x6BD4;&#x8F83;&#x6076;&#x52A3;&#x7684;&#x60C5;&#x5F62;&#x4E0B;&#x4E0D;&#x592A;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x5728;&#x5784;&#x65AD;&#x4F01;&#x4E1A;&#x6216;&#x67D0;&#x4E00;&#x9886;&#x57DF;&#x4E2D;&#x7EDD;&#x5BF9;&#x9886;&#x5148;&#x7684;&#x4F01;&#x4E1A;&#x91CC;&#x5219;&#x5BB9;&#x6613;&#x6ECB;&#x751F;&#x3002;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x505C;&#x6B62;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;&#x4E86;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4E00;&#x5E74;&#x4E00;&#x672C;&#x4E66;&#x6CA1;&#x770B;&#xFF0C;&#x4E00;&#x5E74;&#x4E00;&#x70B9;&#x65B0;&#x77E5;&#x8BC6;&#x6CA1;&#x63A5;&#x89E6;&#xFF0C;&#x4E00;&#x5E74;&#x4E2D;&#x5DE5;&#x4F5C;&#x8D1F;&#x8377;&#x57FA;&#x672C;&#x4E0D;&#x6EE1;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x8FD9;&#x771F;&#x7684;&#x662F;&#x6E29;&#x6C34;&#x716E;&#x9752;&#x86D9;&#xFF0C;&#x4E00;&#x65E6;&#x5230;&#x4E86;&#x4E09;&#x5341;&#x51E0;&#x5C81;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x79CD;&#x73AF;&#x5883;&#x4E2D;&#x5446;&#x4E60;&#x60EF;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x518D;&#x60F3;&#x8DF3;&#x51FA;&#x6765;&#xFF0C;&#x57FA;&#x672C;&#x6CA1;&#x53EF;&#x80FD;&#x3002;&#x552F;&#x4E00;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x7948;&#x7977;&#x516C;&#x53F8;&#x4E0D;&#x8981;&#x6302;&#x6389;&#xFF0C;&#x516C;&#x53F8;&#x4E5F;&#x4E0D;&#x8981;&#x6765;&#x573A;&#x8FD0;&#x52A8;&#xFF0C;&#x8FDB;&#x884C;&#x4EBA;&#x5458;&#x7684;&#x5927;&#x6362;&#x8840;&#x3002;&#x5B54;&#x592B;&#x5B50;&#x8BF4;&#xFF1A;&#x65E5;&#x5F53;&#x4E09;&#x7701;&#x543E;&#x8EAB;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x81F3;&#x4E8E;&#x8BA4;&#x8BC6;&#x5371;&#x9669;&#x540E;&#x80FD;&#x5426;&#x505A;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E8B;&#x5728;&#x4EBA;&#x4E3A;&#x4E86;&#x3002;</p>
<ol>
<li>&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;</li>
</ol>
<p>&#x63A5;&#x89E6;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5C97;&#x4F4D;&#x540E;&#xFF0C;&#x5927;&#x81F4;&#x8981;&#x7ECF;&#x5386;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x5E76;&#x9010;&#x6E10;&#x80DC;&#x4EFB;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x91CC;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x5B66;&#x4E60;&#x70ED;&#x60C5;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x57FA;&#x672C;&#x80DC;&#x4EFB;&#x4E4B;&#x540E;&#xFF0C;&#x4E8B;&#x60C5;&#x5C31;&#x6709;&#x4E86;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x89C9;&#xFF0C;&#x53CD;&#x6B63;&#x5DE5;&#x4F5C;&#x4E5F;&#x5C31;&#x7528;&#x5230;&#x8FD9;&#x4E48;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x5B66;&#x4E60;&#x5176;&#x4ED6;&#x7684;&#x4E5F;&#x7528;&#x4E0D;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x59CB;&#x628A;&#x81EA;&#x5DF1;&#x5C01;&#x95ED;&#x8D77;&#x6765;&#xFF0C;&#x4E0D;&#x592A;&#x770B;&#x4E66;&#xFF0C;&#x4E0D;&#x592A;&#x770B;&#x6280;&#x672F;&#x65B0;&#x95FB;&#x3002;</p>
<p>&#x8FD9;&#x5176;&#x5B9E;&#x5F88;&#x5371;&#x9669;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x7B49;&#x4E8E;&#x628A;&#x81EA;&#x5DF1;&#x7ED1;&#x6B7B;&#x5728;&#x5F53;&#x524D;&#x8FD9;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E0A;&#x3002;&#x800C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x78B0;&#x5DE7;&#x5176;&#x6240;&#x7528;&#x7684;&#x6280;&#x672F;&#x4E5F;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4E8B;&#x4EBA;&#x5C31;&#x4F1A;&#x5F88;&#x5C34;&#x5C2C;&#x3002;&#x56E0;&#x4E3A;&#x4EA7;&#x54C1;&#x53EF;&#x4EE5;&#x7ED3;&#x675F;&#xFF0C;&#x751F;&#x6D3B;&#x5374;&#x8FD8;&#x5F97;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x9762;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7ECF;&#x5178;&#x7684;&#x4F8B;&#x5B50;&#x662F;MFC&#x3002;&#x5FAE;&#x8F6F;&#x7684;&#x8FD9;&#x6B3E;&#x4EA7;&#x54C1;&#x7684;&#x5386;&#x53F2;&#x975E;&#x5E38;&#x60A0;&#x4E45;&#xFF0C;&#x4ECE;1992&#x5E74;&#x53D1;&#x5E03;&#x5230;2012&#x5E74;&#x51E0;&#x8FD1;&#x5B58;&#x5728;&#x4E86;20&#x5E74;&#x65F6;&#x95F4;&#x3002;&#x968F;&#x7740;90&#x540E;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x9010;&#x6E10;&#x51FA;&#x73B0;&#xFF0C;&#x9A6C;&#x4E0A;&#x8FD9;&#x6B3E;&#x6280;&#x672F;&#x5C31;&#x8981;&#x53D8;&#x5F97;&#x6BD4;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5E74;&#x7EAA;&#x8FD8;&#x8981;&#x5927;&#x4E86;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x5F88;&#x591A;&#x684C;&#x9762;&#x5E94;&#x7528;&#x4ECD;&#x7136;&#x662F;&#x57FA;&#x4E8E;MFC&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x7A0B;&#x5E8F;&#x5305;&#x7684;dll&#x4F9D;&#x8D56;&#x6765;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;MFC&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x6C60;&#x5B50;&#xFF0C;&#x6709;&#x6DF1;&#x5EA6;&#x3001;&#x6709;&#x5386;&#x53F2;&#x3002;&#x60F3;&#x628A;MFC&#x7684;&#x7C7B;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x3001;&#x6D88;&#x606F;&#x673A;&#x5236;&#x3001;&#x6846;&#x67B6;&#x7ED3;&#x6784;&#x3001;RTTI&#x3001;&#x5E8F;&#x5217;&#x5316;&#x90FD;&#x641E;&#x6E05;&#x695A;&#x8FD8;&#x662F;&#x8981;&#x5F88;&#x82B1;&#x4E00;&#x70B9;&#x65F6;&#x95F4;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4E00;&#x6B3E;&#x5E9E;&#x5927;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x662F;&#x57FA;&#x4E8E;MFC&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x901A;&#x8FC7;&#x51E0;&#x5E74;&#x7684;&#x52AA;&#x529B;&#x4E86;&#x89E3;&#x4E86;MFC&#xFF0C;&#x4E86;&#x89E3;&#x4E86;&#x5E94;&#x7528;&#x672C;&#x8EAB;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x8D1F;&#x62C5;&#x8D77;Bug&#x4FEE;&#x6B63;&#xFF0C;&#x65B0;&#x529F;&#x80FD;&#x8FFD;&#x52A0;&#x7B49;&#x4EFB;&#x52A1;&#x4E86;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x4F3C;&#x4E4E;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x5B66;&#x7684;&#x4E86;&#x3002;&#x56E0;&#x4E3A;MFC&#x7684;&#x66F4;&#x65B0;&#x51E0;&#x4E4E;&#x5DF2;&#x7ECF;&#x505C;&#x6EDE;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;MFC&#x7684;&#x5B66;&#x4E60;&#x51E0;&#x4E4E;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x592A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#x3002;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x4E5F;&#x7406;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x4E86;&#x3002;&#x73B0;&#x6709;&#x7A0B;&#x5E8F;&#x4E5F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x6EE1;&#x8DB3;&#x4E86;&#x4F01;&#x4E1A;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x63A8;&#x5012;&#x91CD;&#x6765;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x90A3;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x4E86;&#x4E48;&#xFF1F;&#x7B54;&#x6848;&#x4E00;&#x5B9A;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x9762;&#x8574;&#x85CF;&#x7740;&#x4E00;&#x4E2A;&#x5929;&#x5927;&#x7684;&#x77DB;&#x76FE;&#x3002;</p>
<p>&#x4ECE;&#x4F01;&#x4E1A;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x6765;&#x7EF4;&#x6301;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x7684;&#x3002;&#x4F46;&#x4ECE;&#x4E2A;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x6240;&#x6709;&#x7684;&#x9752;&#x6625;&#x90FD;&#x8017;&#x8D39;&#x5728;&#x8001;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x65E6;&#x8001;&#x6280;&#x672F;&#x9000;&#x51FA;&#x5386;&#x53F2;&#x821E;&#x53F0;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BE5;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;&#xFF1F;</p>
<p>&#x8FD8;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x6301;&#x7EED;&#x6295;&#x5165;&#x5728;&#x8FD9;&#x7C7B;&#x5F00;&#x53D1;&#x4E0A;&#xFF0C;&#x5F53;&#x4ED6;45&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x524D;&#x4EA7;&#x54C1;&#x751F;&#x547D;&#x5468;&#x671F;&#x7ED3;&#x675F;&#xFF0C;&#x4E16;&#x754C;&#x53D8;&#x7684;&#x53EA;&#x6709;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x548C;&#x4E91;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x64C5;&#x957F;MFC&#x7684;&#x4ED6;&#x8BE5;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x771F;&#x7684;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x5C31;&#x88AB;&#x903C;&#x5230;&#x4E86;&#x6B7B;&#x89D2;&#x91CC;&#xFF0C;&#x4EBA;&#x751F;&#x5F88;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x6ED1;&#x843D;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x8BA4;&#x4E3A;&#x6240;&#x5B66;&#x8DB3;&#x591F;&#x800C;&#x505C;&#x6B62;&#x6280;&#x80FD;&#x7684;&#x66F4;&#x65B0;&#x4E0E;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x4ECE;&#x5177;&#x4F53;&#x5E94;&#x5BF9;&#x63AA;&#x65BD;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x662F;&#x8981;&#x53C2;&#x7167;&#x77E5;&#x8BC6;&#x7684;&#x5730;&#x56FE;&#xFF0C;&#x6A2A;&#x5411;&#x6269;&#x5C55;&#x77E5;&#x8BC6;&#x7684;&#x5E7F;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x53EA;&#x8981;&#x76EF;&#x7740;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x8981;&#x4E86;&#x89E3;&#x4E1A;&#x52A1;&#xFF1B;&#x4E0D;&#x53EA;&#x5173;&#x6CE8;&#x5F00;&#x53D1;&#x4E5F;&#x5173;&#x6CE8;&#x4E00;&#x70B9;&#x4F30;&#x7B97;&#xFF1B;&#x4E8C;&#x662F;&#x63D0;&#x5347;&#x53EF;&#x6D41;&#x52A8;&#x6027;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x638C;&#x63E1;&#x7A0B;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x4E0E;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x6837;&#x8DE8;&#x8D8A;&#x5230;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x65F6;&#x5C31;&#x80FD;&#x591F;&#x6BD4;&#x8F83;&#x5E73;&#x7F13;&#x7684;&#x8FDB;&#x884C;&#x8FC7;&#x6E21;&#x3002;&#x4E09;&#x662F;&#x8981;&#x4E89;&#x53D6;&#x8F6E;&#x6362;&#x5C97;&#x4F4D;&#xFF0C;&#x4E89;&#x53D6;&#x591A;&#x79CD;&#x5B9E;&#x8DF5;&#x673A;&#x4F1A;&#x3002;</p>
<ol>
<li>&#x7BA1;&#x7406;&#x8005;&#x7684;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;</li>
</ol>
<p>&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x8BA4;&#x540C;&#xFF0C;&#x7BA1;&#x7406;&#x8005;&#x662F;&#x9700;&#x8981;&#x61C2;&#x6280;&#x672F;&#x7684;&#x3002;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x770B;&#x201C;&#x61C2;&#x201D;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x778E;&#x6307;&#x6325;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x4E2D;&#x56FD;&#x7248;&#x7684;&#x201C;&#x73B0;&#x573A;&#x4E3B;&#x4E49;&#x201D;&#xFF0C;&#x4F30;&#x8BA1;&#x4E89;&#x8BAE;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x90A3;&#x5173;&#x952E;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x7A76;&#x7ADF;&#x8981;&#x201C;&#x61C2;&#x201D;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x8BF4;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x4E86;&#x7BA1;&#x7406;&#x65B9;&#x5411;&#xFF0C;&#x4E00;&#x4E2A;&#x9009;&#x4E86;&#x6280;&#x672F;&#x65B9;&#x5411;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x6C42;&#x7BA1;&#x7406;&#x65B9;&#x5411;&#x4E0A;&#x7684;&#x4EBA;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x8981;&#x548C;&#x6280;&#x672F;&#x65B9;&#x5411;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x4E48;&#x9664;&#x975E;&#x8FD9;&#x4E2A;&#x4EBA;&#x7279;&#x522B;&#x5929;&#x624D;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x3002;&#x6B63;&#x50CF;&#x524D;&#x9762;&#x6240;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x201C;Key&#x201D;&#x4E0D;&#x540C;&#x6240;&#x9020;&#x6210;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x628A;&#x76EE;&#x6807;&#x8BBE;&#x5B9A;&#x4E3A;&#x786E;&#x4FDD;&#x6700;&#x7EC8;&#x4EA7;&#x54C1;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x540C;&#x65F6;&#x5047;&#x8BBE;&#x7BA1;&#x7406;&#x8005;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x51B3;&#x7B56;&#x6743;&#xFF0C;&#x90A3;&#x4E48;&#x7BA1;&#x7406;&#x8005;&#x5FC5;&#x987B;&#x5728;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x65B9;&#x9762;&#x6709;&#x6280;&#x672F;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x4ECE;&#x505A;&#x4EA7;&#x54C1;&#x6765;&#x770B;&#xFF0C;&#x8981;&#x60F3;&#x6210;&#x529F;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x7EF4;&#x5EA6;&#x9700;&#x8981;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x628A;&#x63E1;&#xFF0C;&#x4E00;&#x662F;&#x4EA7;&#x54C1;&#x7684;&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x628A;&#x63E1;&#xFF1B;&#x4E00;&#x662F;&#x7528;&#x5408;&#x9002;&#x7684;&#x624B;&#x6BB5;&#x53BB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x524D;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x5F88;&#x8001;&#xFF0C;&#x300A;&#x4EBA;&#x6708;&#x795E;&#x8BDD;&#x300B;&#x5C31;&#x6709;&#x63D0;&#x53CA;&#xFF0C;&#x4F46;&#x5B9E;&#x8DF5;&#x4E2D;&#x5374;&#x603B;&#x662F;&#x88AB;&#x4EBA;&#x5FD8;&#x8BB0;&#x3002;&#x597D;&#x7684;&#x4EA7;&#x54C1;&#x5FC5;&#x987B;&#x8D2F;&#x5F7B;&#x67D0;&#x4E00;&#x79CD;&#x7EDF;&#x4E00;&#x610F;&#x5FD7;&#xFF0C;iPhone&#x3001;&#x5FAE;&#x4FE1;&#x53C8;&#x91CD;&#x65B0;&#x9A8C;&#x8BC1;&#x4E86;&#x8FD9;&#x4E00;&#x4E2A;&#x8001;&#x7684;&#x539F;&#x5219;&#x3002; &#x673A;&#x68B0;&#x62FC;&#x51D1;&#x7684;&#x4EA7;&#x54C1;&#x867D;&#x7136;&#x878D;&#x5408;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x662F;&#x5E73;&#x5EB8;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x9879;&#x76EE;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x51FA;&#x9519;&#x7684;&#x6839;&#x6E90;&#x3002;&#x5F88;&#x50CF;&#x662F;&#x867D;&#x7136;&#x6709;&#x6CD5;&#x5F8B;&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A;&#x4EBA;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5404;&#x884C;&#x5176;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x6027;&#x662F;&#x7BA1;&#x7406;&#x8005;&#x7B2C;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x6709;&#x6240;&#x628A;&#x63E1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x5982;&#x4F55;&#x53BB;&#x6784;&#x5EFA;&#x4EA7;&#x54C1;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x8FBE;&#x6210;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x5728;&#x4E0B;&#x9762;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x4E0A;&#xFF0C;&#x7BA1;&#x7406;&#x8005;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x81F3;&#x5C11;&#x8981;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x4E0B;&#x9762;&#x7B80;&#x5355;&#x5217;&#x4E3E;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x5173;&#x952E;&#x7684;&#x8003;&#x91CF;&#xFF0C;&#x8FD9;&#x548C;&#x524D;&#x9762;&#x8BBA;&#x53CA;&#x7684;&#x5982;&#x4F55;&#x5F80;&#x535A;&#x7684;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x6709;&#x70B9;&#x91CD;&#x53E0;&#xFF1A;</p>
<p>&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x4EA7;&#x54C1;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;<br>&#x6BD4;&#x5982;&#xFF1A;&#x90A3;&#x4E9B;&#x6A21;&#x5757;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x641E;&#x5B9A;&#x800C;&#x90A3;&#x4E9B;&#x8D2D;&#x5165;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8D2D;&#x5165;&#x7684;&#x65F6;&#x5019;&#x8981;&#x9075;&#x5FAA;&#x600E;&#x4E48;&#x6837;&#x7684;&#x6807;&#x51C6;&#x53BB;&#x9009;&#x62E9;&#x3002;<br>&#x4F7F;&#x7528;&#x90A3;&#x79CD;&#x5E73;&#x53F0;&#x6280;&#x672F;<br>&#x6BD4;&#x5982;&#xFF1A;&#x662F;&#x4F7F;&#x7528;&#x5FAE;&#x8F6F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD8;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x6280;&#x672F;&#x3002;<br>&#x73B0;&#x884C;&#x67B6;&#x6784;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x8FBE;&#x6210;&#x4EA7;&#x54C1;&#x76EE;&#x6807;<br>&#x6BD4;&#x5982;&#xFF1A;&#x5728;&#x786C;&#x4EF6;&#x52A0;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x652F;&#x6491;&#x7684;&#x5E76;&#x53D1;&#x6570;&#x76EE;&#x3002;<br>&#x4EE3;&#x7801;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x5982;&#x4F55;&#x7EA6;&#x675F;<br>&#x8FD9;&#x8981;&#x6C42;&#x5FC5;&#x987B;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x539F;&#x5219;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4EC0;&#x4E48;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x3001;&#x6B63;&#x4EA4;&#x5206;&#x89E3;&#x3001;&#x62BD;&#x8C61;&#x662F;&#x5426;&#x5145;&#x5206;&#x7B49;&#x3002;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x65E0;&#x6B67;&#x4E49;&#x6307;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5708;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x6536;&#x76CA;&#x5E73;&#x8861;&#x3002;<br>&#x90A3;&#x4E9B;&#x73AF;&#x8282;&#x5FC5;&#x987B;&#x56FA;&#x5316;&#x4E3A;&#x6D41;&#x7A0B;&#xFF0C;&#x90A3;&#x4E9B;&#x4E00;&#x5B9A;&#x8981;&#x56E2;&#x961F;&#x81EA;&#x7531;&#x51B3;&#x5B9A;<br>&#x6BD4;&#x5982;&#x6587;&#x6863;&#x5316;&#x8981;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x624D;&#x5408;&#x9002;&#xFF0C;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x95F4;&#x4EC0;&#x4E48;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;<br> &#x2026; &#x2026;<br>&#x5047;&#x8BBE;&#x8BF4;&#x6709;&#x4EBA;&#x4E0D;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x505A;&#x4E86;&#x7BA1;&#x7406;&#x540E;&#xFF0C;&#x8868;&#x73B0;&#x51FA;&#x8DB3;&#x591F;&#x7684;&#x60F0;&#x6027;&#xFF0C;&#x4E0D;&#x518D;&#x6301;&#x7EED;&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF1F;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#x4F1A;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x7BA1;&#x7406;&#x5012;&#x7F6E;&#x3002;&#x5373;&#x7BA1;&#x7406;&#x8005;&#x662F;&#x540D;&#x4E49;&#x4E0A;&#x7684;&#x4E0A;&#x7EA7;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x5931;&#x53BB;&#x5BF9;&#x73B0;&#x573A;&#x7684;&#x628A;&#x63E1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x51B3;&#x7B56;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x4E0B;&#x5C5E;&#x3002;&#x5F97;&#x529B;&#x4E0B;&#x5C5E;&#x4E0D;&#x5728;&#xFF0C;&#x5404;&#x79CD;&#x51B3;&#x5B9A;&#x5C31;&#x53EA;&#x80FD;&#x9760;&#x778E;&#x8499;&#xFF0C;&#x6700;&#x7EC8;&#x53D8;&#x6210;&#x53EA;&#x4F1A;&#x6C9F;&#x901A;&#x7684;&#x7BA1;&#x7406;&#x8005;&#x2014;&#x5373;&#x4F7F;&#x88AB;&#x98DF;&#x4EBA;&#x65CF;&#x5403;&#x4E86;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x4EBA;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x4EF7;&#x503C;&#x5DF2;&#x7ECF;&#x88AB;&#x65E0;&#x9650;&#x7A00;&#x91CA;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8C61;&#x5F81;&#x6027;&#x7684;&#x7B26;&#x53F7;&#x3002;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x548C;&#x4E0B;&#x5C5E;&#x7206;&#x53D1;&#x6FC0;&#x70C8;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x7C7B;&#x7BA1;&#x7406;&#x8005;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7ACB;&#x573A;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x4EFB;&#x52A1;&#x53EA;&#x80FD;&#x4E0B;&#x538B;&#x3002;&#x7ED3;&#x679C;&#x540C;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x504F;&#x79BB;&#x4E07;&#x91CC;&#xFF0C;&#x4E0D;&#x5177;&#x6709;&#x53EF;&#x5B9E;&#x73B0;&#x6027;&#xFF0C;&#x8FD9;&#x7C7B;&#x7BA1;&#x7406;&#x8005;&#x65E0;&#x6CD5;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4E0A;&#x53F8;&#x9648;&#x8FF0;&#xFF0C;&#x4E5F;&#x5C31;&#x53EA;&#x80FD;&#x5411;&#x4E0B;&#x8F6C;&#x79FB;&#x538B;&#x529B;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x662F;&#x90A3;&#x79CD;&#xFF0C;&#x4E00;&#x65E6;&#x5230;&#x8FD9;&#x79CD;&#x5730;&#x6B65;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x8D8B;&#x4E8E;&#x5931;&#x8D25;&#xFF0C;&#x53EA;&#x80FD;&#x7948;&#x7977;&#x98DF;&#x4EBA;&#x65CF;&#x4E0D;&#x8981;&#x6765;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4E2D;&#x5C42;&#x7BA1;&#x7406;&#x8005;&#x4E5F;&#x8981;&#x575A;&#x6301;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;&#xFF1F;</p>
<p>&#x5728;IT&#x884C;&#x4E1A;&#x6D41;&#x4F20;&#x7740;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x540D;&#x7684;&#x5173;&#x4E8E;&#x98DF;&#x4EBA;&#x65CF;&#x7684;&#x7B11;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B11;&#x8BDD;&#x8BF4;&#x7684;&#x662F;&#xFF1A;</p>
<p>&#x4E24;&#x4E2A;&#x98DF;&#x4EBA;&#x65CF;&#x7684;&#x4EBA;&#x5E94;&#x8058;&#x8FDB;&#x4E86;&#x67D0;&#x5BB6;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x4EBA;&#x4E8B;&#x4E3B;&#x7BA1;&#x77E5;&#x9053;&#x8FD9;&#x4E24;&#x4E2A;&#x8FD9;&#x4F19;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x5403;&#x4EBA;&#xFF0C;&#x4E8E;&#x662F;&#x8B66;&#x544A;&#x4ED6;&#x4EEC;&#xFF1A;&#x201C;&#x5982;&#x679C;&#x4F60;&#x4EEC;&#x80C6;&#x6562;&#x5728;&#x516C;&#x53F8;&#x5403;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4F60;&#x4EEC;&#x5C31;&#x4F1A;&#x7ACB;&#x5373;&#x88AB;&#x7092;&#x6389;&#xFF01;&#x201D;&#x4E24;&#x4E2A;&#x98DF;&#x4EBA;&#x65CF;&#x552F;&#x552F;&#x558F;&#x558F;&#x5730;&#x7B54;&#x5E94;&#xFF0C;&#x8868;&#x793A;&#x7EDD;&#x4E0D;&#x4F1A;&#x5728;&#x516C;&#x53F8;&#x5403;&#x4EBA;&#x3002;&#x4E24;&#x4E2A;&#x6708;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x516C;&#x53F8;&#x5E73;&#x5B89;&#x65E0;&#x4E8B;&#x3002;</p>
<p>&#x7A81;&#x7136;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x516C;&#x53F8;&#x53D1;&#x73B0;&#x8D1F;&#x8D23;&#x6253;&#x626B;&#x516C;&#x53F8;&#x536B;&#x751F;&#x7684;&#x6E05;&#x6D01;&#x5DE5;&#x4E0D;&#x89C1;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x4EBA;&#x4E8B;&#x4E3B;&#x7BA1;&#x975E;&#x5E38;&#x6C14;&#x6124;&#xFF0C;&#x627E;&#x6765;&#x4E24;&#x4E2A;&#x98DF;&#x4EBA;&#x65CF;&#x6012;&#x65A5;&#xFF0C;&#x5E76;&#x5F53;&#x573A;&#x7092;&#x6389;&#x4E86;&#x4ED6;&#x4EEC;&#x3002;&#x51FA;&#x4E86;&#x516C;&#x53F8;&#x5927;&#x95E8;&#xFF0C;&#x4E00;&#x4E2A;&#x98DF;&#x4EBA;&#x65CF;&#x9A6C;&#x4E0A;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x62B1;&#x6028;&#x8D77;&#x6765;&#xFF1A;&#x201C;&#x6211;&#x4E00;&#x76F4;&#x8B66;&#x544A;&#x4F60;&#x4E0D;&#x8981;&#x5403;&#x6709;&#x5728;&#x505A;&#x4E8B;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x4E0D;&#x542C;&#xFF01;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x6708;&#x6765;&#x6BCF;&#x5929;&#x5403;&#x4E00;&#x4E2A;&#x7ECF;&#x7406;&#xFF0C;&#x6CA1;&#x4EBA;&#x53D1;&#x73B0;&#x3002;&#x4F60;&#x770B;&#x73B0;&#x5728;&#x5403;&#x4E86;&#x6E05;&#x6D01;&#x5DE5;&#xFF0C;&#x4ED6;&#x4EEC;&#x9A6C;&#x4E0A;&#x5C31;&#x53D1;&#x73B0;&#x4E86;&#xFF01;&#x4F60;&#x771F;&#x662F;&#x4E2A;&#x732A;&#xFF01;&#x201D;</p>
<p>&#x8FD9;&#x4E2A;&#x7B11;&#x8BDD;&#x5632;&#x8BBD;&#x7684;&#x662F;&#x67D0;&#x4E9B;&#x5927;&#x516C;&#x53F8;&#x5927;&#x4F01;&#x4E1A;&#x75C5;&#x53D1;&#x4F5C;&#xFF0C;&#x4EBA;&#x6D6E;&#x4E8E;&#x4E8B;&#x3002;&#x5927;&#x4F01;&#x4E1A;&#x75C5;&#x7684;&#x6210;&#x56E0;&#x5F88;&#x96BE;&#x4E00;&#x4E0B;&#x5B50;&#x8BF4;&#x7684;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x5374;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x5BFC;&#x81F4;&#x8F83;&#x591A;&#x4EBA;&#x6210;&#x4E3A;&#x4E2D;&#x5C42;&#x7BA1;&#x7406;&#x8005;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x6210;&#x529F;&#x7684;&#x4F01;&#x4E1A;&#x5929;&#x7136;&#x6709;&#x611F;&#x67D3;&#x5927;&#x4F01;&#x4E1A;&#x75C5;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x90A3;&#x65E0;&#x7591;&#x7684;&#x4E2D;&#x5C42;&#x7BA1;&#x7406;&#x8005;&#x4E5F;&#x5929;&#x7136;&#x6709;&#x7740;&#x81A8;&#x80C0;&#x8D8B;&#x52BF;&#x3002;&#x4ECE;&#x4E2A;&#x4EBA;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x6210;&#x4E3A;&#x88AB;&#x98DF;&#x4EBA;&#x9B54;&#x5403;&#x6389;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x5728;&#x610F;&#x7684;&#x7ECF;&#x5386;&#x5E76;&#x975E;&#x662F;&#x4EC0;&#x4E48;&#x597D;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B58;&#x5728;&#x4EF7;&#x503C;&#x51CF;&#x5F31;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;&#x3002;&#x4E00;&#x65E6;&#x9762;&#x4E34;&#x88C1;&#x5458;&#x8FD9;&#x7C7B;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x5F88;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5931;&#x53BB;&#x4E86;&#x9762;&#x5BF9;&#x6B8B;&#x9177;&#x7ADE;&#x4E89;&#x7684;&#x80FD;&#x529B;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://snowyying.site/2016/gen-programming-guide-6-golden-time/" data-id="cjqgotzgj002hx4ucws68157c" class="article-share-link">Share</a>
      
        <a href="http://snowyying.site/2016/gen-programming-guide-6-golden-time/#ds-thread" class="article-comment-link">留言</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/IT/">IT</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/发展/">发展</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/成长/">成长</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/指南/">指南</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/程序员/">程序员</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/gen-programming-guide-7-driving-force/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Newer</strong>
      <div class="article-nav-title">
        
          码路指南：物质驱动与兴趣驱动 编程驱动力是什么？
        
      </div>
    </a>
  
  
    <a href="/2016/gen-programming-guide-5-balance/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">码路指南：在博与专之间取得平衡 平衡最合适</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <!-- 多说评论框 start -->
  <div class="ds-thread" data-thread-key="2016/gen-programming-guide-6-golden-time/" data-title="码路指南：别错过人生中学习的黄金时期 保持知识更新" data-url="http://snowyying.site/2016/gen-programming-guide-6-golden-time/"></div>
  <!-- 多说评论框 end -->
  <!-- 多说公共JS代码 start (一个网页只需插入一次) -->
  <script type="text/javascript">
  var duoshuoQuery = {short_name:"snowyying"};
  (function() {
  	var ds = document.createElement('script');
  	ds.type = 'text/javascript';ds.async = true;
  	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
  	ds.charset = 'UTF-8';
  	(document.getElementsByTagName('head')[0]
  	 || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
  </script>
  <!-- 多说公共JS代码 end -->
</section>

</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/C-C/">C/C++</a><span class="category-list-count">11</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Embedded-IoT/">Embedded & IoT</a><span class="category-list-count">8</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/General/">General</a><span class="category-list-count">19</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Media/">Media</a><span class="category-list-count">7</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Misc/">Misc</a><span class="category-list-count">5</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Network/">Network</a><span class="category-list-count">23</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/OS/">OS</a><span class="category-list-count">12</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/SA-SWE/">SA & SWE</a><span class="category-list-count">23</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Security/">Security</a><span class="category-list-count">12</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Test/">Test</a><span class="category-list-count">3</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Web/">Web</a><span class="category-list-count">13</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/32-bit/" style="font-size: 10px;">32-bit</a> <a href="/tags/4-1/" style="font-size: 10px;">4+1</a> <a href="/tags/ARM/" style="font-size: 10px;">ARM</a> <a href="/tags/ARP/" style="font-size: 10px;">ARP</a> <a href="/tags/AT指令/" style="font-size: 10px;">AT指令</a> <a href="/tags/Angle/" style="font-size: 10px;">Angle</a> <a href="/tags/Angular/" style="font-size: 10px;">Angular</a> <a href="/tags/AngularJS/" style="font-size: 10px;">AngularJS</a> <a href="/tags/Backend/" style="font-size: 10px;">Backend</a> <a href="/tags/Big-Endian/" style="font-size: 10px;">Big-Endian</a> <a href="/tags/Bitrate/" style="font-size: 10px;">Bitrate</a> <a href="/tags/Boost/" style="font-size: 10px;">Boost</a> <a href="/tags/C/" style="font-size: 10.83px;">C</a> <a href="/tags/C/" style="font-size: 11.67px;">C++</a> <a href="/tags/C-C/" style="font-size: 16.67px;">C/C++</a> <a href="/tags/CMMI/" style="font-size: 10.83px;">CMMI</a> <a href="/tags/Cloud/" style="font-size: 10px;">Cloud</a> <a href="/tags/DNS/" style="font-size: 10px;">DNS</a> <a href="/tags/DSS/" style="font-size: 10px;">DSS</a> <a href="/tags/ESP82xx/" style="font-size: 10px;">ESP82xx</a> <a href="/tags/Frontend/" style="font-size: 10px;">Frontend</a> <a href="/tags/GPIO/" style="font-size: 10.83px;">GPIO</a> <a href="/tags/GUID/" style="font-size: 10px;">GUID</a> <a href="/tags/Google/" style="font-size: 10px;">Google</a> <a href="/tags/GraphQL/" style="font-size: 10px;">GraphQL</a> <a href="/tags/H264/" style="font-size: 10px;">H264</a> <a href="/tags/I-O/" style="font-size: 15.83px;">I/O</a> <a href="/tags/ICE/" style="font-size: 10.83px;">ICE</a> <a href="/tags/ICMP/" style="font-size: 10px;">ICMP</a> <a href="/tags/IGMP/" style="font-size: 10px;">IGMP</a> <a href="/tags/IIC/" style="font-size: 10px;">IIC</a> <a href="/tags/IP/" style="font-size: 10px;">IP</a> <a href="/tags/IP-协议/" style="font-size: 10px;">IP 协议</a> <a href="/tags/IT/" style="font-size: 19.17px;">IT</a> <a href="/tags/IT，-技术，-解读/" style="font-size: 10px;">IT， 技术， 解读</a> <a href="/tags/IaaS/" style="font-size: 10px;">IaaS</a> <a href="/tags/IoT/" style="font-size: 12.5px;">IoT</a> <a href="/tags/Iot/" style="font-size: 10px;">Iot</a> <a href="/tags/JSON/" style="font-size: 10px;">JSON</a> <a href="/tags/KAs/" style="font-size: 10px;">KAs</a> <a href="/tags/Kali/" style="font-size: 12.5px;">Kali</a> <a href="/tags/Key/" style="font-size: 10px;">Key</a> <a href="/tags/Linux/" style="font-size: 10.83px;">Linux</a> <a href="/tags/Little-Endian/" style="font-size: 10px;">Little-Endian</a> <a href="/tags/LoRa/" style="font-size: 10px;">LoRa</a> <a href="/tags/MQTT/" style="font-size: 10px;">MQTT</a> <a href="/tags/Metapackages/" style="font-size: 10px;">Metapackages</a> <a href="/tags/NAT/" style="font-size: 10.83px;">NAT</a> <a href="/tags/NATP/" style="font-size: 10px;">NATP</a> <a href="/tags/NB-IoT/" style="font-size: 10px;">NB-IoT</a> <a href="/tags/NSA/" style="font-size: 10px;">NSA</a> <a href="/tags/NTP/" style="font-size: 10px;">NTP</a> <a href="/tags/OS/" style="font-size: 13.33px;">OS</a> <a href="/tags/PaaS/" style="font-size: 10px;">PaaS</a> <a href="/tags/Proactor/" style="font-size: 10px;">Proactor</a> <a href="/tags/Push/" style="font-size: 10px;">Push</a> <a href="/tags/RARP/" style="font-size: 10px;">RARP</a> <a href="/tags/REST/" style="font-size: 10px;">REST</a> <a href="/tags/RESTful/" style="font-size: 10px;">RESTful</a> <a href="/tags/RTCP/" style="font-size: 10px;">RTCP</a> <a href="/tags/RTP/" style="font-size: 10px;">RTP</a> <a href="/tags/RTSP/" style="font-size: 10.83px;">RTSP</a> <a href="/tags/Reactor/" style="font-size: 10px;">Reactor</a> <a href="/tags/Redmine/" style="font-size: 10px;">Redmine</a> <a href="/tags/SA/" style="font-size: 16.67px;">SA</a> <a href="/tags/SNMP/" style="font-size: 10px;">SNMP</a> <a href="/tags/SO-REUSEADDR/" style="font-size: 10px;">SO_REUSEADDR</a> <a href="/tags/SQLite/" style="font-size: 10px;">SQLite</a> <a href="/tags/SQuaRE/" style="font-size: 10px;">SQuaRE</a> <a href="/tags/SSL/" style="font-size: 10px;">SSL</a> <a href="/tags/STUN/" style="font-size: 10.83px;">STUN</a> <a href="/tags/SWE/" style="font-size: 17.5px;">SWE</a> <a href="/tags/SaaS/" style="font-size: 10px;">SaaS</a> <a href="/tags/Server/" style="font-size: 10px;">Server</a> <a href="/tags/Shadow-broker/" style="font-size: 10px;">Shadow broker</a> <a href="/tags/Sigfox/" style="font-size: 10px;">Sigfox</a> <a href="/tags/State/" style="font-size: 10px;">State</a> <a href="/tags/TCP/" style="font-size: 10px;">TCP</a> <a href="/tags/TCP-协议/" style="font-size: 10px;">TCP 协议</a> <a href="/tags/TCP-IP/" style="font-size: 10.83px;">TCP/IP</a> <a href="/tags/TCP-IP-协议/" style="font-size: 18.33px;">TCP/IP 协议</a> <a href="/tags/TLS/" style="font-size: 10px;">TLS</a> <a href="/tags/TRUN/" style="font-size: 10.83px;">TRUN</a> <a href="/tags/TWSI/" style="font-size: 10px;">TWSI</a> <a href="/tags/Test/" style="font-size: 10px;">Test</a> <a href="/tags/Tool/" style="font-size: 11.67px;">Tool</a> <a href="/tags/UDP/" style="font-size: 10px;">UDP</a> <a href="/tags/UDP-协议/" style="font-size: 10px;">UDP 协议</a> <a href="/tags/UML/" style="font-size: 10.83px;">UML</a> <a href="/tags/UPNP/" style="font-size: 10px;">UPNP</a> <a href="/tags/UUID/" style="font-size: 10px;">UUID</a> <a href="/tags/Ubuntu/" style="font-size: 10px;">Ubuntu</a> <a href="/tags/VS/" style="font-size: 10px;">VS</a> <a href="/tags/WIFI/" style="font-size: 10px;">WIFI</a> <a href="/tags/WS-Security/" style="font-size: 10px;">WS-Security</a> <a href="/tags/Web/" style="font-size: 15.83px;">Web</a> <a href="/tags/Websocket/" style="font-size: 10px;">Websocket</a> <a href="/tags/Windows/" style="font-size: 10px;">Windows</a> <a href="/tags/Zero-Copy/" style="font-size: 10px;">Zero-Copy</a> <a href="/tags/ZigBee/" style="font-size: 10px;">ZigBee</a> <a href="/tags/blog/" style="font-size: 10px;">blog</a> <a href="/tags/bootstrap/" style="font-size: 10px;">bootstrap</a> <a href="/tags/coturn/" style="font-size: 10px;">coturn</a> <a href="/tags/curl/" style="font-size: 10px;">curl</a> <a href="/tags/decode/" style="font-size: 10px;">decode</a> <a href="/tags/define/" style="font-size: 10px;">define</a> <a href="/tags/eMTC/" style="font-size: 10px;">eMTC</a> <a href="/tags/epoll/" style="font-size: 11.67px;">epoll</a> <a href="/tags/ffmpeg/" style="font-size: 10.83px;">ffmpeg</a> <a href="/tags/ffplay/" style="font-size: 10px;">ffplay</a> <a href="/tags/ffprobe/" style="font-size: 10px;">ffprobe</a> <a href="/tags/github/" style="font-size: 10px;">github</a> <a href="/tags/h264/" style="font-size: 10px;">h264</a> <a href="/tags/http/" style="font-size: 10.83px;">http</a> <a href="/tags/https/" style="font-size: 10.83px;">https</a> <a href="/tags/ionic/" style="font-size: 10px;">ionic</a> <a href="/tags/libcssl/" style="font-size: 10px;">libcssl</a> <a href="/tags/linux/" style="font-size: 10.83px;">linux</a> <a href="/tags/mqtt/" style="font-size: 10px;">mqtt</a> <a href="/tags/nginx/" style="font-size: 10px;">nginx</a> <a href="/tags/p2p/" style="font-size: 10.83px;">p2p</a> <a href="/tags/pipe/" style="font-size: 10px;">pipe</a> <a href="/tags/poll/" style="font-size: 10.83px;">poll</a> <a href="/tags/select/" style="font-size: 12.5px;">select</a> <a href="/tags/setsockopt/" style="font-size: 10px;">setsockopt</a> <a href="/tags/socket/" style="font-size: 10.83px;">socket</a> <a href="/tags/swebok/" style="font-size: 10px;">swebok</a> <a href="/tags/不定参数/" style="font-size: 10px;">不定参数</a> <a href="/tags/串口/" style="font-size: 10px;">串口</a> <a href="/tags/交叉编译/" style="font-size: 10px;">交叉编译</a> <a href="/tags/信息收集/" style="font-size: 10px;">信息收集</a> <a href="/tags/公众号/" style="font-size: 10px;">公众号</a> <a href="/tags/内存泄露/" style="font-size: 10px;">内存泄露</a> <a href="/tags/内核/" style="font-size: 10px;">内核</a> <a href="/tags/函数/" style="font-size: 10px;">函数</a> <a href="/tags/勘误/" style="font-size: 10px;">勘误</a> <a href="/tags/勘误表/" style="font-size: 10px;">勘误表</a> <a href="/tags/卖油翁/" style="font-size: 10px;">卖油翁</a> <a href="/tags/压力测试/" style="font-size: 10px;">压力测试</a> <a href="/tags/发展/" style="font-size: 15.83px;">发展</a> <a href="/tags/发音/" style="font-size: 10px;">发音</a> <a href="/tags/同步/" style="font-size: 10px;">同步</a> <a href="/tags/复用/" style="font-size: 10px;">复用</a> <a href="/tags/多播/" style="font-size: 10px;">多播</a> <a href="/tags/大小端/" style="font-size: 10px;">大小端</a> <a href="/tags/安全/" style="font-size: 13.33px;">安全</a> <a href="/tags/宏/" style="font-size: 10px;">宏</a> <a href="/tags/客户端/" style="font-size: 10.83px;">客户端</a> <a href="/tags/嵌入式/" style="font-size: 10px;">嵌入式</a> <a href="/tags/工具/" style="font-size: 10px;">工具</a> <a href="/tags/工厂模式/" style="font-size: 10px;">工厂模式</a> <a href="/tags/广播/" style="font-size: 10px;">广播</a> <a href="/tags/应用证书/" style="font-size: 10px;">应用证书</a> <a href="/tags/开发/" style="font-size: 10px;">开发</a> <a href="/tags/异步/" style="font-size: 10px;">异步</a> <a href="/tags/微信/" style="font-size: 10.83px;">微信</a> <a href="/tags/快速-GPIO/" style="font-size: 10px;">快速 GPIO</a> <a href="/tags/性能/" style="font-size: 12.5px;">性能</a> <a href="/tags/成长/" style="font-size: 18.33px;">成长</a> <a href="/tags/技术/" style="font-size: 10px;">技术</a> <a href="/tags/技术图谱/" style="font-size: 10px;">技术图谱</a> <a href="/tags/技术路线/" style="font-size: 10px;">技术路线</a> <a href="/tags/技能/" style="font-size: 10px;">技能</a> <a href="/tags/投资/" style="font-size: 10px;">投资</a> <a href="/tags/指南/" style="font-size: 15.83px;">指南</a> <a href="/tags/按键/" style="font-size: 10px;">按键</a> <a href="/tags/按键扫描/" style="font-size: 10px;">按键扫描</a> <a href="/tags/操作系统/" style="font-size: 10px;">操作系统</a> <a href="/tags/支付/" style="font-size: 10.83px;">支付</a> <a href="/tags/攻略/" style="font-size: 10px;">攻略</a> <a href="/tags/教程/" style="font-size: 10px;">教程</a> <a href="/tags/数据库/" style="font-size: 10px;">数据库</a> <a href="/tags/数据链路层/" style="font-size: 10px;">数据链路层</a> <a href="/tags/文学/" style="font-size: 10px;">文学</a> <a href="/tags/无线电/" style="font-size: 10px;">无线电</a> <a href="/tags/时间/" style="font-size: 10px;">时间</a> <a href="/tags/服务器证书/" style="font-size: 10px;">服务器证书</a> <a href="/tags/构造/" style="font-size: 10px;">构造</a> <a href="/tags/架构/" style="font-size: 12.5px;">架构</a> <a href="/tags/根证书/" style="font-size: 10px;">根证书</a> <a href="/tags/框架/" style="font-size: 10.83px;">框架</a> <a href="/tags/模式/" style="font-size: 10px;">模式</a> <a href="/tags/流媒体服务器/" style="font-size: 10px;">流媒体服务器</a> <a href="/tags/测试/" style="font-size: 11.67px;">测试</a> <a href="/tags/游戏/" style="font-size: 10px;">游戏</a> <a href="/tags/演进/" style="font-size: 10.83px;">演进</a> <a href="/tags/熟能生巧/" style="font-size: 10px;">熟能生巧</a> <a href="/tags/状态图/" style="font-size: 10px;">状态图</a> <a href="/tags/电磁波/" style="font-size: 10px;">电磁波</a> <a href="/tags/矩阵按键/" style="font-size: 10px;">矩阵按键</a> <a href="/tags/短信/" style="font-size: 10.83px;">短信</a> <a href="/tags/程序员/" style="font-size: 17.5px;">程序员</a> <a href="/tags/管道/" style="font-size: 10px;">管道</a> <a href="/tags/系统分析师/" style="font-size: 15px;">系统分析师</a> <a href="/tags/系统架构师/" style="font-size: 10.83px;">系统架构师</a> <a href="/tags/组播/" style="font-size: 10px;">组播</a> <a href="/tags/统一建模语言/" style="font-size: 10px;">统一建模语言</a> <a href="/tags/网站/" style="font-size: 10.83px;">网站</a> <a href="/tags/网络/" style="font-size: 20px;">网络</a> <a href="/tags/英语/" style="font-size: 10px;">英语</a> <a href="/tags/计算机/" style="font-size: 10px;">计算机</a> <a href="/tags/计算机原理/" style="font-size: 10px;">计算机原理</a> <a href="/tags/计算机组成/" style="font-size: 10px;">计算机组成</a> <a href="/tags/计算机结构/" style="font-size: 10px;">计算机结构</a> <a href="/tags/设计原则/" style="font-size: 10px;">设计原则</a> <a href="/tags/设计模式/" style="font-size: 14.17px;">设计模式</a> <a href="/tags/证书/" style="font-size: 10px;">证书</a> <a href="/tags/调试/" style="font-size: 10px;">调试</a> <a href="/tags/软件质量/" style="font-size: 10.83px;">软件质量</a> <a href="/tags/进程间通信/" style="font-size: 10px;">进程间通信</a> <a href="/tags/选路/" style="font-size: 10px;">选路</a> <a href="/tags/通信/" style="font-size: 10px;">通信</a> <a href="/tags/阿里大于/" style="font-size: 10px;">阿里大于</a> <a href="/tags/项目管理/" style="font-size: 10px;">项目管理</a> <a href="/tags/验证码/" style="font-size: 10px;">验证码</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/10/">2018-10</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/08/">2018-08</a><span class="archive-list-count">2</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2018/01/">2018-01</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/10/">2017-10</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/09/">2017-09</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/08/">2017-08</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/07/">2017-07</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/06/">2017-06</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/05/">2017-05</a><span class="archive-list-count">5</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/04/">2017-04</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/03/">2017-03</a><span class="archive-list-count">12</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">2017-02</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/01/">2017-01</a><span class="archive-list-count">15</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">2016-12</a><span class="archive-list-count">7</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/11/">2016-11</a><span class="archive-list-count">10</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/10/">2016-10</a><span class="archive-list-count">11</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/09/">2016-09</a><span class="archive-list-count">9</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/08/">2016-08</a><span class="archive-list-count">13</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/07/">2016-07</a><span class="archive-list-count">2</span></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">最新文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2018/os-io-zero-copy/">Zero-Copy &amp; sendfile 浅析</a>
          </li>
        
          <li>
            <a href="/2018/c-cpp-game-server-develop/">C++ 游戏服务器开发常用工具介绍</a>
          </li>
        
          <li>
            <a href="/2018/iot-connect-type/">物联网 - NB-IoT、eMTC、LoRa、Sigfox及ZigBee的应用场景</a>
          </li>
        
          <li>
            <a href="/2018/sa2v4-p02-operating-system/">系统架构师教程学习 - 操作系统</a>
          </li>
        
          <li>
            <a href="/2018/sa2v4-p01-structure-and-composition/">系统架构师教程学习 - 计算机结构及组成</a>
          </li>
        
          <li>
            <a href="/2018/gen-tech-interpretation/">史上最污技术解读</a>
          </li>
        
          <li>
            <a href="/2018/swe-10-common-patterns/">10种常见的软件架构模式</a>
          </li>
        
          <li>
            <a href="/2018/security-lost-in-translation-leak/">The Shadow Brokers &quot;Lost In Translation&quot; leak</a>
          </li>
        
          <li>
            <a href="/2018/security-kali-metapackages/">Kali Linux Metapackages</a>
          </li>
        
          <li>
            <a href="/2018/security-kali-stress-testing-tool/">Kali Linux - Stress Testing Tool</a>
          </li>
        
          <li>
            <a href="/2018/security-kali-Info-gathering-tool/">Kali Linux - Information Gathering Tool</a>
          </li>
        
          <li>
            <a href="/2018/security-kali-tools-listing/">Kali Linux - Tools Listing</a>
          </li>
        
      </ul>
    </div>
  </div>


  
    

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2019 Snowyying<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> . 
Analyse with <script src="https://s4.cnzz.com/z_stat.php?id=1260081840&web_id=1260081840" language="JavaScript"></script>

    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
    <a href="/About" class="mobile-nav-link">About</a>
  
</nav>
    

<script src="http://libs.baidu.com/jquery/2.0.3/jquery.min.js"></script>
<script type="text/javascript">
//<![CDATA[
if (typeof jQuery == 'undefined') {
document.write(unescape("%3Cscript src='/js/jquery-2.0.3.min.js' type='text/javascript'%3E%3C/script%3E"));
}
// ]]>
</script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>